mod gen_bindings {
    #![allow(non_camel_case_types)]
    #![allow(non_upper_case_globals)]
    #![allow(non_snake_case)]
    #![allow(unused_unsafe)]
    #![allow(clippy::all)]
    /* automatically generated by rust-bindgen 0.59.2 */

    #[repr(C)]
    #[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
    pub struct __BindgenBitfieldUnit<Storage> {
        storage: Storage,
    }
    impl<Storage> __BindgenBitfieldUnit<Storage> {
        #[inline]
        pub const fn new(storage: Storage) -> Self {
            Self { storage }
        }
    }
    impl<Storage> __BindgenBitfieldUnit<Storage>
    where
        Storage: AsRef<[u8]> + AsMut<[u8]>,
    {
        #[inline]
        pub fn get_bit(&self, index: usize) -> bool {
            debug_assert!(index / 8 < self.storage.as_ref().len());
            let byte_index = index / 8;
            let byte = self.storage.as_ref()[byte_index];
            let bit_index = if cfg!(target_endian = "big") {
                7 - (index % 8)
            } else {
                index % 8
            };
            let mask = 1 << bit_index;
            byte & mask == mask
        }
        #[inline]
        pub fn set_bit(&mut self, index: usize, val: bool) {
            debug_assert!(index / 8 < self.storage.as_ref().len());
            let byte_index = index / 8;
            let byte = &mut self.storage.as_mut()[byte_index];
            let bit_index = if cfg!(target_endian = "big") {

    pub const SOCK_SUPPORT_ZC: u32 = 5;
    pub const SOCK_CUSTOM_SOCKOPT: u32 = 6;
    pub const SOCK_PASSPIDFD: u32 = 7;
    pub const SOCK_TYPE_MASK: u32 = 15;
    pub const SOCK_CLOEXEC: u32 = 524288;
    pub const SOCK_NONBLOCK: u32 = 2048;
    pub const BPF_FS_MAGIC: u32 = 3405662737;
    pub const SOCK_DESTROY_TIME: u32 = 2500;
    pub const SOCK_BINDADDR_LOCK: u32 = 4;
    pub const SOCK_BINDPORT_LOCK: u32 = 8;
    pub type __s8 = ::cty::c_schar;
    pub type __u8 = ::cty::c_uchar;
    pub type __s16 = ::cty::c_short;
    pub type __u16 = ::cty::c_ushort;
    pub type __s32 = ::cty::c_int;
    pub type __u32 = ::cty::c_uint;
    pub type __s64 = ::cty::c_longlong;
    pub type __u64 = ::cty::c_ulonglong;
    pub type s8 = __s8;
    pub type _cargo_bpf_u8 = __u8;
    pub type s16 = __s16;
    pub type _cargo_bpf_u16 = __u16;
    pub type s32 = __s32;
    pub type _cargo_bpf_u32 = __u32;
    pub type s64 = __s64;
    pub type _cargo_bpf_u64 = __u64;
    pub type __kernel_long_t = ::cty::c_long;
    pub type __kernel_ulong_t = ::cty::c_ulong;
    pub type __kernel_pid_t = ::cty::c_int;
    pub type __kernel_uid32_t = ::cty::c_uint;
    pub type __kernel_gid32_t = ::cty::c_uint;
    pub type __kernel_size_t = __kernel_ulong_t;
    pub type __kernel_ssize_t = __kernel_long_t;
    pub type __kernel_loff_t = ::cty::c_longlong;
    pub type __kernel_time64_t = ::cty::c_longlong;
    pub type __kernel_clock_t = __kernel_long_t;
    pub type __kernel_timer_t = ::cty::c_int;
    pub type __kernel_clockid_t = ::cty::c_int;
    pub type __be16 = __u16;
    pub type __be32 = __u32;
    pub type __be64 = __u64;
    pub type __sum16 = __u16;
    pub type __wsum = __u32;
    pub type __poll_t = ::cty::c_uint;
    pub type __kernel_dev_t = _cargo_bpf_u32;
    pub type dev_t = __kernel_dev_t;
    pub type umode_t = ::cty::c_ushort;
    pub type pid_t = __kernel_pid_t;
    pub type clockid_t = __kernel_clockid_t;
    pub type bool_ = bool;
    pub type uid_t = __kernel_uid32_t;
    pub type gid_t = __kernel_gid32_t;
    pub type loff_t = __kernel_loff_t;
    pub type size_t = __kernel_size_t;
    pub type ssize_t = __kernel_ssize_t;
    #[doc = " The type used for indexing onto a disc or disc partition."]
    #[doc = ""]
    #[doc = " Linux always considers sectors to be 512 bytes long independently"]
    #[doc = " of the devices real block size."]
    #[doc = ""]
    #[doc = " blkcnt_t is the type of the inode's block count."]
    pub type sector_t = _cargo_bpf_u64;
    pub type blkcnt_t = _cargo_bpf_u64;
    pub type dma_addr_t = _cargo_bpf_u64;
    pub type gfp_t = ::cty::c_uint;
    pub type slab_flags_t = ::cty::c_uint;
    pub type fmode_t = ::cty::c_uint;
    pub type phys_addr_t = _cargo_bpf_u64;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct atomic_t {
        pub counter: ::cty::c_int,
    }
    #[test]
    fn bindgen_test_layout_atomic_t() {
        assert_eq!(
            ::core::mem::size_of::<atomic_t>(),
            4usize,
            concat!("Size of: ", stringify!(atomic_t))
        );
        assert_eq!(
            ::core::mem::align_of::<atomic_t>(),
            4usize,
            concat!("Alignment of ", stringify!(atomic_t))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<atomic_t>())).counter as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(atomic_t),
                "::",
                stringify!(counter)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct atomic64_t {
        pub counter: s64,
    }
    #[test]
    fn bindgen_test_layout_atomic64_t() {
        assert_eq!(
            ::core::mem::size_of::<atomic64_t>(),
            8usize,
            concat!("Size of: ", stringify!(atomic64_t))
        );
        assert_eq!(
            ::core::mem::align_of::<atomic64_t>(),
            8usize,
            concat!("Alignment of ", stringify!(atomic64_t))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<atomic64_t>())).counter as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(atomic64_t),
                "::",
                stringify!(counter)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct rcuref_t {
        pub refcnt: atomic_t,
    }
    #[test]
    fn bindgen_test_layout_rcuref_t() {
        assert_eq!(
            ::core::mem::size_of::<rcuref_t>(),
            4usize,
            concat!("Size of: ", stringify!(rcuref_t))
        );
        assert_eq!(
            ::core::mem::align_of::<rcuref_t>(),
            4usize,
            concat!("Alignment of ", stringify!(rcuref_t))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<rcuref_t>())).refcnt as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(rcuref_t),
                "::",
                stringify!(refcnt)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct list_head {
        pub next: *mut list_head,
        pub prev: *mut list_head,
    }
    #[test]
    fn bindgen_test_layout_list_head() {
        assert_eq!(
            ::core::mem::size_of::<list_head>(),
            16usize,
            concat!("Size of: ", stringify!(list_head))
        );
        assert_eq!(
            ::core::mem::align_of::<list_head>(),
            8usize,
            concat!("Alignment of ", stringify!(list_head))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<list_head>())).next as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(list_head),
                "::",
                stringify!(next)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<list_head>())).prev as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(list_head),
                "::",
                stringify!(prev)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct hlist_head {
        pub first: *mut hlist_node,
    }
    #[test]
    fn bindgen_test_layout_hlist_head() {
        assert_eq!(
            ::core::mem::size_of::<hlist_head>(),
            8usize,
            concat!("Size of: ", stringify!(hlist_head))
        );
        assert_eq!(
            ::core::mem::align_of::<hlist_head>(),
            8usize,
            concat!("Alignment of ", stringify!(hlist_head))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<hlist_head>())).first as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(hlist_head),
                "::",
                stringify!(first)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct hlist_node {
        pub next: *mut hlist_node,
        pub pprev: *mut *mut hlist_node,
    }
    #[test]
    fn bindgen_test_layout_hlist_node() {
        assert_eq!(
            ::core::mem::size_of::<hlist_node>(),
            16usize,
            concat!("Size of: ", stringify!(hlist_node))
        );
        assert_eq!(
            ::core::mem::align_of::<hlist_node>(),
            8usize,
            concat!("Alignment of ", stringify!(hlist_node))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<hlist_node>())).next as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(hlist_node),
                "::",
                stringify!(next)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<hlist_node>())).pprev as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(hlist_node),
                "::",
                stringify!(pprev)
            )
        );
    }
    #[doc = " struct callback_head - callback structure for use with RCU and task_work"]
    #[doc = " @next: next update requests in a list"]
    #[doc = " @func: actual update function to call after the grace period."]
    #[doc = ""]
    #[doc = " The struct is aligned to size of pointer. On most architectures it happens"]
    #[doc = " naturally due ABI requirements, but some architectures (like CRIS) have"]
    #[doc = " weird ABI and we need to ask it explicitly."]
    #[doc = ""]
    #[doc = " The alignment is required to guarantee that bit 0 of @next will be"]
    #[doc = " clear under normal conditions -- as long as we use call_rcu() or"]
    #[doc = " call_srcu() to queue the callback."]
    #[doc = ""]
    #[doc = " This guarantee is important for few reasons:"]
    #[doc = "  - future call_rcu_lazy() will make use of lower bits in the pointer;"]
    #[doc = "  - the structure shares storage space in struct page with @compound_head,"]
    #[doc = "    which encode PageTail() in bit 0. The guarantee is needed to avoid"]
    #[doc = "    false-positive PageTail()."]
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct callback_head {
        pub next: *mut callback_head,
        pub func: ::core::option::Option<unsafe extern "C" fn(head: *mut callback_head)>,
    }
    #[test]
    fn bindgen_test_layout_callback_head() {
        assert_eq!(
            ::core::mem::size_of::<callback_head>(),
            16usize,
            concat!("Size of: ", stringify!(callback_head))
        );
        assert_eq!(
            ::core::mem::align_of::<callback_head>(),
            8usize,
            concat!("Alignment of ", stringify!(callback_head))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<callback_head>())).next as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(callback_head),
                "::",
                stringify!(next)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<callback_head>())).func as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(callback_head),
                "::",
                stringify!(func)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct file_system_type {
        pub name: *const ::cty::c_char,
        pub fs_flags: ::cty::c_int,
        pub init_fs_context:
            ::core::option::Option<unsafe extern "C" fn(arg1: *mut fs_context) -> ::cty::c_int>,
        pub parameters: *const fs_parameter_spec,
        pub mount: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut file_system_type,
                arg2: ::cty::c_int,
                arg3: *const ::cty::c_char,
                arg4: *mut ::cty::c_void,
            ) -> *mut dentry,
        >,
        pub kill_sb: ::core::option::Option<unsafe extern "C" fn(arg1: *mut super_block)>,
        pub owner: *mut module,
        pub next: *mut file_system_type,
        pub fs_supers: hlist_head,
        pub s_lock_key: lock_class_key,
        pub s_umount_key: lock_class_key,
        pub s_vfs_rename_key: lock_class_key,
        pub s_writers_key: [lock_class_key; 3usize],
        pub i_lock_key: lock_class_key,
        pub i_mutex_key: lock_class_key,
        pub invalidate_lock_key: lock_class_key,
        pub i_mutex_dir_key: lock_class_key,
    }
    #[test]
    fn bindgen_test_layout_file_system_type() {
        assert_eq!(
            ::core::mem::size_of::<file_system_type>(),
            72usize,
            concat!("Size of: ", stringify!(file_system_type))
        );
        assert_eq!(
            ::core::mem::align_of::<file_system_type>(),
            8usize,
            concat!("Alignment of ", stringify!(file_system_type))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_system_type>())).name as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(file_system_type),
                "::",
                stringify!(name)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_system_type>())).fs_flags as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(file_system_type),
                "::",
                stringify!(fs_flags)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<file_system_type>())).init_fs_context as *const _ as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(file_system_type),
                "::",
                stringify!(init_fs_context)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<file_system_type>())).parameters as *const _ as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(file_system_type),
                "::",
                stringify!(parameters)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_system_type>())).mount as *const _ as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(file_system_type),
                "::",
                stringify!(mount)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_system_type>())).kill_sb as *const _ as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(file_system_type),
                "::",
                stringify!(kill_sb)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_system_type>())).owner as *const _ as usize },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(file_system_type),
                "::",
                stringify!(owner)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_system_type>())).next as *const _ as usize },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(file_system_type),
                "::",
                stringify!(next)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_system_type>())).fs_supers as *const _ as usize },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(file_system_type),
                "::",
                stringify!(fs_supers)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<file_system_type>())).s_lock_key as *const _ as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(file_system_type),
                "::",
                stringify!(s_lock_key)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<file_system_type>())).s_umount_key as *const _ as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(file_system_type),
                "::",
                stringify!(s_umount_key)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<file_system_type>())).s_vfs_rename_key as *const _ as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(file_system_type),
                "::",
                stringify!(s_vfs_rename_key)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<file_system_type>())).s_writers_key as *const _ as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(file_system_type),
                "::",
                stringify!(s_writers_key)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<file_system_type>())).i_lock_key as *const _ as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(file_system_type),
                "::",
                stringify!(i_lock_key)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<file_system_type>())).i_mutex_key as *const _ as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(file_system_type),
                "::",
                stringify!(i_mutex_key)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<file_system_type>())).invalidate_lock_key as *const _
                    as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(file_system_type),
                "::",
                stringify!(invalidate_lock_key)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<file_system_type>())).i_mutex_dir_key as *const _ as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(file_system_type),
                "::",
                stringify!(i_mutex_dir_key)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct pt_regs {
        pub r15: ::cty::c_ulong,
        pub r14: ::cty::c_ulong,
        pub r13: ::cty::c_ulong,
        pub r12: ::cty::c_ulong,
        pub bp: ::cty::c_ulong,
        pub bx: ::cty::c_ulong,
        pub r11: ::cty::c_ulong,
        pub r10: ::cty::c_ulong,
        pub r9: ::cty::c_ulong,
        pub r8: ::cty::c_ulong,
        pub ax: ::cty::c_ulong,
        pub cx: ::cty::c_ulong,
        pub dx: ::cty::c_ulong,
        pub si: ::cty::c_ulong,
        pub di: ::cty::c_ulong,
        pub orig_ax: ::cty::c_ulong,
        pub ip: ::cty::c_ulong,
        pub cs: ::cty::c_ulong,
        pub flags: ::cty::c_ulong,
        pub sp: ::cty::c_ulong,
        pub ss: ::cty::c_ulong,
    }
    #[test]
    fn bindgen_test_layout_pt_regs() {
        assert_eq!(
            ::core::mem::size_of::<pt_regs>(),
            168usize,
            concat!("Size of: ", stringify!(pt_regs))
        );
        assert_eq!(
            ::core::mem::align_of::<pt_regs>(),
            8usize,
            concat!("Alignment of ", stringify!(pt_regs))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pt_regs>())).r15 as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pt_regs),
                "::",
                stringify!(r15)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pt_regs>())).r14 as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(pt_regs),
                "::",
                stringify!(r14)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pt_regs>())).r13 as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(pt_regs),
                "::",
                stringify!(r13)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pt_regs>())).r12 as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(pt_regs),
                "::",
                stringify!(r12)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pt_regs>())).bp as *const _ as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(pt_regs),
                "::",
                stringify!(bp)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pt_regs>())).bx as *const _ as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(pt_regs),
                "::",
                stringify!(bx)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pt_regs>())).r11 as *const _ as usize },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(pt_regs),
                "::",
                stringify!(r11)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pt_regs>())).r10 as *const _ as usize },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(pt_regs),
                "::",
                stringify!(r10)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pt_regs>())).r9 as *const _ as usize },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(pt_regs),
                "::",
                stringify!(r9)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pt_regs>())).r8 as *const _ as usize },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(pt_regs),
                "::",
                stringify!(r8)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pt_regs>())).ax as *const _ as usize },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(pt_regs),
                "::",
                stringify!(ax)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pt_regs>())).cx as *const _ as usize },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(pt_regs),
                "::",
                stringify!(cx)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pt_regs>())).dx as *const _ as usize },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(pt_regs),
                "::",
                stringify!(dx)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pt_regs>())).si as *const _ as usize },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(pt_regs),
                "::",
                stringify!(si)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pt_regs>())).di as *const _ as usize },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(pt_regs),
                "::",
                stringify!(di)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pt_regs>())).orig_ax as *const _ as usize },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(pt_regs),
                "::",
                stringify!(orig_ax)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pt_regs>())).ip as *const _ as usize },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(pt_regs),
                "::",
                stringify!(ip)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pt_regs>())).cs as *const _ as usize },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(pt_regs),
                "::",
                stringify!(cs)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pt_regs>())).flags as *const _ as usize },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(pt_regs),
                "::",
                stringify!(flags)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pt_regs>())).sp as *const _ as usize },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(pt_regs),
                "::",
                stringify!(sp)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pt_regs>())).ss as *const _ as usize },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(pt_regs),
                "::",
                stringify!(ss)
            )
        );
    }
    #[repr(C, packed)]
    #[derive(Debug, Copy, Clone)]
    pub struct desc_struct {
        pub limit0: _cargo_bpf_u16,
        pub base0: _cargo_bpf_u16,
        pub _bitfield_align_1: [u8; 0],
        pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    }
    #[test]
    fn bindgen_test_layout_desc_struct() {
        assert_eq!(
            ::core::mem::size_of::<desc_struct>(),
            8usize,
            concat!("Size of: ", stringify!(desc_struct))
        );
        assert_eq!(
            ::core::mem::align_of::<desc_struct>(),
            1usize,
            concat!("Alignment of ", stringify!(desc_struct))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<desc_struct>())).limit0 as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(desc_struct),
                "::",
                stringify!(limit0)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<desc_struct>())).base0 as *const _ as usize },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(desc_struct),
                "::",
                stringify!(base0)
            )
        );
    }
    impl desc_struct {
        #[inline]
        pub fn base1(&self) -> _cargo_bpf_u16 {
            unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u16) }
        }
        #[inline]
        pub fn set_base1(&mut self, val: _cargo_bpf_u16) {
            unsafe {
                let val: u16 = ::core::mem::transmute(val);
                self._bitfield_1.set(0usize, 8u8, val as u64)
            }
        }
        #[inline]
        pub fn type_(&self) -> _cargo_bpf_u16 {
            unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 4u8) as u16) }
        }
        #[inline]
        pub fn set_type(&mut self, val: _cargo_bpf_u16) {
            unsafe {
                let val: u16 = ::core::mem::transmute(val);
                self._bitfield_1.set(8usize, 4u8, val as u64)
            }
        }
        #[inline]
        pub fn s(&self) -> _cargo_bpf_u16 {
            unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u16) }
        }
        #[inline]
        pub fn set_s(&mut self, val: _cargo_bpf_u16) {
            unsafe {
                let val: u16 = ::core::mem::transmute(val);
                self._bitfield_1.set(12usize, 1u8, val as u64)
            }
        }
        #[inline]
        pub fn dpl(&self) -> _cargo_bpf_u16 {
            unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 2u8) as u16) }
        }
        #[inline]
        pub fn set_dpl(&mut self, val: _cargo_bpf_u16) {
            unsafe {
                let val: u16 = ::core::mem::transmute(val);
                self._bitfield_1.set(13usize, 2u8, val as u64)
            }
        }
        #[inline]
        pub fn p(&self) -> _cargo_bpf_u16 {
            unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
        }
        #[inline]
        pub fn set_p(&mut self, val: _cargo_bpf_u16) {
            unsafe {
                let val: u16 = ::core::mem::transmute(val);
                self._bitfield_1.set(15usize, 1u8, val as u64)
            }
        }
        #[inline]
        pub fn limit1(&self) -> _cargo_bpf_u16 {
            unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 4u8) as u16) }
        }
        #[inline]
        pub fn set_limit1(&mut self, val: _cargo_bpf_u16) {
            unsafe {
                let val: u16 = ::core::mem::transmute(val);
                self._bitfield_1.set(16usize, 4u8, val as u64)
            }
        }
        #[inline]
        pub fn avl(&self) -> _cargo_bpf_u16 {
            unsafe { ::core::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u16) }
        }
        #[inline]
        pub fn set_avl(&mut self, val: _cargo_bpf_u16) {
            unsafe {
                let val: u16 = ::core::mem::transmute(val);
                self._bitfield_1.set(20usize, 1u8, val as u64)
            }
        }
        #[inline]
        pub fn l(&self) -> _cargo_bpf_u16 {
            unsafe { ::core::mem::transmute(self._bitfield_1.get(21usize, 1u8) as u16) }
        }
        #[inline]
        pub fn set_l(&mut self, val: _cargo_bpf_u16) {
            unsafe {
                let val: u16 = ::core::mem::transmute(val);
                self._bitfield_1.set(21usize, 1u8, val as u64)
            }
        }
        #[inline]
        pub fn d(&self) -> _cargo_bpf_u16 {
            unsafe { ::core::mem::transmute(self._bitfield_1.get(22usize, 1u8) as u16) }
        }
        #[inline]
        pub fn set_d(&mut self, val: _cargo_bpf_u16) {
            unsafe {
                let val: u16 = ::core::mem::transmute(val);
                self._bitfield_1.set(22usize, 1u8, val as u64)
            }
        }
        #[inline]
        pub fn g(&self) -> _cargo_bpf_u16 {
            unsafe { ::core::mem::transmute(self._bitfield_1.get(23usize, 1u8) as u16) }
        }
        #[inline]
        pub fn set_g(&mut self, val: _cargo_bpf_u16) {
            unsafe {
                let val: u16 = ::core::mem::transmute(val);
                self._bitfield_1.set(23usize, 1u8, val as u64)
            }
        }
        #[inline]
        pub fn base2(&self) -> _cargo_bpf_u16 {
            unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u16) }
        }
        #[inline]
        pub fn set_base2(&mut self, val: _cargo_bpf_u16) {
            unsafe {
                let val: u16 = ::core::mem::transmute(val);
                self._bitfield_1.set(24usize, 8u8, val as u64)
            }
        }
        #[inline]
        pub fn new_bitfield_1(
            base1: _cargo_bpf_u16,
            type_: _cargo_bpf_u16,
            s: _cargo_bpf_u16,
            dpl: _cargo_bpf_u16,
            p: _cargo_bpf_u16,
            limit1: _cargo_bpf_u16,
            avl: _cargo_bpf_u16,
            l: _cargo_bpf_u16,
            d: _cargo_bpf_u16,
            g: _cargo_bpf_u16,
            base2: _cargo_bpf_u16,
        ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
            let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> =
                Default::default();
            __bindgen_bitfield_unit.set(0usize, 8u8, {
                let base1: u16 = unsafe { ::core::mem::transmute(base1) };
                base1 as u64
            });
            __bindgen_bitfield_unit.set(8usize, 4u8, {
                let type_: u16 = unsafe { ::core::mem::transmute(type_) };
                type_ as u64
            });
            __bindgen_bitfield_unit.set(12usize, 1u8, {
                let s: u16 = unsafe { ::core::mem::transmute(s) };
                s as u64
            });
            __bindgen_bitfield_unit.set(13usize, 2u8, {
                let dpl: u16 = unsafe { ::core::mem::transmute(dpl) };
                dpl as u64
            });
            __bindgen_bitfield_unit.set(15usize, 1u8, {
                let p: u16 = unsafe { ::core::mem::transmute(p) };
                p as u64
            });
            __bindgen_bitfield_unit.set(16usize, 4u8, {
                let limit1: u16 = unsafe { ::core::mem::transmute(limit1) };
                limit1 as u64
            });
            __bindgen_bitfield_unit.set(20usize, 1u8, {
                let avl: u16 = unsafe { ::core::mem::transmute(avl) };
                avl as u64
            });
            __bindgen_bitfield_unit.set(21usize, 1u8, {
                let l: u16 = unsafe { ::core::mem::transmute(l) };
                l as u64
            });
            __bindgen_bitfield_unit.set(22usize, 1u8, {
                let d: u16 = unsafe { ::core::mem::transmute(d) };
                d as u64
            });
            __bindgen_bitfield_unit.set(23usize, 1u8, {
                let g: u16 = unsafe { ::core::mem::transmute(g) };
                g as u64
            });
            __bindgen_bitfield_unit.set(24usize, 8u8, {
                let base2: u16 = unsafe { ::core::mem::transmute(base2) };
                base2 as u64
            });
            __bindgen_bitfield_unit
        }
    }
    pub type pteval_t = ::cty::c_ulong;
    pub type pmdval_t = ::cty::c_ulong;
    pub type pudval_t = ::cty::c_ulong;
    pub type pgdval_t = ::cty::c_ulong;
    pub type pgprotval_t = ::cty::c_ulong;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct pte_t {
        pub pte: pteval_t,
    }
    #[test]
    fn bindgen_test_layout_pte_t() {
        assert_eq!(
            ::core::mem::size_of::<pte_t>(),
            8usize,
            concat!("Size of: ", stringify!(pte_t))
        );
        assert_eq!(
            ::core::mem::align_of::<pte_t>(),
            8usize,
            concat!("Alignment of ", stringify!(pte_t))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pte_t>())).pte as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pte_t),
                "::",
                stringify!(pte)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct pmd_t {
        pub pmd: pmdval_t,
    }
    #[test]
    fn bindgen_test_layout_pmd_t() {
        assert_eq!(
            ::core::mem::size_of::<pmd_t>(),
            8usize,
            concat!("Size of: ", stringify!(pmd_t))
        );
        assert_eq!(
            ::core::mem::align_of::<pmd_t>(),
            8usize,
            concat!("Alignment of ", stringify!(pmd_t))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pmd_t>())).pmd as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pmd_t),
                "::",
                stringify!(pmd)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct pgprot {
        pub pgprot: pgprotval_t,
    }
    #[test]
    fn bindgen_test_layout_pgprot() {
        assert_eq!(
            ::core::mem::size_of::<pgprot>(),
            8usize,
            concat!("Size of: ", stringify!(pgprot))
        );
        assert_eq!(
            ::core::mem::align_of::<pgprot>(),
            8usize,
            concat!("Alignment of ", stringify!(pgprot))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pgprot>())).pgprot as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pgprot),
                "::",
                stringify!(pgprot)
            )
        );
    }
    pub type pgprot_t = pgprot;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct pgd_t {
        pub pgd: pgdval_t,
    }
    #[test]
    fn bindgen_test_layout_pgd_t() {
        assert_eq!(
            ::core::mem::size_of::<pgd_t>(),
            8usize,
            concat!("Size of: ", stringify!(pgd_t))
        );
        assert_eq!(
            ::core::mem::align_of::<pgd_t>(),
            8usize,
            concat!("Alignment of ", stringify!(pgd_t))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pgd_t>())).pgd as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pgd_t),
                "::",
                stringify!(pgd)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct pud_t {
        pub pud: pudval_t,
    }
    #[test]
    fn bindgen_test_layout_pud_t() {
        assert_eq!(
            ::core::mem::size_of::<pud_t>(),
            8usize,
            concat!("Size of: ", stringify!(pud_t))
        );
        assert_eq!(
            ::core::mem::align_of::<pud_t>(),
            8usize,
            concat!("Alignment of ", stringify!(pud_t))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<pud_t>())).pud as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pud_t),
                "::",
                stringify!(pud)
            )
        );
    }
    pub type pgtable_t = *mut page;
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct static_key {
        pub enabled: atomic_t,
        pub __bindgen_anon_1: static_key__bindgen_ty_1,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union static_key__bindgen_ty_1 {
        pub type_: ::cty::c_ulong,
        pub entries: *mut jump_entry,
        pub next: *mut static_key_mod,
    }
    #[test]
    fn bindgen_test_layout_static_key__bindgen_ty_1() {
        assert_eq!(
            ::core::mem::size_of::<static_key__bindgen_ty_1>(),
            8usize,
            concat!("Size of: ", stringify!(static_key__bindgen_ty_1))
        );
        assert_eq!(
            ::core::mem::align_of::<static_key__bindgen_ty_1>(),
            8usize,
            concat!("Alignment of ", stringify!(static_key__bindgen_ty_1))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<static_key__bindgen_ty_1>())).type_ as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(static_key__bindgen_ty_1),
                "::",
                stringify!(type_)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<static_key__bindgen_ty_1>())).entries as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(static_key__bindgen_ty_1),
                "::",
                stringify!(entries)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<static_key__bindgen_ty_1>())).next as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(static_key__bindgen_ty_1),
                "::",
                stringify!(next)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_static_key() {
        assert_eq!(
            ::core::mem::size_of::<static_key>(),
            16usize,
            concat!("Size of: ", stringify!(static_key))
        );
        assert_eq!(
            ::core::mem::align_of::<static_key>(),
            8usize,
            concat!("Alignment of ", stringify!(static_key))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<static_key>())).enabled as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(static_key),
                "::",
                stringify!(enabled)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct jump_entry {
        pub code: s32,
        pub target: s32,
        pub key: ::cty::c_long,
    }
    #[test]
    fn bindgen_test_layout_jump_entry() {
        assert_eq!(
            ::core::mem::size_of::<jump_entry>(),
            16usize,
            concat!("Size of: ", stringify!(jump_entry))
        );
        assert_eq!(
            ::core::mem::align_of::<jump_entry>(),
            8usize,
            concat!("Alignment of ", stringify!(jump_entry))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<jump_entry>())).code as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(jump_entry),
                "::",
                stringify!(code)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<jump_entry>())).target as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(jump_entry),
                "::",
                stringify!(target)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<jump_entry>())).key as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(jump_entry),
                "::",
                stringify!(key)
            )
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct static_key_true {
        pub key: static_key,
    }
    #[test]
    fn bindgen_test_layout_static_key_true() {
        assert_eq!(
            ::core::mem::size_of::<static_key_true>(),
            16usize,
            concat!("Size of: ", stringify!(static_key_true))
        );
        assert_eq!(
            ::core::mem::align_of::<static_key_true>(),
            8usize,
            concat!("Alignment of ", stringify!(static_key_true))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<static_key_true>())).key as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(static_key_true),
                "::",
                stringify!(key)
            )
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct static_key_false {
        pub key: static_key,
    }
    #[test]
    fn bindgen_test_layout_static_key_false() {
        assert_eq!(
            ::core::mem::size_of::<static_key_false>(),
            16usize,
            concat!("Size of: ", stringify!(static_key_false))
        );
        assert_eq!(
            ::core::mem::align_of::<static_key_false>(),
            8usize,
            concat!("Alignment of ", stringify!(static_key_false))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<static_key_false>())).key as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(static_key_false),
                "::",
                stringify!(key)
            )
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct qspinlock {
        pub __bindgen_anon_1: qspinlock__bindgen_ty_1,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union qspinlock__bindgen_ty_1 {
        pub val: atomic_t,
        pub __bindgen_anon_1: qspinlock__bindgen_ty_1__bindgen_ty_1,
        pub __bindgen_anon_2: qspinlock__bindgen_ty_1__bindgen_ty_2,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct qspinlock__bindgen_ty_1__bindgen_ty_1 {
        pub locked: _cargo_bpf_u8,
        pub pending: _cargo_bpf_u8,
    }
    #[test]
    fn bindgen_test_layout_qspinlock__bindgen_ty_1__bindgen_ty_1() {
        assert_eq!(
            ::core::mem::size_of::<qspinlock__bindgen_ty_1__bindgen_ty_1>(),
            2usize,
            concat!(
                "Size of: ",
                stringify!(qspinlock__bindgen_ty_1__bindgen_ty_1)
            )
        );
        assert_eq!(
            ::core::mem::align_of::<qspinlock__bindgen_ty_1__bindgen_ty_1>(),
            1usize,
            concat!(
                "Alignment of ",
                stringify!(qspinlock__bindgen_ty_1__bindgen_ty_1)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<qspinlock__bindgen_ty_1__bindgen_ty_1>())).locked
                    as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(qspinlock__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(locked)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<qspinlock__bindgen_ty_1__bindgen_ty_1>())).pending
                    as *const _ as usize
            },
            1usize,
            concat!(
                "Offset of field: ",
                stringify!(qspinlock__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(pending)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct qspinlock__bindgen_ty_1__bindgen_ty_2 {
        pub locked_pending: _cargo_bpf_u16,
        pub tail: _cargo_bpf_u16,
    }
    #[test]
    fn bindgen_test_layout_qspinlock__bindgen_ty_1__bindgen_ty_2() {
        assert_eq!(
            ::core::mem::size_of::<qspinlock__bindgen_ty_1__bindgen_ty_2>(),
            4usize,
            concat!(
                "Size of: ",
                stringify!(qspinlock__bindgen_ty_1__bindgen_ty_2)
            )
        );
        assert_eq!(
            ::core::mem::align_of::<qspinlock__bindgen_ty_1__bindgen_ty_2>(),
            2usize,
            concat!(
                "Alignment of ",
                stringify!(qspinlock__bindgen_ty_1__bindgen_ty_2)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<qspinlock__bindgen_ty_1__bindgen_ty_2>())).locked_pending
                    as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(qspinlock__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(locked_pending)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<qspinlock__bindgen_ty_1__bindgen_ty_2>())).tail as *const _
                    as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(qspinlock__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(tail)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_qspinlock__bindgen_ty_1() {
        assert_eq!(
            ::core::mem::size_of::<qspinlock__bindgen_ty_1>(),
            4usize,
            concat!("Size of: ", stringify!(qspinlock__bindgen_ty_1))
        );
        assert_eq!(
            ::core::mem::align_of::<qspinlock__bindgen_ty_1>(),
            4usize,
            concat!("Alignment of ", stringify!(qspinlock__bindgen_ty_1))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<qspinlock__bindgen_ty_1>())).val as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(qspinlock__bindgen_ty_1),
                "::",
                stringify!(val)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_qspinlock() {
        assert_eq!(
            ::core::mem::size_of::<qspinlock>(),
            4usize,
            concat!("Size of: ", stringify!(qspinlock))
        );
        assert_eq!(
            ::core::mem::align_of::<qspinlock>(),
            4usize,
            concat!("Alignment of ", stringify!(qspinlock))
        );
    }
    pub type arch_spinlock_t = qspinlock;
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct qrwlock {
        pub __bindgen_anon_1: qrwlock__bindgen_ty_1,
        pub wait_lock: arch_spinlock_t,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union qrwlock__bindgen_ty_1 {
        pub cnts: atomic_t,
        pub __bindgen_anon_1: qrwlock__bindgen_ty_1__bindgen_ty_1,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct qrwlock__bindgen_ty_1__bindgen_ty_1 {
        pub wlocked: _cargo_bpf_u8,
        pub __lstate: [_cargo_bpf_u8; 3usize],
    }
    #[test]
    fn bindgen_test_layout_qrwlock__bindgen_ty_1__bindgen_ty_1() {
        assert_eq!(
            ::core::mem::size_of::<qrwlock__bindgen_ty_1__bindgen_ty_1>(),
            4usize,
            concat!("Size of: ", stringify!(qrwlock__bindgen_ty_1__bindgen_ty_1))
        );
        assert_eq!(
            ::core::mem::align_of::<qrwlock__bindgen_ty_1__bindgen_ty_1>(),
            1usize,
            concat!(
                "Alignment of ",
                stringify!(qrwlock__bindgen_ty_1__bindgen_ty_1)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<qrwlock__bindgen_ty_1__bindgen_ty_1>())).wlocked as *const _
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(qrwlock__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(wlocked)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<qrwlock__bindgen_ty_1__bindgen_ty_1>())).__lstate
                    as *const _ as usize
            },
            1usize,
            concat!(
                "Offset of field: ",
                stringify!(qrwlock__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(__lstate)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_qrwlock__bindgen_ty_1() {
        assert_eq!(
            ::core::mem::size_of::<qrwlock__bindgen_ty_1>(),
            4usize,
            concat!("Size of: ", stringify!(qrwlock__bindgen_ty_1))
        );
        assert_eq!(
            ::core::mem::align_of::<qrwlock__bindgen_ty_1>(),
            4usize,
            concat!("Alignment of ", stringify!(qrwlock__bindgen_ty_1))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<qrwlock__bindgen_ty_1>())).cnts as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(qrwlock__bindgen_ty_1),
                "::",
                stringify!(cnts)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_qrwlock() {
        assert_eq!(
            ::core::mem::size_of::<qrwlock>(),
            8usize,
            concat!("Size of: ", stringify!(qrwlock))
        );
        assert_eq!(
            ::core::mem::align_of::<qrwlock>(),
            4usize,
            concat!("Alignment of ", stringify!(qrwlock))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<qrwlock>())).wait_lock as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(qrwlock),
                "::",
                stringify!(wait_lock)
            )
        );
    }
    pub type arch_rwlock_t = qrwlock;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lock_class_key {}
    #[test]
    fn bindgen_test_layout_lock_class_key() {
        assert_eq!(
            ::core::mem::size_of::<lock_class_key>(),
            0usize,
            concat!("Size of: ", stringify!(lock_class_key))
        );
        assert_eq!(
            ::core::mem::align_of::<lock_class_key>(),
            1usize,
            concat!("Alignment of ", stringify!(lock_class_key))
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lockdep_map {}
    #[test]
    fn bindgen_test_layout_lockdep_map() {
        assert_eq!(
            ::core::mem::size_of::<lockdep_map>(),
            0usize,
            concat!("Size of: ", stringify!(lockdep_map))
        );
        assert_eq!(
            ::core::mem::align_of::<lockdep_map>(),
            1usize,
            concat!("Alignment of ", stringify!(lockdep_map))
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct raw_spinlock {
        pub raw_lock: arch_spinlock_t,
    }
    #[test]
    fn bindgen_test_layout_raw_spinlock() {
        assert_eq!(
            ::core::mem::size_of::<raw_spinlock>(),
            4usize,
            concat!("Size of: ", stringify!(raw_spinlock))
        );
        assert_eq!(
            ::core::mem::align_of::<raw_spinlock>(),
            4usize,
            concat!("Alignment of ", stringify!(raw_spinlock))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<raw_spinlock>())).raw_lock as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(raw_spinlock),
                "::",
                stringify!(raw_lock)
            )
        );
    }
    pub type raw_spinlock_t = raw_spinlock;
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct ratelimit_state {
        pub lock: raw_spinlock_t,
        pub interval: ::cty::c_int,
        pub burst: ::cty::c_int,
        pub printed: ::cty::c_int,
        pub missed: ::cty::c_int,
        pub begin: ::cty::c_ulong,
        pub flags: ::cty::c_ulong,
    }
    #[test]
    fn bindgen_test_layout_ratelimit_state() {
        assert_eq!(
            ::core::mem::size_of::<ratelimit_state>(),
            40usize,
            concat!("Size of: ", stringify!(ratelimit_state))
        );
        assert_eq!(
            ::core::mem::align_of::<ratelimit_state>(),
            8usize,
            concat!("Alignment of ", stringify!(ratelimit_state))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<ratelimit_state>())).lock as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ratelimit_state),
                "::",
                stringify!(lock)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<ratelimit_state>())).interval as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ratelimit_state),
                "::",
                stringify!(interval)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<ratelimit_state>())).burst as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ratelimit_state),
                "::",
                stringify!(burst)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<ratelimit_state>())).printed as *const _ as usize },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ratelimit_state),
                "::",
                stringify!(printed)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<ratelimit_state>())).missed as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ratelimit_state),
                "::",
                stringify!(missed)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<ratelimit_state>())).begin as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ratelimit_state),
                "::",
                stringify!(begin)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<ratelimit_state>())).flags as *const _ as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ratelimit_state),
                "::",
                stringify!(flags)
            )
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct _ddebug {
        pub modname: *const ::cty::c_char,
        pub function: *const ::cty::c_char,
        pub filename: *const ::cty::c_char,
        pub format: *const ::cty::c_char,
        pub _bitfield_align_1: [u32; 0],
        pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
        pub key: _ddebug__bindgen_ty_1,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union _ddebug__bindgen_ty_1 {
        pub dd_key_true: static_key_true,
        pub dd_key_false: static_key_false,
    }
    #[test]
    fn bindgen_test_layout__ddebug__bindgen_ty_1() {
        assert_eq!(
            ::core::mem::size_of::<_ddebug__bindgen_ty_1>(),
            16usize,
            concat!("Size of: ", stringify!(_ddebug__bindgen_ty_1))
        );
        assert_eq!(
            ::core::mem::align_of::<_ddebug__bindgen_ty_1>(),
            8usize,
            concat!("Alignment of ", stringify!(_ddebug__bindgen_ty_1))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<_ddebug__bindgen_ty_1>())).dd_key_true as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_ddebug__bindgen_ty_1),
                "::",
                stringify!(dd_key_true)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<_ddebug__bindgen_ty_1>())).dd_key_false as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_ddebug__bindgen_ty_1),
                "::",
                stringify!(dd_key_false)
            )
        );
    }
    #[test]
    fn bindgen_test_layout__ddebug() {
        assert_eq!(
            ::core::mem::size_of::<_ddebug>(),
            56usize,
            concat!("Size of: ", stringify!(_ddebug))
        );
        assert_eq!(
            ::core::mem::align_of::<_ddebug>(),
            8usize,
            concat!("Alignment of ", stringify!(_ddebug))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_ddebug>())).modname as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_ddebug),
                "::",
                stringify!(modname)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_ddebug>())).function as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_ddebug),
                "::",
                stringify!(function)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_ddebug>())).filename as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(_ddebug),
                "::",
                stringify!(filename)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_ddebug>())).format as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(_ddebug),
                "::",
                stringify!(format)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_ddebug>())).key as *const _ as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(_ddebug),
                "::",
                stringify!(key)
            )
        );
    }
    impl _ddebug {
        #[inline]
        pub fn lineno(&self) -> ::cty::c_uint {
            unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 18u8) as u32) }
        }
        #[inline]
        pub fn set_lineno(&mut self, val: ::cty::c_uint) {
            unsafe {
                let val: u32 = ::core::mem::transmute(val);
                self._bitfield_1.set(0usize, 18u8, val as u64)
            }
        }
        #[inline]
        pub fn class_id(&self) -> ::cty::c_uint {
            unsafe { ::core::mem::transmute(self._bitfield_1.get(18usize, 6u8) as u32) }
        }
        #[inline]
        pub fn set_class_id(&mut self, val: ::cty::c_uint) {
            unsafe {
                let val: u32 = ::core::mem::transmute(val);
                self._bitfield_1.set(18usize, 6u8, val as u64)
            }
        }
        #[inline]
        pub fn flags(&self) -> ::cty::c_uint {
            unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
        }
        #[inline]
        pub fn set_flags(&mut self, val: ::cty::c_uint) {
            unsafe {
                let val: u32 = ::core::mem::transmute(val);
                self._bitfield_1.set(24usize, 8u8, val as u64)
            }
        }
        #[inline]
        pub fn new_bitfield_1(
            lineno: ::cty::c_uint,
            class_id: ::cty::c_uint,
            flags: ::cty::c_uint,
        ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
            let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> =
                Default::default();
            __bindgen_bitfield_unit.set(0usize, 18u8, {
                let lineno: u32 = unsafe { ::core::mem::transmute(lineno) };
                lineno as u64
            });
            __bindgen_bitfield_unit.set(18usize, 6u8, {
                let class_id: u32 = unsafe { ::core::mem::transmute(class_id) };
                class_id as u64
            });
            __bindgen_bitfield_unit.set(24usize, 8u8, {
                let flags: u32 = unsafe { ::core::mem::transmute(flags) };
                flags as u64
            });
            __bindgen_bitfield_unit
        }
    }
    pub const class_map_type_DD_CLASS_TYPE_DISJOINT_BITS: class_map_type = 0;
    #[doc = " DD_CLASS_TYPE_DISJOINT_BITS: classes are independent, one per bit."]
    #[doc = " expecting hex input. Built for drm.debug, basis for other types."]
    pub const class_map_type_DD_CLASS_TYPE_LEVEL_NUM: class_map_type = 1;
    #[doc = " DD_CLASS_TYPE_LEVEL_NUM: input is numeric level, 0-N."]
    #[doc = " N turns on just bits N-1 .. 0, so N=0 turns all bits off."]
    pub const class_map_type_DD_CLASS_TYPE_DISJOINT_NAMES: class_map_type = 2;
    #[doc = " DD_CLASS_TYPE_DISJOINT_NAMES: input is a CSV of [+-]CLASS_NAMES,"]
    #[doc = " classes are independent, like _DISJOINT_BITS."]
    pub const class_map_type_DD_CLASS_TYPE_LEVEL_NAMES: class_map_type = 3;
    pub type class_map_type = ::cty::c_uint;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct ddebug_class_map {
        pub link: list_head,
        pub mod_: *mut module,
        pub mod_name: *const ::cty::c_char,
        pub class_names: *mut *const ::cty::c_char,
        pub length: ::cty::c_int,
        pub base: ::cty::c_int,
        pub map_type: class_map_type,
    }
    #[test]
    fn bindgen_test_layout_ddebug_class_map() {
        assert_eq!(
            ::core::mem::size_of::<ddebug_class_map>(),
            56usize,
            concat!("Size of: ", stringify!(ddebug_class_map))
        );
        assert_eq!(
            ::core::mem::align_of::<ddebug_class_map>(),
            8usize,
            concat!("Alignment of ", stringify!(ddebug_class_map))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<ddebug_class_map>())).link as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ddebug_class_map),
                "::",
                stringify!(link)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<ddebug_class_map>())).mod_ as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ddebug_class_map),
                "::",
                stringify!(mod_)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<ddebug_class_map>())).mod_name as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ddebug_class_map),
                "::",
                stringify!(mod_name)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<ddebug_class_map>())).class_names as *const _ as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ddebug_class_map),
                "::",
                stringify!(class_names)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<ddebug_class_map>())).length as *const _ as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(ddebug_class_map),
                "::",
                stringify!(length)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<ddebug_class_map>())).base as *const _ as usize },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(ddebug_class_map),
                "::",
                stringify!(base)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<ddebug_class_map>())).map_type as *const _ as usize },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(ddebug_class_map),
                "::",
                stringify!(map_type)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _ddebug_info {
        pub descs: *mut _ddebug,
        pub classes: *mut ddebug_class_map,
        pub num_descs: ::cty::c_uint,
        pub num_classes: ::cty::c_uint,
    }
    #[test]
    fn bindgen_test_layout__ddebug_info() {
        assert_eq!(
            ::core::mem::size_of::<_ddebug_info>(),
            24usize,
            concat!("Size of: ", stringify!(_ddebug_info))
        );
        assert_eq!(
            ::core::mem::align_of::<_ddebug_info>(),
            8usize,
            concat!("Alignment of ", stringify!(_ddebug_info))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_ddebug_info>())).descs as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_ddebug_info),
                "::",
                stringify!(descs)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_ddebug_info>())).classes as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_ddebug_info),
                "::",
                stringify!(classes)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_ddebug_info>())).num_descs as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(_ddebug_info),
                "::",
                stringify!(num_descs)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_ddebug_info>())).num_classes as *const _ as usize },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(_ddebug_info),
                "::",
                stringify!(num_classes)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct kernel_param_ops {
        pub flags: ::cty::c_uint,
        pub set: ::core::option::Option<
            unsafe extern "C" fn(
                val: *const ::cty::c_char,
                kp: *const kernel_param,
            ) -> ::cty::c_int,
        >,
        pub get: ::core::option::Option<
            unsafe extern "C" fn(
                buffer: *mut ::cty::c_char,
                kp: *const kernel_param,
            ) -> ::cty::c_int,
        >,
        pub free: ::core::option::Option<unsafe extern "C" fn(arg: *mut ::cty::c_void)>,
    }
    #[test]
    fn bindgen_test_layout_kernel_param_ops() {
        assert_eq!(
            ::core::mem::size_of::<kernel_param_ops>(),
            32usize,
            concat!("Size of: ", stringify!(kernel_param_ops))
        );
        assert_eq!(
            ::core::mem::align_of::<kernel_param_ops>(),
            8usize,
            concat!("Alignment of ", stringify!(kernel_param_ops))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<kernel_param_ops>())).flags as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(kernel_param_ops),
                "::",
                stringify!(flags)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<kernel_param_ops>())).set as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(kernel_param_ops),
                "::",
                stringify!(set)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<kernel_param_ops>())).get as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(kernel_param_ops),
                "::",
                stringify!(get)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<kernel_param_ops>())).free as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(kernel_param_ops),
                "::",
                stringify!(free)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct file_operations {
        pub owner: *mut module,
        pub llseek: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut file, arg2: loff_t, arg3: ::cty::c_int) -> loff_t,
        >,
        pub read: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut file,
                arg2: *mut ::cty::c_char,
                arg3: size_t,
                arg4: *mut loff_t,
            ) -> ssize_t,
        >,
        pub write: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut file,
                arg2: *const ::cty::c_char,
                arg3: size_t,
                arg4: *mut loff_t,
            ) -> ssize_t,
        >,
        pub read_iter: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut kiocb, arg2: *mut iov_iter) -> ssize_t,
        >,
        pub write_iter: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut kiocb, arg2: *mut iov_iter) -> ssize_t,
        >,
        pub iopoll: ::core::option::Option<
            unsafe extern "C" fn(
                kiocb: *mut kiocb,
                arg1: *mut io_comp_batch,
                flags: ::cty::c_uint,
            ) -> ::cty::c_int,
        >,
        pub iterate_shared: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut file, arg2: *mut dir_context) -> ::cty::c_int,
        >,
        pub poll: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut file, arg2: *mut poll_table_struct) -> __poll_t,
        >,
        pub unlocked_ioctl: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut file,
                arg2: ::cty::c_uint,
                arg3: ::cty::c_ulong,
            ) -> ::cty::c_long,
        >,
        pub compat_ioctl: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut file,
                arg2: ::cty::c_uint,
                arg3: ::cty::c_ulong,
            ) -> ::cty::c_long,
        >,
        pub mmap: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut file, arg2: *mut vm_area_struct) -> ::cty::c_int,
        >,
        pub mmap_supported_flags: ::cty::c_ulong,
        pub open: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut inode, arg2: *mut file) -> ::cty::c_int,
        >,
        pub flush: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut file, id: fl_owner_t) -> ::cty::c_int,
        >,
        pub release: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut inode, arg2: *mut file) -> ::cty::c_int,
        >,
        pub fsync: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut file,
                arg2: loff_t,
                arg3: loff_t,
                datasync: ::cty::c_int,
            ) -> ::cty::c_int,
        >,
        pub fasync: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: ::cty::c_int,
                arg2: *mut file,
                arg3: ::cty::c_int,
            ) -> ::cty::c_int,
        >,
        pub lock: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut file,
                arg2: ::cty::c_int,
                arg3: *mut file_lock,
            ) -> ::cty::c_int,
        >,
        pub get_unmapped_area: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut file,
                arg2: ::cty::c_ulong,
                arg3: ::cty::c_ulong,
                arg4: ::cty::c_ulong,
                arg5: ::cty::c_ulong,
            ) -> ::cty::c_ulong,
        >,
        pub check_flags:
            ::core::option::Option<unsafe extern "C" fn(arg1: ::cty::c_int) -> ::cty::c_int>,
        pub flock: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut file,
                arg2: ::cty::c_int,
                arg3: *mut file_lock,
            ) -> ::cty::c_int,
        >,
        pub splice_write: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut pipe_inode_info,
                arg2: *mut file,
                arg3: *mut loff_t,
                arg4: size_t,
                arg5: ::cty::c_uint,
            ) -> ssize_t,
        >,
        pub splice_read: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut file,
                arg2: *mut loff_t,
                arg3: *mut pipe_inode_info,
                arg4: size_t,
                arg5: ::cty::c_uint,
            ) -> ssize_t,
        >,
        pub splice_eof: ::core::option::Option<unsafe extern "C" fn(file: *mut file)>,
        pub setlease: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut file,
                arg2: ::cty::c_long,
                arg3: *mut *mut file_lock,
                arg4: *mut *mut ::cty::c_void,
            ) -> ::cty::c_int,
        >,
        pub fallocate: ::core::option::Option<
            unsafe extern "C" fn(
                file: *mut file,
                mode: ::cty::c_int,
                offset: loff_t,
                len: loff_t,
            ) -> ::cty::c_long,
        >,
        pub show_fdinfo:
            ::core::option::Option<unsafe extern "C" fn(m: *mut seq_file, f: *mut file)>,
        pub copy_file_range: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut file,
                arg2: loff_t,
                arg3: *mut file,
                arg4: loff_t,
                arg5: size_t,
                arg6: ::cty::c_uint,
            ) -> ssize_t,
        >,
        pub remap_file_range: ::core::option::Option<
            unsafe extern "C" fn(
                file_in: *mut file,
                pos_in: loff_t,
                file_out: *mut file,
                pos_out: loff_t,
                len: loff_t,
                remap_flags: ::cty::c_uint,
            ) -> loff_t,
        >,
        pub fadvise: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut file,
                arg2: loff_t,
                arg3: loff_t,
                arg4: ::cty::c_int,
            ) -> ::cty::c_int,
        >,
        pub uring_cmd: ::core::option::Option<
            unsafe extern "C" fn(
                ioucmd: *mut io_uring_cmd,
                issue_flags: ::cty::c_uint,
            ) -> ::cty::c_int,
        >,
        pub uring_cmd_iopoll: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut io_uring_cmd,
                arg2: *mut io_comp_batch,
                poll_flags: ::cty::c_uint,
            ) -> ::cty::c_int,
        >,
    }
    #[test]
    fn bindgen_test_layout_file_operations() {
        assert_eq!(
            ::core::mem::size_of::<file_operations>(),
            264usize,
            concat!("Size of: ", stringify!(file_operations))
        );
        assert_eq!(
            ::core::mem::align_of::<file_operations>(),
            8usize,
            concat!("Alignment of ", stringify!(file_operations))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_operations>())).owner as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(owner)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_operations>())).llseek as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(llseek)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_operations>())).read as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(read)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_operations>())).write as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(write)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_operations>())).read_iter as *const _ as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(read_iter)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_operations>())).write_iter as *const _ as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(write_iter)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_operations>())).iopoll as *const _ as usize },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(iopoll)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<file_operations>())).iterate_shared as *const _ as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(iterate_shared)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_operations>())).poll as *const _ as usize },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(poll)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<file_operations>())).unlocked_ioctl as *const _ as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(unlocked_ioctl)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<file_operations>())).compat_ioctl as *const _ as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(compat_ioctl)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_operations>())).mmap as *const _ as usize },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(mmap)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<file_operations>())).mmap_supported_flags as *const _
                    as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(mmap_supported_flags)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_operations>())).open as *const _ as usize },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(open)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_operations>())).flush as *const _ as usize },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(flush)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_operations>())).release as *const _ as usize },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(release)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_operations>())).fsync as *const _ as usize },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(fsync)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_operations>())).fasync as *const _ as usize },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(fasync)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_operations>())).lock as *const _ as usize },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(lock)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<file_operations>())).get_unmapped_area as *const _ as usize
            },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(get_unmapped_area)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<file_operations>())).check_flags as *const _ as usize
            },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(check_flags)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_operations>())).flock as *const _ as usize },
            168usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(flock)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<file_operations>())).splice_write as *const _ as usize
            },
            176usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(splice_write)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<file_operations>())).splice_read as *const _ as usize
            },
            184usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(splice_read)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_operations>())).splice_eof as *const _ as usize },
            192usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(splice_eof)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_operations>())).setlease as *const _ as usize },
            200usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(setlease)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_operations>())).fallocate as *const _ as usize },
            208usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(fallocate)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<file_operations>())).show_fdinfo as *const _ as usize
            },
            216usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(show_fdinfo)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<file_operations>())).copy_file_range as *const _ as usize
            },
            224usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(copy_file_range)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<file_operations>())).remap_file_range as *const _ as usize
            },
            232usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(remap_file_range)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_operations>())).fadvise as *const _ as usize },
            240usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(fadvise)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<file_operations>())).uring_cmd as *const _ as usize },
            248usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(uring_cmd)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<file_operations>())).uring_cmd_iopoll as *const _ as usize
            },
            256usize,
            concat!(
                "Offset of field: ",
                stringify!(file_operations),
                "::",
                stringify!(uring_cmd_iopoll)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct static_call_site {
        pub addr: s32,
        pub key: s32,
    }
    #[test]
    fn bindgen_test_layout_static_call_site() {
        assert_eq!(
            ::core::mem::size_of::<static_call_site>(),
            8usize,
            concat!("Size of: ", stringify!(static_call_site))
        );
        assert_eq!(
            ::core::mem::align_of::<static_call_site>(),
            4usize,
            concat!("Alignment of ", stringify!(static_call_site))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<static_call_site>())).addr as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(static_call_site),
                "::",
                stringify!(addr)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<static_call_site>())).key as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(static_call_site),
                "::",
                stringify!(key)
            )
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct static_call_key {
        pub func: *mut ::cty::c_void,
        pub __bindgen_anon_1: static_call_key__bindgen_ty_1,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union static_call_key__bindgen_ty_1 {
        pub type_: ::cty::c_ulong,
        pub mods: *mut static_call_mod,
        pub sites: *mut static_call_site,
    }
    #[test]
    fn bindgen_test_layout_static_call_key__bindgen_ty_1() {
        assert_eq!(
            ::core::mem::size_of::<static_call_key__bindgen_ty_1>(),
            8usize,
            concat!("Size of: ", stringify!(static_call_key__bindgen_ty_1))
        );
        assert_eq!(
            ::core::mem::align_of::<static_call_key__bindgen_ty_1>(),
            8usize,
            concat!("Alignment of ", stringify!(static_call_key__bindgen_ty_1))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<static_call_key__bindgen_ty_1>())).type_ as *const _
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(static_call_key__bindgen_ty_1),
                "::",
                stringify!(type_)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<static_call_key__bindgen_ty_1>())).mods as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(static_call_key__bindgen_ty_1),
                "::",
                stringify!(mods)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<static_call_key__bindgen_ty_1>())).sites as *const _
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(static_call_key__bindgen_ty_1),
                "::",
                stringify!(sites)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_static_call_key() {
        assert_eq!(
            ::core::mem::size_of::<static_call_key>(),
            16usize,
            concat!("Size of: ", stringify!(static_call_key))
        );
        assert_eq!(
            ::core::mem::align_of::<static_call_key>(),
            8usize,
            concat!("Alignment of ", stringify!(static_call_key))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<static_call_key>())).func as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(static_call_key),
                "::",
                stringify!(func)
            )
        );
    }
    #[repr(C)]
    #[repr(align(64))]
    #[derive(Debug)]
    pub struct cacheline_padding {
        pub x: __IncompleteArrayField<::cty::c_char>,
    }
    #[test]
    fn bindgen_test_layout_cacheline_padding() {
        assert_eq!(
            ::core::mem::size_of::<cacheline_padding>(),
            0usize,
            concat!("Size of: ", stringify!(cacheline_padding))
        );
        assert_eq!(
            ::core::mem::align_of::<cacheline_padding>(),
            64usize,
            concat!("Alignment of ", stringify!(cacheline_padding))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<cacheline_padding>())).x as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(cacheline_padding),
                "::",
                stringify!(x)
            )
        );
    }
    pub const BPF_REG_0: ::cty::c_uint = 0;
    pub const BPF_REG_1: ::cty::c_uint = 1;
    pub const BPF_REG_2: ::cty::c_uint = 2;
    pub const BPF_REG_3: ::cty::c_uint = 3;
    pub const BPF_REG_4: ::cty::c_uint = 4;
    pub const BPF_REG_5: ::cty::c_uint = 5;
    pub const BPF_REG_6: ::cty::c_uint = 6;
    pub const BPF_REG_7: ::cty::c_uint = 7;
    pub const BPF_REG_8: ::cty::c_uint = 8;
    pub const BPF_REG_9: ::cty::c_uint = 9;
    pub const BPF_REG_10: ::cty::c_uint = 10;
    pub const __MAX_BPF_REG: ::cty::c_uint = 11;
    pub type _bindgen_ty_5 = ::cty::c_uint;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_insn {
        pub code: __u8,
        pub _bitfield_align_1: [u8; 0],
        pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
        pub off: __s16,
        pub imm: __s32,
    }
    #[test]
    fn bindgen_test_layout_bpf_insn() {
        assert_eq!(
            ::core::mem::size_of::<bpf_insn>(),
            8usize,
            concat!("Size of: ", stringify!(bpf_insn))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_insn>(),
            4usize,
            concat!("Alignment of ", stringify!(bpf_insn))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_insn>())).code as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_insn),
                "::",
                stringify!(code)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_insn>())).off as *const _ as usize },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_insn),
                "::",
                stringify!(off)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_insn>())).imm as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_insn),
                "::",
                stringify!(imm)
            )
        );
    }
    impl bpf_insn {
        #[inline]
        pub fn dst_reg(&self) -> __u8 {
            unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
        }
        #[inline]
        pub fn set_dst_reg(&mut self, val: __u8) {
            unsafe {
                let val: u8 = ::core::mem::transmute(val);
                self._bitfield_1.set(0usize, 4u8, val as u64)
            }
        }
        #[inline]
        pub fn src_reg(&self) -> __u8 {
            unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u8) }
        }
        #[inline]
        pub fn set_src_reg(&mut self, val: __u8) {
            unsafe {
                let val: u8 = ::core::mem::transmute(val);
                self._bitfield_1.set(4usize, 4u8, val as u64)
            }
        }
        #[inline]
        pub fn new_bitfield_1(dst_reg: __u8, src_reg: __u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
            let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> =
                Default::default();
            __bindgen_bitfield_unit.set(0usize, 4u8, {
                let dst_reg: u8 = unsafe { ::core::mem::transmute(dst_reg) };
                dst_reg as u64
            });
            __bindgen_bitfield_unit.set(4usize, 4u8, {
                let src_reg: u8 = unsafe { ::core::mem::transmute(src_reg) };
                src_reg as u64
            });
            __bindgen_bitfield_unit
        }
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct bpf_lpm_trie_key {
        pub prefixlen: __u32,
        pub data: __IncompleteArrayField<__u8>,
    }
    #[test]
    fn bindgen_test_layout_bpf_lpm_trie_key() {
        assert_eq!(
            ::core::mem::size_of::<bpf_lpm_trie_key>(),
            4usize,
            concat!("Size of: ", stringify!(bpf_lpm_trie_key))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_lpm_trie_key>(),
            4usize,
            concat!("Alignment of ", stringify!(bpf_lpm_trie_key))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_lpm_trie_key>())).prefixlen as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_lpm_trie_key),
                "::",
                stringify!(prefixlen)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_lpm_trie_key>())).data as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_lpm_trie_key),
                "::",
                stringify!(data)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_cgroup_storage_key {
        pub cgroup_inode_id: __u64,
        pub attach_type: __u32,
    }
    #[test]
    fn bindgen_test_layout_bpf_cgroup_storage_key() {
        assert_eq!(
            ::core::mem::size_of::<bpf_cgroup_storage_key>(),
            16usize,
            concat!("Size of: ", stringify!(bpf_cgroup_storage_key))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_cgroup_storage_key>(),
            8usize,
            concat!("Alignment of ", stringify!(bpf_cgroup_storage_key))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_cgroup_storage_key>())).cgroup_inode_id as *const _
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_cgroup_storage_key),
                "::",
                stringify!(cgroup_inode_id)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_cgroup_storage_key>())).attach_type as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_cgroup_storage_key),
                "::",
                stringify!(attach_type)
            )
        );
    }
    pub const bpf_cgroup_iter_order_BPF_CGROUP_ITER_ORDER_UNSPEC: bpf_cgroup_iter_order = 0;
    pub const bpf_cgroup_iter_order_BPF_CGROUP_ITER_SELF_ONLY: bpf_cgroup_iter_order = 1;
    pub const bpf_cgroup_iter_order_BPF_CGROUP_ITER_DESCENDANTS_PRE: bpf_cgroup_iter_order = 2;
    pub const bpf_cgroup_iter_order_BPF_CGROUP_ITER_DESCENDANTS_POST: bpf_cgroup_iter_order = 3;
    pub const bpf_cgroup_iter_order_BPF_CGROUP_ITER_ANCESTORS_UP: bpf_cgroup_iter_order = 4;
    pub type bpf_cgroup_iter_order = ::cty::c_uint;
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union bpf_iter_link_info {
        pub map: bpf_iter_link_info__bindgen_ty_1,
        pub cgroup: bpf_iter_link_info__bindgen_ty_2,
        pub task: bpf_iter_link_info__bindgen_ty_3,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_iter_link_info__bindgen_ty_1 {
        pub map_fd: __u32,
    }
    #[test]
    fn bindgen_test_layout_bpf_iter_link_info__bindgen_ty_1() {
        assert_eq!(
            ::core::mem::size_of::<bpf_iter_link_info__bindgen_ty_1>(),
            4usize,
            concat!("Size of: ", stringify!(bpf_iter_link_info__bindgen_ty_1))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_iter_link_info__bindgen_ty_1>(),
            4usize,
            concat!(
                "Alignment of ",
                stringify!(bpf_iter_link_info__bindgen_ty_1)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_iter_link_info__bindgen_ty_1>())).map_fd as *const _
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_iter_link_info__bindgen_ty_1),
                "::",
                stringify!(map_fd)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_iter_link_info__bindgen_ty_2 {
        pub order: bpf_cgroup_iter_order,
        pub cgroup_fd: __u32,
        pub cgroup_id: __u64,
    }
    #[test]
    fn bindgen_test_layout_bpf_iter_link_info__bindgen_ty_2() {
        assert_eq!(
            ::core::mem::size_of::<bpf_iter_link_info__bindgen_ty_2>(),
            16usize,
            concat!("Size of: ", stringify!(bpf_iter_link_info__bindgen_ty_2))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_iter_link_info__bindgen_ty_2>(),
            8usize,
            concat!(
                "Alignment of ",
                stringify!(bpf_iter_link_info__bindgen_ty_2)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_iter_link_info__bindgen_ty_2>())).order as *const _
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_iter_link_info__bindgen_ty_2),
                "::",
                stringify!(order)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_iter_link_info__bindgen_ty_2>())).cgroup_fd as *const _
                    as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_iter_link_info__bindgen_ty_2),
                "::",
                stringify!(cgroup_fd)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_iter_link_info__bindgen_ty_2>())).cgroup_id as *const _
                    as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_iter_link_info__bindgen_ty_2),
                "::",
                stringify!(cgroup_id)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_iter_link_info__bindgen_ty_3 {
        pub tid: __u32,
        pub pid: __u32,
        pub pid_fd: __u32,
    }
    #[test]
    fn bindgen_test_layout_bpf_iter_link_info__bindgen_ty_3() {
        assert_eq!(
            ::core::mem::size_of::<bpf_iter_link_info__bindgen_ty_3>(),
            12usize,
            concat!("Size of: ", stringify!(bpf_iter_link_info__bindgen_ty_3))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_iter_link_info__bindgen_ty_3>(),
            4usize,
            concat!(
                "Alignment of ",
                stringify!(bpf_iter_link_info__bindgen_ty_3)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_iter_link_info__bindgen_ty_3>())).tid as *const _
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_iter_link_info__bindgen_ty_3),
                "::",
                stringify!(tid)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_iter_link_info__bindgen_ty_3>())).pid as *const _
                    as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_iter_link_info__bindgen_ty_3),
                "::",
                stringify!(pid)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_iter_link_info__bindgen_ty_3>())).pid_fd as *const _
                    as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_iter_link_info__bindgen_ty_3),
                "::",
                stringify!(pid_fd)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_bpf_iter_link_info() {
        assert_eq!(
            ::core::mem::size_of::<bpf_iter_link_info>(),
            16usize,
            concat!("Size of: ", stringify!(bpf_iter_link_info))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_iter_link_info>(),
            8usize,
            concat!("Alignment of ", stringify!(bpf_iter_link_info))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_iter_link_info>())).map as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_iter_link_info),
                "::",
                stringify!(map)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_iter_link_info>())).cgroup as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_iter_link_info),
                "::",
                stringify!(cgroup)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_iter_link_info>())).task as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_iter_link_info),
                "::",
                stringify!(task)
            )
        );
    }
    pub const bpf_cmd_BPF_MAP_CREATE: bpf_cmd = 0;
    pub const bpf_cmd_BPF_MAP_LOOKUP_ELEM: bpf_cmd = 1;
    pub const bpf_cmd_BPF_MAP_UPDATE_ELEM: bpf_cmd = 2;
    pub const bpf_cmd_BPF_MAP_DELETE_ELEM: bpf_cmd = 3;
    pub const bpf_cmd_BPF_MAP_GET_NEXT_KEY: bpf_cmd = 4;
    pub const bpf_cmd_BPF_PROG_LOAD: bpf_cmd = 5;
    pub const bpf_cmd_BPF_OBJ_PIN: bpf_cmd = 6;
    pub const bpf_cmd_BPF_OBJ_GET: bpf_cmd = 7;
    pub const bpf_cmd_BPF_PROG_ATTACH: bpf_cmd = 8;
    pub const bpf_cmd_BPF_PROG_DETACH: bpf_cmd = 9;
    pub const bpf_cmd_BPF_PROG_TEST_RUN: bpf_cmd = 10;
    pub const bpf_cmd_BPF_PROG_RUN: bpf_cmd = 10;
    pub const bpf_cmd_BPF_PROG_GET_NEXT_ID: bpf_cmd = 11;
    pub const bpf_cmd_BPF_MAP_GET_NEXT_ID: bpf_cmd = 12;
    pub const bpf_cmd_BPF_PROG_GET_FD_BY_ID: bpf_cmd = 13;
    pub const bpf_cmd_BPF_MAP_GET_FD_BY_ID: bpf_cmd = 14;
    pub const bpf_cmd_BPF_OBJ_GET_INFO_BY_FD: bpf_cmd = 15;
    pub const bpf_cmd_BPF_PROG_QUERY: bpf_cmd = 16;
    pub const bpf_cmd_BPF_RAW_TRACEPOINT_OPEN: bpf_cmd = 17;
    pub const bpf_cmd_BPF_BTF_LOAD: bpf_cmd = 18;
    pub const bpf_cmd_BPF_BTF_GET_FD_BY_ID: bpf_cmd = 19;
    pub const bpf_cmd_BPF_TASK_FD_QUERY: bpf_cmd = 20;
    pub const bpf_cmd_BPF_MAP_LOOKUP_AND_DELETE_ELEM: bpf_cmd = 21;
    pub const bpf_cmd_BPF_MAP_FREEZE: bpf_cmd = 22;
    pub const bpf_cmd_BPF_BTF_GET_NEXT_ID: bpf_cmd = 23;
    pub const bpf_cmd_BPF_MAP_LOOKUP_BATCH: bpf_cmd = 24;
    pub const bpf_cmd_BPF_MAP_LOOKUP_AND_DELETE_BATCH: bpf_cmd = 25;
    pub const bpf_cmd_BPF_MAP_UPDATE_BATCH: bpf_cmd = 26;
    pub const bpf_cmd_BPF_MAP_DELETE_BATCH: bpf_cmd = 27;
    pub const bpf_cmd_BPF_LINK_CREATE: bpf_cmd = 28;
    pub const bpf_cmd_BPF_LINK_UPDATE: bpf_cmd = 29;
    pub const bpf_cmd_BPF_LINK_GET_FD_BY_ID: bpf_cmd = 30;
    pub const bpf_cmd_BPF_LINK_GET_NEXT_ID: bpf_cmd = 31;
    pub const bpf_cmd_BPF_ENABLE_STATS: bpf_cmd = 32;
    pub const bpf_cmd_BPF_ITER_CREATE: bpf_cmd = 33;
    pub const bpf_cmd_BPF_LINK_DETACH: bpf_cmd = 34;
    pub const bpf_cmd_BPF_PROG_BIND_MAP: bpf_cmd = 35;
    #[doc = " DOC: eBPF Syscall Preamble"]
    #[doc = ""]
    #[doc = " The operation to be performed by the **bpf**\\ () system call is determined"]
    #[doc = " by the *cmd* argument. Each operation takes an accompanying argument,"]
    #[doc = " provided via *attr*, which is a pointer to a union of type *bpf_attr* (see"]
    #[doc = " below). The size argument is the size of the union pointed to by *attr*."]
    #[doc = " DOC: eBPF Syscall Commands"]
    #[doc = ""]
    #[doc = " BPF_MAP_CREATE"]
    #[doc = "\tDescription"]
    #[doc = "\t\tCreate a map and return a file descriptor that refers to the"]
    #[doc = "\t\tmap. The close-on-exec file descriptor flag (see **fcntl**\\ (2))"]
    #[doc = "\t\tis automatically enabled for the new file descriptor."]
    #[doc = ""]
    #[doc = "\t\tApplying **close**\\ (2) to the file descriptor returned by"]
    #[doc = "\t\t**BPF_MAP_CREATE** will delete the map (but see NOTES)."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tA new file descriptor (a nonnegative integer), or -1 if an"]
    #[doc = "\t\terror occurred (in which case, *errno* is set appropriately)."]
    #[doc = ""]
    #[doc = " BPF_MAP_LOOKUP_ELEM"]
    #[doc = "\tDescription"]
    #[doc = "\t\tLook up an element with a given *key* in the map referred to"]
    #[doc = "\t\tby the file descriptor *map_fd*."]
    #[doc = ""]
    #[doc = "\t\tThe *flags* argument may be specified as one of the"]
    #[doc = "\t\tfollowing:"]
    #[doc = ""]
    #[doc = "\t\t**BPF_F_LOCK**"]
    #[doc = "\t\t\tLook up the value of a spin-locked map without"]
    #[doc = "\t\t\treturning the lock. This must be specified if the"]
    #[doc = "\t\t\telements contain a spinlock."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tReturns zero on success. On error, -1 is returned and *errno*"]
    #[doc = "\t\tis set appropriately."]
    #[doc = ""]
    #[doc = " BPF_MAP_UPDATE_ELEM"]
    #[doc = "\tDescription"]
    #[doc = "\t\tCreate or update an element (key/value pair) in a specified map."]
    #[doc = ""]
    #[doc = "\t\tThe *flags* argument should be specified as one of the"]
    #[doc = "\t\tfollowing:"]
    #[doc = ""]
    #[doc = "\t\t**BPF_ANY**"]
    #[doc = "\t\t\tCreate a new element or update an existing element."]
    #[doc = "\t\t**BPF_NOEXIST**"]
    #[doc = "\t\t\tCreate a new element only if it did not exist."]
    #[doc = "\t\t**BPF_EXIST**"]
    #[doc = "\t\t\tUpdate an existing element."]
    #[doc = "\t\t**BPF_F_LOCK**"]
    #[doc = "\t\t\tUpdate a spin_lock-ed map element."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tReturns zero on success. On error, -1 is returned and *errno*"]
    #[doc = "\t\tis set appropriately."]
    #[doc = ""]
    #[doc = "\t\tMay set *errno* to **EINVAL**, **EPERM**, **ENOMEM**,"]
    #[doc = "\t\t**E2BIG**, **EEXIST**, or **ENOENT**."]
    #[doc = ""]
    #[doc = "\t\t**E2BIG**"]
    #[doc = "\t\t\tThe number of elements in the map reached the"]
    #[doc = "\t\t\t*max_entries* limit specified at map creation time."]
    #[doc = "\t\t**EEXIST**"]
    #[doc = "\t\t\tIf *flags* specifies **BPF_NOEXIST** and the element"]
    #[doc = "\t\t\twith *key* already exists in the map."]
    #[doc = "\t\t**ENOENT**"]
    #[doc = "\t\t\tIf *flags* specifies **BPF_EXIST** and the element with"]
    #[doc = "\t\t\t*key* does not exist in the map."]
    #[doc = ""]
    #[doc = " BPF_MAP_DELETE_ELEM"]
    #[doc = "\tDescription"]
    #[doc = "\t\tLook up and delete an element by key in a specified map."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tReturns zero on success. On error, -1 is returned and *errno*"]
    #[doc = "\t\tis set appropriately."]
    #[doc = ""]
    #[doc = " BPF_MAP_GET_NEXT_KEY"]
    #[doc = "\tDescription"]
    #[doc = "\t\tLook up an element by key in a specified map and return the key"]
    #[doc = "\t\tof the next element. Can be used to iterate over all elements"]
    #[doc = "\t\tin the map."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tReturns zero on success. On error, -1 is returned and *errno*"]
    #[doc = "\t\tis set appropriately."]
    #[doc = ""]
    #[doc = "\t\tThe following cases can be used to iterate over all elements of"]
    #[doc = "\t\tthe map:"]
    #[doc = ""]
    #[doc = "\t\t* If *key* is not found, the operation returns zero and sets"]
    #[doc = "\t\t  the *next_key* pointer to the key of the first element."]
    #[doc = "\t\t* If *key* is found, the operation returns zero and sets the"]
    #[doc = "\t\t  *next_key* pointer to the key of the next element."]
    #[doc = "\t\t* If *key* is the last element, returns -1 and *errno* is set"]
    #[doc = "\t\t  to **ENOENT**."]
    #[doc = ""]
    #[doc = "\t\tMay set *errno* to **ENOMEM**, **EFAULT**, **EPERM**, or"]
    #[doc = "\t\t**EINVAL** on error."]
    #[doc = ""]
    #[doc = " BPF_PROG_LOAD"]
    #[doc = "\tDescription"]
    #[doc = "\t\tVerify and load an eBPF program, returning a new file"]
    #[doc = "\t\tdescriptor associated with the program."]
    #[doc = ""]
    #[doc = "\t\tApplying **close**\\ (2) to the file descriptor returned by"]
    #[doc = "\t\t**BPF_PROG_LOAD** will unload the eBPF program (but see NOTES)."]
    #[doc = ""]
    #[doc = "\t\tThe close-on-exec file descriptor flag (see **fcntl**\\ (2)) is"]
    #[doc = "\t\tautomatically enabled for the new file descriptor."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tA new file descriptor (a nonnegative integer), or -1 if an"]
    #[doc = "\t\terror occurred (in which case, *errno* is set appropriately)."]
    #[doc = ""]
    #[doc = " BPF_OBJ_PIN"]
    #[doc = "\tDescription"]
    #[doc = "\t\tPin an eBPF program or map referred by the specified *bpf_fd*"]
    #[doc = "\t\tto the provided *pathname* on the filesystem."]
    #[doc = ""]
    #[doc = "\t\tThe *pathname* argument must not contain a dot (\".\")."]
    #[doc = ""]
    #[doc = "\t\tOn success, *pathname* retains a reference to the eBPF object,"]
    #[doc = "\t\tpreventing deallocation of the object when the original"]
    #[doc = "\t\t*bpf_fd* is closed. This allow the eBPF object to live beyond"]
    #[doc = "\t\t**close**\\ (\\ *bpf_fd*\\ ), and hence the lifetime of the parent"]
    #[doc = "\t\tprocess."]
    #[doc = ""]
    #[doc = "\t\tApplying **unlink**\\ (2) or similar calls to the *pathname*"]
    #[doc = "\t\tunpins the object from the filesystem, removing the reference."]
    #[doc = "\t\tIf no other file descriptors or filesystem nodes refer to the"]
    #[doc = "\t\tsame object, it will be deallocated (see NOTES)."]
    #[doc = ""]
    #[doc = "\t\tThe filesystem type for the parent directory of *pathname* must"]
    #[doc = "\t\tbe **BPF_FS_MAGIC**."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tReturns zero on success. On error, -1 is returned and *errno*"]
    #[doc = "\t\tis set appropriately."]
    #[doc = ""]
    #[doc = " BPF_OBJ_GET"]
    #[doc = "\tDescription"]
    #[doc = "\t\tOpen a file descriptor for the eBPF object pinned to the"]
    #[doc = "\t\tspecified *pathname*."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tA new file descriptor (a nonnegative integer), or -1 if an"]
    #[doc = "\t\terror occurred (in which case, *errno* is set appropriately)."]
    #[doc = ""]
    #[doc = " BPF_PROG_ATTACH"]
    #[doc = "\tDescription"]
    #[doc = "\t\tAttach an eBPF program to a *target_fd* at the specified"]
    #[doc = "\t\t*attach_type* hook."]
    #[doc = ""]
    #[doc = "\t\tThe *attach_type* specifies the eBPF attachment point to"]
    #[doc = "\t\tattach the program to, and must be one of *bpf_attach_type*"]
    #[doc = "\t\t(see below)."]
    #[doc = ""]
    #[doc = "\t\tThe *attach_bpf_fd* must be a valid file descriptor for a"]
    #[doc = "\t\tloaded eBPF program of a cgroup, flow dissector, LIRC, sockmap"]
    #[doc = "\t\tor sock_ops type corresponding to the specified *attach_type*."]
    #[doc = ""]
    #[doc = "\t\tThe *target_fd* must be a valid file descriptor for a kernel"]
    #[doc = "\t\tobject which depends on the attach type of *attach_bpf_fd*:"]
    #[doc = ""]
    #[doc = "\t\t**BPF_PROG_TYPE_CGROUP_DEVICE**,"]
    #[doc = "\t\t**BPF_PROG_TYPE_CGROUP_SKB**,"]
    #[doc = "\t\t**BPF_PROG_TYPE_CGROUP_SOCK**,"]
    #[doc = "\t\t**BPF_PROG_TYPE_CGROUP_SOCK_ADDR**,"]
    #[doc = "\t\t**BPF_PROG_TYPE_CGROUP_SOCKOPT**,"]
    #[doc = "\t\t**BPF_PROG_TYPE_CGROUP_SYSCTL**,"]
    #[doc = "\t\t**BPF_PROG_TYPE_SOCK_OPS**"]
    #[doc = ""]
    #[doc = "\t\t\tControl Group v2 hierarchy with the eBPF controller"]
    #[doc = "\t\t\tenabled. Requires the kernel to be compiled with"]
    #[doc = "\t\t\t**CONFIG_CGROUP_BPF**."]
    #[doc = ""]
    #[doc = "\t\t**BPF_PROG_TYPE_FLOW_DISSECTOR**"]
    #[doc = ""]
    #[doc = "\t\t\tNetwork namespace (eg /proc/self/ns/net)."]
    #[doc = ""]
    #[doc = "\t\t**BPF_PROG_TYPE_LIRC_MODE2**"]
    #[doc = ""]
    #[doc = "\t\t\tLIRC device path (eg /dev/lircN). Requires the kernel"]
    #[doc = "\t\t\tto be compiled with **CONFIG_BPF_LIRC_MODE2**."]
    #[doc = ""]
    #[doc = "\t\t**BPF_PROG_TYPE_SK_SKB**,"]
    #[doc = "\t\t**BPF_PROG_TYPE_SK_MSG**"]
    #[doc = ""]
    #[doc = "\t\t\teBPF map of socket type (eg **BPF_MAP_TYPE_SOCKHASH**)."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tReturns zero on success. On error, -1 is returned and *errno*"]
    #[doc = "\t\tis set appropriately."]
    #[doc = ""]
    #[doc = " BPF_PROG_DETACH"]
    #[doc = "\tDescription"]
    #[doc = "\t\tDetach the eBPF program associated with the *target_fd* at the"]
    #[doc = "\t\thook specified by *attach_type*. The program must have been"]
    #[doc = "\t\tpreviously attached using **BPF_PROG_ATTACH**."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tReturns zero on success. On error, -1 is returned and *errno*"]
    #[doc = "\t\tis set appropriately."]
    #[doc = ""]
    #[doc = " BPF_PROG_TEST_RUN"]
    #[doc = "\tDescription"]
    #[doc = "\t\tRun the eBPF program associated with the *prog_fd* a *repeat*"]
    #[doc = "\t\tnumber of times against a provided program context *ctx_in* and"]
    #[doc = "\t\tdata *data_in*, and return the modified program context"]
    #[doc = "\t\t*ctx_out*, *data_out* (for example, packet data), result of the"]
    #[doc = "\t\texecution *retval*, and *duration* of the test run."]
    #[doc = ""]
    #[doc = "\t\tThe sizes of the buffers provided as input and output"]
    #[doc = "\t\tparameters *ctx_in*, *ctx_out*, *data_in*, and *data_out* must"]
    #[doc = "\t\tbe provided in the corresponding variables *ctx_size_in*,"]
    #[doc = "\t\t*ctx_size_out*, *data_size_in*, and/or *data_size_out*. If any"]
    #[doc = "\t\tof these parameters are not provided (ie set to NULL), the"]
    #[doc = "\t\tcorresponding size field must be zero."]
    #[doc = ""]
    #[doc = "\t\tSome program types have particular requirements:"]
    #[doc = ""]
    #[doc = "\t\t**BPF_PROG_TYPE_SK_LOOKUP**"]
    #[doc = "\t\t\t*data_in* and *data_out* must be NULL."]
    #[doc = ""]
    #[doc = "\t\t**BPF_PROG_TYPE_RAW_TRACEPOINT**,"]
    #[doc = "\t\t**BPF_PROG_TYPE_RAW_TRACEPOINT_WRITABLE**"]
    #[doc = ""]
    #[doc = "\t\t\t*ctx_out*, *data_in* and *data_out* must be NULL."]
    #[doc = "\t\t\t*repeat* must be zero."]
    #[doc = ""]
    #[doc = "\t\tBPF_PROG_RUN is an alias for BPF_PROG_TEST_RUN."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tReturns zero on success. On error, -1 is returned and *errno*"]
    #[doc = "\t\tis set appropriately."]
    #[doc = ""]
    #[doc = "\t\t**ENOSPC**"]
    #[doc = "\t\t\tEither *data_size_out* or *ctx_size_out* is too small."]
    #[doc = "\t\t**ENOTSUPP**"]
    #[doc = "\t\t\tThis command is not supported by the program type of"]
    #[doc = "\t\t\tthe program referred to by *prog_fd*."]
    #[doc = ""]
    #[doc = " BPF_PROG_GET_NEXT_ID"]
    #[doc = "\tDescription"]
    #[doc = "\t\tFetch the next eBPF program currently loaded into the kernel."]
    #[doc = ""]
    #[doc = "\t\tLooks for the eBPF program with an id greater than *start_id*"]
    #[doc = "\t\tand updates *next_id* on success. If no other eBPF programs"]
    #[doc = "\t\tremain with ids higher than *start_id*, returns -1 and sets"]
    #[doc = "\t\t*errno* to **ENOENT**."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tReturns zero on success. On error, or when no id remains, -1"]
    #[doc = "\t\tis returned and *errno* is set appropriately."]
    #[doc = ""]
    #[doc = " BPF_MAP_GET_NEXT_ID"]
    #[doc = "\tDescription"]
    #[doc = "\t\tFetch the next eBPF map currently loaded into the kernel."]
    #[doc = ""]
    #[doc = "\t\tLooks for the eBPF map with an id greater than *start_id*"]
    #[doc = "\t\tand updates *next_id* on success. If no other eBPF maps"]
    #[doc = "\t\tremain with ids higher than *start_id*, returns -1 and sets"]
    #[doc = "\t\t*errno* to **ENOENT**."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tReturns zero on success. On error, or when no id remains, -1"]
    #[doc = "\t\tis returned and *errno* is set appropriately."]
    #[doc = ""]
    #[doc = " BPF_PROG_GET_FD_BY_ID"]
    #[doc = "\tDescription"]
    #[doc = "\t\tOpen a file descriptor for the eBPF program corresponding to"]
    #[doc = "\t\t*prog_id*."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tA new file descriptor (a nonnegative integer), or -1 if an"]
    #[doc = "\t\terror occurred (in which case, *errno* is set appropriately)."]
    #[doc = ""]
    #[doc = " BPF_MAP_GET_FD_BY_ID"]
    #[doc = "\tDescription"]
    #[doc = "\t\tOpen a file descriptor for the eBPF map corresponding to"]
    #[doc = "\t\t*map_id*."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tA new file descriptor (a nonnegative integer), or -1 if an"]
    #[doc = "\t\terror occurred (in which case, *errno* is set appropriately)."]
    #[doc = ""]
    #[doc = " BPF_OBJ_GET_INFO_BY_FD"]
    #[doc = "\tDescription"]
    #[doc = "\t\tObtain information about the eBPF object corresponding to"]
    #[doc = "\t\t*bpf_fd*."]
    #[doc = ""]
    #[doc = "\t\tPopulates up to *info_len* bytes of *info*, which will be in"]
    #[doc = "\t\tone of the following formats depending on the eBPF object type"]
    #[doc = "\t\tof *bpf_fd*:"]
    #[doc = ""]
    #[doc = "\t\t* **struct bpf_prog_info**"]
    #[doc = "\t\t* **struct bpf_map_info**"]
    #[doc = "\t\t* **struct bpf_btf_info**"]
    #[doc = "\t\t* **struct bpf_link_info**"]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tReturns zero on success. On error, -1 is returned and *errno*"]
    #[doc = "\t\tis set appropriately."]
    #[doc = ""]
    #[doc = " BPF_PROG_QUERY"]
    #[doc = "\tDescription"]
    #[doc = "\t\tObtain information about eBPF programs associated with the"]
    #[doc = "\t\tspecified *attach_type* hook."]
    #[doc = ""]
    #[doc = "\t\tThe *target_fd* must be a valid file descriptor for a kernel"]
    #[doc = "\t\tobject which depends on the attach type of *attach_bpf_fd*:"]
    #[doc = ""]
    #[doc = "\t\t**BPF_PROG_TYPE_CGROUP_DEVICE**,"]
    #[doc = "\t\t**BPF_PROG_TYPE_CGROUP_SKB**,"]
    #[doc = "\t\t**BPF_PROG_TYPE_CGROUP_SOCK**,"]
    #[doc = "\t\t**BPF_PROG_TYPE_CGROUP_SOCK_ADDR**,"]
    #[doc = "\t\t**BPF_PROG_TYPE_CGROUP_SOCKOPT**,"]
    #[doc = "\t\t**BPF_PROG_TYPE_CGROUP_SYSCTL**,"]
    #[doc = "\t\t**BPF_PROG_TYPE_SOCK_OPS**"]
    #[doc = ""]
    #[doc = "\t\t\tControl Group v2 hierarchy with the eBPF controller"]
    #[doc = "\t\t\tenabled. Requires the kernel to be compiled with"]
    #[doc = "\t\t\t**CONFIG_CGROUP_BPF**."]
    #[doc = ""]
    #[doc = "\t\t**BPF_PROG_TYPE_FLOW_DISSECTOR**"]
    #[doc = ""]
    #[doc = "\t\t\tNetwork namespace (eg /proc/self/ns/net)."]
    #[doc = ""]
    #[doc = "\t\t**BPF_PROG_TYPE_LIRC_MODE2**"]
    #[doc = ""]
    #[doc = "\t\t\tLIRC device path (eg /dev/lircN). Requires the kernel"]
    #[doc = "\t\t\tto be compiled with **CONFIG_BPF_LIRC_MODE2**."]
    #[doc = ""]
    #[doc = "\t\t**BPF_PROG_QUERY** always fetches the number of programs"]
    #[doc = "\t\tattached and the *attach_flags* which were used to attach those"]
    #[doc = "\t\tprograms. Additionally, if *prog_ids* is nonzero and the number"]
    #[doc = "\t\tof attached programs is less than *prog_cnt*, populates"]
    #[doc = "\t\t*prog_ids* with the eBPF program ids of the programs attached"]
    #[doc = "\t\tat *target_fd*."]
    #[doc = ""]
    #[doc = "\t\tThe following flags may alter the result:"]
    #[doc = ""]
    #[doc = "\t\t**BPF_F_QUERY_EFFECTIVE**"]
    #[doc = "\t\t\tOnly return information regarding programs which are"]
    #[doc = "\t\t\tcurrently effective at the specified *target_fd*."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tReturns zero on success. On error, -1 is returned and *errno*"]
    #[doc = "\t\tis set appropriately."]
    #[doc = ""]
    #[doc = " BPF_RAW_TRACEPOINT_OPEN"]
    #[doc = "\tDescription"]
    #[doc = "\t\tAttach an eBPF program to a tracepoint *name* to access kernel"]
    #[doc = "\t\tinternal arguments of the tracepoint in their raw form."]
    #[doc = ""]
    #[doc = "\t\tThe *prog_fd* must be a valid file descriptor associated with"]
    #[doc = "\t\ta loaded eBPF program of type **BPF_PROG_TYPE_RAW_TRACEPOINT**."]
    #[doc = ""]
    #[doc = "\t\tNo ABI guarantees are made about the content of tracepoint"]
    #[doc = "\t\targuments exposed to the corresponding eBPF program."]
    #[doc = ""]
    #[doc = "\t\tApplying **close**\\ (2) to the file descriptor returned by"]
    #[doc = "\t\t**BPF_RAW_TRACEPOINT_OPEN** will delete the map (but see NOTES)."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tA new file descriptor (a nonnegative integer), or -1 if an"]
    #[doc = "\t\terror occurred (in which case, *errno* is set appropriately)."]
    #[doc = ""]
    #[doc = " BPF_BTF_LOAD"]
    #[doc = "\tDescription"]
    #[doc = "\t\tVerify and load BPF Type Format (BTF) metadata into the kernel,"]
    #[doc = "\t\treturning a new file descriptor associated with the metadata."]
    #[doc = "\t\tBTF is described in more detail at"]
    #[doc = "\t\thttps://www.kernel.org/doc/html/latest/bpf/btf.html."]
    #[doc = ""]
    #[doc = "\t\tThe *btf* parameter must point to valid memory providing"]
    #[doc = "\t\t*btf_size* bytes of BTF binary metadata."]
    #[doc = ""]
    #[doc = "\t\tThe returned file descriptor can be passed to other **bpf**\\ ()"]
    #[doc = "\t\tsubcommands such as **BPF_PROG_LOAD** or **BPF_MAP_CREATE** to"]
    #[doc = "\t\tassociate the BTF with those objects."]
    #[doc = ""]
    #[doc = "\t\tSimilar to **BPF_PROG_LOAD**, **BPF_BTF_LOAD** has optional"]
    #[doc = "\t\tparameters to specify a *btf_log_buf*, *btf_log_size* and"]
    #[doc = "\t\t*btf_log_level* which allow the kernel to return freeform log"]
    #[doc = "\t\toutput regarding the BTF verification process."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tA new file descriptor (a nonnegative integer), or -1 if an"]
    #[doc = "\t\terror occurred (in which case, *errno* is set appropriately)."]
    #[doc = ""]
    #[doc = " BPF_BTF_GET_FD_BY_ID"]
    #[doc = "\tDescription"]
    #[doc = "\t\tOpen a file descriptor for the BPF Type Format (BTF)"]
    #[doc = "\t\tcorresponding to *btf_id*."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tA new file descriptor (a nonnegative integer), or -1 if an"]
    #[doc = "\t\terror occurred (in which case, *errno* is set appropriately)."]
    #[doc = ""]
    #[doc = " BPF_TASK_FD_QUERY"]
    #[doc = "\tDescription"]
    #[doc = "\t\tObtain information about eBPF programs associated with the"]
    #[doc = "\t\ttarget process identified by *pid* and *fd*."]
    #[doc = ""]
    #[doc = "\t\tIf the *pid* and *fd* are associated with a tracepoint, kprobe"]
    #[doc = "\t\tor uprobe perf event, then the *prog_id* and *fd_type* will"]
    #[doc = "\t\tbe populated with the eBPF program id and file descriptor type"]
    #[doc = "\t\tof type **bpf_task_fd_type**. If associated with a kprobe or"]
    #[doc = "\t\tuprobe, the  *probe_offset* and *probe_addr* will also be"]
    #[doc = "\t\tpopulated. Optionally, if *buf* is provided, then up to"]
    #[doc = "\t\t*buf_len* bytes of *buf* will be populated with the name of"]
    #[doc = "\t\tthe tracepoint, kprobe or uprobe."]
    #[doc = ""]
    #[doc = "\t\tThe resulting *prog_id* may be introspected in deeper detail"]
    #[doc = "\t\tusing **BPF_PROG_GET_FD_BY_ID** and **BPF_OBJ_GET_INFO_BY_FD**."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tReturns zero on success. On error, -1 is returned and *errno*"]
    #[doc = "\t\tis set appropriately."]
    #[doc = ""]
    #[doc = " BPF_MAP_LOOKUP_AND_DELETE_ELEM"]
    #[doc = "\tDescription"]
    #[doc = "\t\tLook up an element with the given *key* in the map referred to"]
    #[doc = "\t\tby the file descriptor *fd*, and if found, delete the element."]
    #[doc = ""]
    #[doc = "\t\tFor **BPF_MAP_TYPE_QUEUE** and **BPF_MAP_TYPE_STACK** map"]
    #[doc = "\t\ttypes, the *flags* argument needs to be set to 0, but for other"]
    #[doc = "\t\tmap types, it may be specified as:"]
    #[doc = ""]
    #[doc = "\t\t**BPF_F_LOCK**"]
    #[doc = "\t\t\tLook up and delete the value of a spin-locked map"]
    #[doc = "\t\t\twithout returning the lock. This must be specified if"]
    #[doc = "\t\t\tthe elements contain a spinlock."]
    #[doc = ""]
    #[doc = "\t\tThe **BPF_MAP_TYPE_QUEUE** and **BPF_MAP_TYPE_STACK** map types"]
    #[doc = "\t\timplement this command as a \"pop\" operation, deleting the top"]
    #[doc = "\t\telement rather than one corresponding to *key*."]
    #[doc = "\t\tThe *key* and *key_len* parameters should be zeroed when"]
    #[doc = "\t\tissuing this operation for these map types."]
    #[doc = ""]
    #[doc = "\t\tThis command is only valid for the following map types:"]
    #[doc = "\t\t* **BPF_MAP_TYPE_QUEUE**"]
    #[doc = "\t\t* **BPF_MAP_TYPE_STACK**"]
    #[doc = "\t\t* **BPF_MAP_TYPE_HASH**"]
    #[doc = "\t\t* **BPF_MAP_TYPE_PERCPU_HASH**"]
    #[doc = "\t\t* **BPF_MAP_TYPE_LRU_HASH**"]
    #[doc = "\t\t* **BPF_MAP_TYPE_LRU_PERCPU_HASH**"]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tReturns zero on success. On error, -1 is returned and *errno*"]
    #[doc = "\t\tis set appropriately."]
    #[doc = ""]
    #[doc = " BPF_MAP_FREEZE"]
    #[doc = "\tDescription"]
    #[doc = "\t\tFreeze the permissions of the specified map."]
    #[doc = ""]
    #[doc = "\t\tWrite permissions may be frozen by passing zero *flags*."]
    #[doc = "\t\tUpon success, no future syscall invocations may alter the"]
    #[doc = "\t\tmap state of *map_fd*. Write operations from eBPF programs"]
    #[doc = "\t\tare still possible for a frozen map."]
    #[doc = ""]
    #[doc = "\t\tNot supported for maps of type **BPF_MAP_TYPE_STRUCT_OPS**."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tReturns zero on success. On error, -1 is returned and *errno*"]
    #[doc = "\t\tis set appropriately."]
    #[doc = ""]
    #[doc = " BPF_BTF_GET_NEXT_ID"]
    #[doc = "\tDescription"]
    #[doc = "\t\tFetch the next BPF Type Format (BTF) object currently loaded"]
    #[doc = "\t\tinto the kernel."]
    #[doc = ""]
    #[doc = "\t\tLooks for the BTF object with an id greater than *start_id*"]
    #[doc = "\t\tand updates *next_id* on success. If no other BTF objects"]
    #[doc = "\t\tremain with ids higher than *start_id*, returns -1 and sets"]
    #[doc = "\t\t*errno* to **ENOENT**."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tReturns zero on success. On error, or when no id remains, -1"]
    #[doc = "\t\tis returned and *errno* is set appropriately."]
    #[doc = ""]
    #[doc = " BPF_MAP_LOOKUP_BATCH"]
    #[doc = "\tDescription"]
    #[doc = "\t\tIterate and fetch multiple elements in a map."]
    #[doc = ""]
    #[doc = "\t\tTwo opaque values are used to manage batch operations,"]
    #[doc = "\t\t*in_batch* and *out_batch*. Initially, *in_batch* must be set"]
    #[doc = "\t\tto NULL to begin the batched operation. After each subsequent"]
    #[doc = "\t\t**BPF_MAP_LOOKUP_BATCH**, the caller should pass the resultant"]
    #[doc = "\t\t*out_batch* as the *in_batch* for the next operation to"]
    #[doc = "\t\tcontinue iteration from the current point."]
    #[doc = ""]
    #[doc = "\t\tThe *keys* and *values* are output parameters which must point"]
    #[doc = "\t\tto memory large enough to hold *count* items based on the key"]
    #[doc = "\t\tand value size of the map *map_fd*. The *keys* buffer must be"]
    #[doc = "\t\tof *key_size* * *count*. The *values* buffer must be of"]
    #[doc = "\t\t*value_size* * *count*."]
    #[doc = ""]
    #[doc = "\t\tThe *elem_flags* argument may be specified as one of the"]
    #[doc = "\t\tfollowing:"]
    #[doc = ""]
    #[doc = "\t\t**BPF_F_LOCK**"]
    #[doc = "\t\t\tLook up the value of a spin-locked map without"]
    #[doc = "\t\t\treturning the lock. This must be specified if the"]
    #[doc = "\t\t\telements contain a spinlock."]
    #[doc = ""]
    #[doc = "\t\tOn success, *count* elements from the map are copied into the"]
    #[doc = "\t\tuser buffer, with the keys copied into *keys* and the values"]
    #[doc = "\t\tcopied into the corresponding indices in *values*."]
    #[doc = ""]
    #[doc = "\t\tIf an error is returned and *errno* is not **EFAULT**, *count*"]
    #[doc = "\t\tis set to the number of successfully processed elements."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tReturns zero on success. On error, -1 is returned and *errno*"]
    #[doc = "\t\tis set appropriately."]
    #[doc = ""]
    #[doc = "\t\tMay set *errno* to **ENOSPC** to indicate that *keys* or"]
    #[doc = "\t\t*values* is too small to dump an entire bucket during"]
    #[doc = "\t\titeration of a hash-based map type."]
    #[doc = ""]
    #[doc = " BPF_MAP_LOOKUP_AND_DELETE_BATCH"]
    #[doc = "\tDescription"]
    #[doc = "\t\tIterate and delete all elements in a map."]
    #[doc = ""]
    #[doc = "\t\tThis operation has the same behavior as"]
    #[doc = "\t\t**BPF_MAP_LOOKUP_BATCH** with two exceptions:"]
    #[doc = ""]
    #[doc = "\t\t* Every element that is successfully returned is also deleted"]
    #[doc = "\t\t  from the map. This is at least *count* elements. Note that"]
    #[doc = "\t\t  *count* is both an input and an output parameter."]
    #[doc = "\t\t* Upon returning with *errno* set to **EFAULT**, up to"]
    #[doc = "\t\t  *count* elements may be deleted without returning the keys"]
    #[doc = "\t\t  and values of the deleted elements."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tReturns zero on success. On error, -1 is returned and *errno*"]
    #[doc = "\t\tis set appropriately."]
    #[doc = ""]
    #[doc = " BPF_MAP_UPDATE_BATCH"]
    #[doc = "\tDescription"]
    #[doc = "\t\tUpdate multiple elements in a map by *key*."]
    #[doc = ""]
    #[doc = "\t\tThe *keys* and *values* are input parameters which must point"]
    #[doc = "\t\tto memory large enough to hold *count* items based on the key"]
    #[doc = "\t\tand value size of the map *map_fd*. The *keys* buffer must be"]
    #[doc = "\t\tof *key_size* * *count*. The *values* buffer must be of"]
    #[doc = "\t\t*value_size* * *count*."]
    #[doc = ""]
    #[doc = "\t\tEach element specified in *keys* is sequentially updated to the"]
    #[doc = "\t\tvalue in the corresponding index in *values*. The *in_batch*"]
    #[doc = "\t\tand *out_batch* parameters are ignored and should be zeroed."]
    #[doc = ""]
    #[doc = "\t\tThe *elem_flags* argument should be specified as one of the"]
    #[doc = "\t\tfollowing:"]
    #[doc = ""]
    #[doc = "\t\t**BPF_ANY**"]
    #[doc = "\t\t\tCreate new elements or update a existing elements."]
    #[doc = "\t\t**BPF_NOEXIST**"]
    #[doc = "\t\t\tCreate new elements only if they do not exist."]
    #[doc = "\t\t**BPF_EXIST**"]
    #[doc = "\t\t\tUpdate existing elements."]
    #[doc = "\t\t**BPF_F_LOCK**"]
    #[doc = "\t\t\tUpdate spin_lock-ed map elements. This must be"]
    #[doc = "\t\t\tspecified if the map value contains a spinlock."]
    #[doc = ""]
    #[doc = "\t\tOn success, *count* elements from the map are updated."]
    #[doc = ""]
    #[doc = "\t\tIf an error is returned and *errno* is not **EFAULT**, *count*"]
    #[doc = "\t\tis set to the number of successfully processed elements."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tReturns zero on success. On error, -1 is returned and *errno*"]
    #[doc = "\t\tis set appropriately."]
    #[doc = ""]
    #[doc = "\t\tMay set *errno* to **EINVAL**, **EPERM**, **ENOMEM**, or"]
    #[doc = "\t\t**E2BIG**. **E2BIG** indicates that the number of elements in"]
    #[doc = "\t\tthe map reached the *max_entries* limit specified at map"]
    #[doc = "\t\tcreation time."]
    #[doc = ""]
    #[doc = "\t\tMay set *errno* to one of the following error codes under"]
    #[doc = "\t\tspecific circumstances:"]
    #[doc = ""]
    #[doc = "\t\t**EEXIST**"]
    #[doc = "\t\t\tIf *flags* specifies **BPF_NOEXIST** and the element"]
    #[doc = "\t\t\twith *key* already exists in the map."]
    #[doc = "\t\t**ENOENT**"]
    #[doc = "\t\t\tIf *flags* specifies **BPF_EXIST** and the element with"]
    #[doc = "\t\t\t*key* does not exist in the map."]
    #[doc = ""]
    #[doc = " BPF_MAP_DELETE_BATCH"]
    #[doc = "\tDescription"]
    #[doc = "\t\tDelete multiple elements in a map by *key*."]
    #[doc = ""]
    #[doc = "\t\tThe *keys* parameter is an input parameter which must point"]
    #[doc = "\t\tto memory large enough to hold *count* items based on the key"]
    #[doc = "\t\tsize of the map *map_fd*, that is, *key_size* * *count*."]
    #[doc = ""]
    #[doc = "\t\tEach element specified in *keys* is sequentially deleted. The"]
    #[doc = "\t\t*in_batch*, *out_batch*, and *values* parameters are ignored"]
    #[doc = "\t\tand should be zeroed."]
    #[doc = ""]
    #[doc = "\t\tThe *elem_flags* argument may be specified as one of the"]
    #[doc = "\t\tfollowing:"]
    #[doc = ""]
    #[doc = "\t\t**BPF_F_LOCK**"]
    #[doc = "\t\t\tLook up the value of a spin-locked map without"]
    #[doc = "\t\t\treturning the lock. This must be specified if the"]
    #[doc = "\t\t\telements contain a spinlock."]
    #[doc = ""]
    #[doc = "\t\tOn success, *count* elements from the map are updated."]
    #[doc = ""]
    #[doc = "\t\tIf an error is returned and *errno* is not **EFAULT**, *count*"]
    #[doc = "\t\tis set to the number of successfully processed elements. If"]
    #[doc = "\t\t*errno* is **EFAULT**, up to *count* elements may be been"]
    #[doc = "\t\tdeleted."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tReturns zero on success. On error, -1 is returned and *errno*"]
    #[doc = "\t\tis set appropriately."]
    #[doc = ""]
    #[doc = " BPF_LINK_CREATE"]
    #[doc = "\tDescription"]
    #[doc = "\t\tAttach an eBPF program to a *target_fd* at the specified"]
    #[doc = "\t\t*attach_type* hook and return a file descriptor handle for"]
    #[doc = "\t\tmanaging the link."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tA new file descriptor (a nonnegative integer), or -1 if an"]
    #[doc = "\t\terror occurred (in which case, *errno* is set appropriately)."]
    #[doc = ""]
    #[doc = " BPF_LINK_UPDATE"]
    #[doc = "\tDescription"]
    #[doc = "\t\tUpdate the eBPF program in the specified *link_fd* to"]
    #[doc = "\t\t*new_prog_fd*."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tReturns zero on success. On error, -1 is returned and *errno*"]
    #[doc = "\t\tis set appropriately."]
    #[doc = ""]
    #[doc = " BPF_LINK_GET_FD_BY_ID"]
    #[doc = "\tDescription"]
    #[doc = "\t\tOpen a file descriptor for the eBPF Link corresponding to"]
    #[doc = "\t\t*link_id*."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tA new file descriptor (a nonnegative integer), or -1 if an"]
    #[doc = "\t\terror occurred (in which case, *errno* is set appropriately)."]
    #[doc = ""]
    #[doc = " BPF_LINK_GET_NEXT_ID"]
    #[doc = "\tDescription"]
    #[doc = "\t\tFetch the next eBPF link currently loaded into the kernel."]
    #[doc = ""]
    #[doc = "\t\tLooks for the eBPF link with an id greater than *start_id*"]
    #[doc = "\t\tand updates *next_id* on success. If no other eBPF links"]
    #[doc = "\t\tremain with ids higher than *start_id*, returns -1 and sets"]
    #[doc = "\t\t*errno* to **ENOENT**."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tReturns zero on success. On error, or when no id remains, -1"]
    #[doc = "\t\tis returned and *errno* is set appropriately."]
    #[doc = ""]
    #[doc = " BPF_ENABLE_STATS"]
    #[doc = "\tDescription"]
    #[doc = "\t\tEnable eBPF runtime statistics gathering."]
    #[doc = ""]
    #[doc = "\t\tRuntime statistics gathering for the eBPF runtime is disabled"]
    #[doc = "\t\tby default to minimize the corresponding performance overhead."]
    #[doc = "\t\tThis command enables statistics globally."]
    #[doc = ""]
    #[doc = "\t\tMultiple programs may independently enable statistics."]
    #[doc = "\t\tAfter gathering the desired statistics, eBPF runtime statistics"]
    #[doc = "\t\tmay be disabled again by calling **close**\\ (2) for the file"]
    #[doc = "\t\tdescriptor returned by this function. Statistics will only be"]
    #[doc = "\t\tdisabled system-wide when all outstanding file descriptors"]
    #[doc = "\t\treturned by prior calls for this subcommand are closed."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tA new file descriptor (a nonnegative integer), or -1 if an"]
    #[doc = "\t\terror occurred (in which case, *errno* is set appropriately)."]
    #[doc = ""]
    #[doc = " BPF_ITER_CREATE"]
    #[doc = "\tDescription"]
    #[doc = "\t\tCreate an iterator on top of the specified *link_fd* (as"]
    #[doc = "\t\tpreviously created using **BPF_LINK_CREATE**) and return a"]
    #[doc = "\t\tfile descriptor that can be used to trigger the iteration."]
    #[doc = ""]
    #[doc = "\t\tIf the resulting file descriptor is pinned to the filesystem"]
    #[doc = "\t\tusing  **BPF_OBJ_PIN**, then subsequent **read**\\ (2) syscalls"]
    #[doc = "\t\tfor that path will trigger the iterator to read kernel state"]
    #[doc = "\t\tusing the eBPF program attached to *link_fd*."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tA new file descriptor (a nonnegative integer), or -1 if an"]
    #[doc = "\t\terror occurred (in which case, *errno* is set appropriately)."]
    #[doc = ""]
    #[doc = " BPF_LINK_DETACH"]
    #[doc = "\tDescription"]
    #[doc = "\t\tForcefully detach the specified *link_fd* from its"]
    #[doc = "\t\tcorresponding attachment point."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tReturns zero on success. On error, -1 is returned and *errno*"]
    #[doc = "\t\tis set appropriately."]
    #[doc = ""]
    #[doc = " BPF_PROG_BIND_MAP"]
    #[doc = "\tDescription"]
    #[doc = "\t\tBind a map to the lifetime of an eBPF program."]
    #[doc = ""]
    #[doc = "\t\tThe map identified by *map_fd* is bound to the program"]
    #[doc = "\t\tidentified by *prog_fd* and only released when *prog_fd* is"]
    #[doc = "\t\treleased. This may be used in cases where metadata should be"]
    #[doc = "\t\tassociated with a program which otherwise does not contain any"]
    #[doc = "\t\treferences to the map (for example, embedded in the eBPF"]
    #[doc = "\t\tprogram instructions)."]
    #[doc = ""]
    #[doc = "\tReturn"]
    #[doc = "\t\tReturns zero on success. On error, -1 is returned and *errno*"]
    #[doc = "\t\tis set appropriately."]
    #[doc = ""]
    #[doc = " NOTES"]
    #[doc = "\teBPF objects (maps and programs) can be shared between processes."]
    #[doc = ""]
    #[doc = "\t* After **fork**\\ (2), the child inherits file descriptors"]
    #[doc = "\t  referring to the same eBPF objects."]
    #[doc = "\t* File descriptors referring to eBPF objects can be transferred over"]
    #[doc = "\t  **unix**\\ (7) domain sockets."]
    #[doc = "\t* File descriptors referring to eBPF objects can be duplicated in the"]
    #[doc = "\t  usual way, using **dup**\\ (2) and similar calls."]
    #[doc = "\t* File descriptors referring to eBPF objects can be pinned to the"]
    #[doc = "\t  filesystem using the **BPF_OBJ_PIN** command of **bpf**\\ (2)."]
    #[doc = ""]
    #[doc = "\tAn eBPF object is deallocated only after all file descriptors referring"]
    #[doc = "\tto the object have been closed and no references remain pinned to the"]
    #[doc = "\tfilesystem or attached (for example, bound to a program or device)."]
    pub type bpf_cmd = ::cty::c_uint;
    pub const bpf_map_type_BPF_MAP_TYPE_UNSPEC: bpf_map_type = 0;
    pub const bpf_map_type_BPF_MAP_TYPE_HASH: bpf_map_type = 1;
    pub const bpf_map_type_BPF_MAP_TYPE_ARRAY: bpf_map_type = 2;
    pub const bpf_map_type_BPF_MAP_TYPE_PROG_ARRAY: bpf_map_type = 3;
    pub const bpf_map_type_BPF_MAP_TYPE_PERF_EVENT_ARRAY: bpf_map_type = 4;
    pub const bpf_map_type_BPF_MAP_TYPE_PERCPU_HASH: bpf_map_type = 5;
    pub const bpf_map_type_BPF_MAP_TYPE_PERCPU_ARRAY: bpf_map_type = 6;
    pub const bpf_map_type_BPF_MAP_TYPE_STACK_TRACE: bpf_map_type = 7;
    pub const bpf_map_type_BPF_MAP_TYPE_CGROUP_ARRAY: bpf_map_type = 8;
    pub const bpf_map_type_BPF_MAP_TYPE_LRU_HASH: bpf_map_type = 9;
    pub const bpf_map_type_BPF_MAP_TYPE_LRU_PERCPU_HASH: bpf_map_type = 10;
    pub const bpf_map_type_BPF_MAP_TYPE_LPM_TRIE: bpf_map_type = 11;
    pub const bpf_map_type_BPF_MAP_TYPE_ARRAY_OF_MAPS: bpf_map_type = 12;
    pub const bpf_map_type_BPF_MAP_TYPE_HASH_OF_MAPS: bpf_map_type = 13;
    pub const bpf_map_type_BPF_MAP_TYPE_DEVMAP: bpf_map_type = 14;
    pub const bpf_map_type_BPF_MAP_TYPE_SOCKMAP: bpf_map_type = 15;
    pub const bpf_map_type_BPF_MAP_TYPE_CPUMAP: bpf_map_type = 16;
    pub const bpf_map_type_BPF_MAP_TYPE_XSKMAP: bpf_map_type = 17;
    pub const bpf_map_type_BPF_MAP_TYPE_SOCKHASH: bpf_map_type = 18;
    pub const bpf_map_type_BPF_MAP_TYPE_CGROUP_STORAGE_DEPRECATED: bpf_map_type = 19;
    pub const bpf_map_type_BPF_MAP_TYPE_CGROUP_STORAGE: bpf_map_type = 19;
    pub const bpf_map_type_BPF_MAP_TYPE_REUSEPORT_SOCKARRAY: bpf_map_type = 20;
    pub const bpf_map_type_BPF_MAP_TYPE_PERCPU_CGROUP_STORAGE: bpf_map_type = 21;
    pub const bpf_map_type_BPF_MAP_TYPE_QUEUE: bpf_map_type = 22;
    pub const bpf_map_type_BPF_MAP_TYPE_STACK: bpf_map_type = 23;
    pub const bpf_map_type_BPF_MAP_TYPE_SK_STORAGE: bpf_map_type = 24;
    pub const bpf_map_type_BPF_MAP_TYPE_DEVMAP_HASH: bpf_map_type = 25;
    pub const bpf_map_type_BPF_MAP_TYPE_STRUCT_OPS: bpf_map_type = 26;
    pub const bpf_map_type_BPF_MAP_TYPE_RINGBUF: bpf_map_type = 27;
    pub const bpf_map_type_BPF_MAP_TYPE_INODE_STORAGE: bpf_map_type = 28;
    pub const bpf_map_type_BPF_MAP_TYPE_TASK_STORAGE: bpf_map_type = 29;
    pub const bpf_map_type_BPF_MAP_TYPE_BLOOM_FILTER: bpf_map_type = 30;
    pub const bpf_map_type_BPF_MAP_TYPE_USER_RINGBUF: bpf_map_type = 31;
    pub const bpf_map_type_BPF_MAP_TYPE_CGRP_STORAGE: bpf_map_type = 32;
    pub type bpf_map_type = ::cty::c_uint;
    pub const bpf_prog_type_BPF_PROG_TYPE_UNSPEC: bpf_prog_type = 0;
    pub const bpf_prog_type_BPF_PROG_TYPE_SOCKET_FILTER: bpf_prog_type = 1;
    pub const bpf_prog_type_BPF_PROG_TYPE_KPROBE: bpf_prog_type = 2;
    pub const bpf_prog_type_BPF_PROG_TYPE_SCHED_CLS: bpf_prog_type = 3;
    pub const bpf_prog_type_BPF_PROG_TYPE_SCHED_ACT: bpf_prog_type = 4;
    pub const bpf_prog_type_BPF_PROG_TYPE_TRACEPOINT: bpf_prog_type = 5;
    pub const bpf_prog_type_BPF_PROG_TYPE_XDP: bpf_prog_type = 6;
    pub const bpf_prog_type_BPF_PROG_TYPE_PERF_EVENT: bpf_prog_type = 7;
    pub const bpf_prog_type_BPF_PROG_TYPE_CGROUP_SKB: bpf_prog_type = 8;
    pub const bpf_prog_type_BPF_PROG_TYPE_CGROUP_SOCK: bpf_prog_type = 9;
    pub const bpf_prog_type_BPF_PROG_TYPE_LWT_IN: bpf_prog_type = 10;
    pub const bpf_prog_type_BPF_PROG_TYPE_LWT_OUT: bpf_prog_type = 11;
    pub const bpf_prog_type_BPF_PROG_TYPE_LWT_XMIT: bpf_prog_type = 12;
    pub const bpf_prog_type_BPF_PROG_TYPE_SOCK_OPS: bpf_prog_type = 13;
    pub const bpf_prog_type_BPF_PROG_TYPE_SK_SKB: bpf_prog_type = 14;
    pub const bpf_prog_type_BPF_PROG_TYPE_CGROUP_DEVICE: bpf_prog_type = 15;
    pub const bpf_prog_type_BPF_PROG_TYPE_SK_MSG: bpf_prog_type = 16;
    pub const bpf_prog_type_BPF_PROG_TYPE_RAW_TRACEPOINT: bpf_prog_type = 17;
    pub const bpf_prog_type_BPF_PROG_TYPE_CGROUP_SOCK_ADDR: bpf_prog_type = 18;
    pub const bpf_prog_type_BPF_PROG_TYPE_LWT_SEG6LOCAL: bpf_prog_type = 19;
    pub const bpf_prog_type_BPF_PROG_TYPE_LIRC_MODE2: bpf_prog_type = 20;
    pub const bpf_prog_type_BPF_PROG_TYPE_SK_REUSEPORT: bpf_prog_type = 21;
    pub const bpf_prog_type_BPF_PROG_TYPE_FLOW_DISSECTOR: bpf_prog_type = 22;
    pub const bpf_prog_type_BPF_PROG_TYPE_CGROUP_SYSCTL: bpf_prog_type = 23;
    pub const bpf_prog_type_BPF_PROG_TYPE_RAW_TRACEPOINT_WRITABLE: bpf_prog_type = 24;
    pub const bpf_prog_type_BPF_PROG_TYPE_CGROUP_SOCKOPT: bpf_prog_type = 25;
    pub const bpf_prog_type_BPF_PROG_TYPE_TRACING: bpf_prog_type = 26;
    pub const bpf_prog_type_BPF_PROG_TYPE_STRUCT_OPS: bpf_prog_type = 27;
    pub const bpf_prog_type_BPF_PROG_TYPE_EXT: bpf_prog_type = 28;
    pub const bpf_prog_type_BPF_PROG_TYPE_LSM: bpf_prog_type = 29;
    pub const bpf_prog_type_BPF_PROG_TYPE_SK_LOOKUP: bpf_prog_type = 30;
    pub const bpf_prog_type_BPF_PROG_TYPE_SYSCALL: bpf_prog_type = 31;
    pub const bpf_prog_type_BPF_PROG_TYPE_NETFILTER: bpf_prog_type = 32;
    pub type bpf_prog_type = ::cty::c_uint;
    pub const bpf_attach_type_BPF_CGROUP_INET_INGRESS: bpf_attach_type = 0;
    pub const bpf_attach_type_BPF_CGROUP_INET_EGRESS: bpf_attach_type = 1;
    pub const bpf_attach_type_BPF_CGROUP_INET_SOCK_CREATE: bpf_attach_type = 2;
    pub const bpf_attach_type_BPF_CGROUP_SOCK_OPS: bpf_attach_type = 3;
    pub const bpf_attach_type_BPF_SK_SKB_STREAM_PARSER: bpf_attach_type = 4;
    pub const bpf_attach_type_BPF_SK_SKB_STREAM_VERDICT: bpf_attach_type = 5;
    pub const bpf_attach_type_BPF_CGROUP_DEVICE: bpf_attach_type = 6;
    pub const bpf_attach_type_BPF_SK_MSG_VERDICT: bpf_attach_type = 7;
    pub const bpf_attach_type_BPF_CGROUP_INET4_BIND: bpf_attach_type = 8;
    pub const bpf_attach_type_BPF_CGROUP_INET6_BIND: bpf_attach_type = 9;
    pub const bpf_attach_type_BPF_CGROUP_INET4_CONNECT: bpf_attach_type = 10;
    pub const bpf_attach_type_BPF_CGROUP_INET6_CONNECT: bpf_attach_type = 11;
    pub const bpf_attach_type_BPF_CGROUP_INET4_POST_BIND: bpf_attach_type = 12;
    pub const bpf_attach_type_BPF_CGROUP_INET6_POST_BIND: bpf_attach_type = 13;
    pub const bpf_attach_type_BPF_CGROUP_UDP4_SENDMSG: bpf_attach_type = 14;
    pub const bpf_attach_type_BPF_CGROUP_UDP6_SENDMSG: bpf_attach_type = 15;
    pub const bpf_attach_type_BPF_LIRC_MODE2: bpf_attach_type = 16;
    pub const bpf_attach_type_BPF_FLOW_DISSECTOR: bpf_attach_type = 17;
    pub const bpf_attach_type_BPF_CGROUP_SYSCTL: bpf_attach_type = 18;
    pub const bpf_attach_type_BPF_CGROUP_UDP4_RECVMSG: bpf_attach_type = 19;
    pub const bpf_attach_type_BPF_CGROUP_UDP6_RECVMSG: bpf_attach_type = 20;
    pub const bpf_attach_type_BPF_CGROUP_GETSOCKOPT: bpf_attach_type = 21;
    pub const bpf_attach_type_BPF_CGROUP_SETSOCKOPT: bpf_attach_type = 22;
    pub const bpf_attach_type_BPF_TRACE_RAW_TP: bpf_attach_type = 23;
    pub const bpf_attach_type_BPF_TRACE_FENTRY: bpf_attach_type = 24;
    pub const bpf_attach_type_BPF_TRACE_FEXIT: bpf_attach_type = 25;
    pub const bpf_attach_type_BPF_MODIFY_RETURN: bpf_attach_type = 26;
    pub const bpf_attach_type_BPF_LSM_MAC: bpf_attach_type = 27;
    pub const bpf_attach_type_BPF_TRACE_ITER: bpf_attach_type = 28;
    pub const bpf_attach_type_BPF_CGROUP_INET4_GETPEERNAME: bpf_attach_type = 29;
    pub const bpf_attach_type_BPF_CGROUP_INET6_GETPEERNAME: bpf_attach_type = 30;
    pub const bpf_attach_type_BPF_CGROUP_INET4_GETSOCKNAME: bpf_attach_type = 31;
    pub const bpf_attach_type_BPF_CGROUP_INET6_GETSOCKNAME: bpf_attach_type = 32;
    pub const bpf_attach_type_BPF_XDP_DEVMAP: bpf_attach_type = 33;
    pub const bpf_attach_type_BPF_CGROUP_INET_SOCK_RELEASE: bpf_attach_type = 34;
    pub const bpf_attach_type_BPF_XDP_CPUMAP: bpf_attach_type = 35;
    pub const bpf_attach_type_BPF_SK_LOOKUP: bpf_attach_type = 36;
    pub const bpf_attach_type_BPF_XDP: bpf_attach_type = 37;
    pub const bpf_attach_type_BPF_SK_SKB_VERDICT: bpf_attach_type = 38;
    pub const bpf_attach_type_BPF_SK_REUSEPORT_SELECT: bpf_attach_type = 39;
    pub const bpf_attach_type_BPF_SK_REUSEPORT_SELECT_OR_MIGRATE: bpf_attach_type = 40;
    pub const bpf_attach_type_BPF_PERF_EVENT: bpf_attach_type = 41;
    pub const bpf_attach_type_BPF_TRACE_KPROBE_MULTI: bpf_attach_type = 42;
    pub const bpf_attach_type_BPF_LSM_CGROUP: bpf_attach_type = 43;
    pub const bpf_attach_type_BPF_STRUCT_OPS: bpf_attach_type = 44;
    pub const bpf_attach_type_BPF_NETFILTER: bpf_attach_type = 45;
    pub const bpf_attach_type___MAX_BPF_ATTACH_TYPE: bpf_attach_type = 46;
    pub type bpf_attach_type = ::cty::c_uint;
    pub const bpf_link_type_BPF_LINK_TYPE_UNSPEC: bpf_link_type = 0;
    pub const bpf_link_type_BPF_LINK_TYPE_RAW_TRACEPOINT: bpf_link_type = 1;
    pub const bpf_link_type_BPF_LINK_TYPE_TRACING: bpf_link_type = 2;
    pub const bpf_link_type_BPF_LINK_TYPE_CGROUP: bpf_link_type = 3;
    pub const bpf_link_type_BPF_LINK_TYPE_ITER: bpf_link_type = 4;
    pub const bpf_link_type_BPF_LINK_TYPE_NETNS: bpf_link_type = 5;
    pub const bpf_link_type_BPF_LINK_TYPE_XDP: bpf_link_type = 6;
    pub const bpf_link_type_BPF_LINK_TYPE_PERF_EVENT: bpf_link_type = 7;
    pub const bpf_link_type_BPF_LINK_TYPE_KPROBE_MULTI: bpf_link_type = 8;
    pub const bpf_link_type_BPF_LINK_TYPE_STRUCT_OPS: bpf_link_type = 9;
    pub const bpf_link_type_BPF_LINK_TYPE_NETFILTER: bpf_link_type = 10;
    pub const bpf_link_type_MAX_BPF_LINK_TYPE: bpf_link_type = 11;
    pub type bpf_link_type = ::cty::c_uint;
    pub const BPF_ANY: ::cty::c_uint = 0;
    pub const BPF_NOEXIST: ::cty::c_uint = 1;
    pub const BPF_EXIST: ::cty::c_uint = 2;
    pub const BPF_F_LOCK: ::cty::c_uint = 4;
    pub type _bindgen_ty_6 = ::cty::c_uint;
    pub const BPF_F_NO_PREALLOC: ::cty::c_uint = 1;
    pub const BPF_F_NO_COMMON_LRU: ::cty::c_uint = 2;
    pub const BPF_F_NUMA_NODE: ::cty::c_uint = 4;
    pub const BPF_F_RDONLY: ::cty::c_uint = 8;
    pub const BPF_F_WRONLY: ::cty::c_uint = 16;
    pub const BPF_F_STACK_BUILD_ID: ::cty::c_uint = 32;
    pub const BPF_F_ZERO_SEED: ::cty::c_uint = 64;
    pub const BPF_F_RDONLY_PROG: ::cty::c_uint = 128;
    pub const BPF_F_WRONLY_PROG: ::cty::c_uint = 256;
    pub const BPF_F_CLONE: ::cty::c_uint = 512;
    pub const BPF_F_MMAPABLE: ::cty::c_uint = 1024;
    pub const BPF_F_PRESERVE_ELEMS: ::cty::c_uint = 2048;
    pub const BPF_F_INNER_MAP: ::cty::c_uint = 4096;
    pub const BPF_F_LINK: ::cty::c_uint = 8192;
    pub const BPF_F_PATH_FD: ::cty::c_uint = 16384;
    pub type _bindgen_ty_7 = ::cty::c_uint;
    pub const bpf_stats_type_BPF_STATS_RUN_TIME: bpf_stats_type = 0;
    pub type bpf_stats_type = ::cty::c_uint;
    pub const bpf_stack_build_id_status_BPF_STACK_BUILD_ID_EMPTY: bpf_stack_build_id_status = 0;
    pub const bpf_stack_build_id_status_BPF_STACK_BUILD_ID_VALID: bpf_stack_build_id_status = 1;
    pub const bpf_stack_build_id_status_BPF_STACK_BUILD_ID_IP: bpf_stack_build_id_status = 2;
    pub type bpf_stack_build_id_status = ::cty::c_uint;
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct bpf_stack_build_id {
        pub status: __s32,
        pub build_id: [::cty::c_uchar; 20usize],
        pub __bindgen_anon_1: bpf_stack_build_id__bindgen_ty_1,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union bpf_stack_build_id__bindgen_ty_1 {
        pub offset: __u64,
        pub ip: __u64,
    }
    #[test]
    fn bindgen_test_layout_bpf_stack_build_id__bindgen_ty_1() {
        assert_eq!(
            ::core::mem::size_of::<bpf_stack_build_id__bindgen_ty_1>(),
            8usize,
            concat!("Size of: ", stringify!(bpf_stack_build_id__bindgen_ty_1))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_stack_build_id__bindgen_ty_1>(),
            8usize,
            concat!(
                "Alignment of ",
                stringify!(bpf_stack_build_id__bindgen_ty_1)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_stack_build_id__bindgen_ty_1>())).offset as *const _
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_stack_build_id__bindgen_ty_1),
                "::",
                stringify!(offset)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_stack_build_id__bindgen_ty_1>())).ip as *const _
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_stack_build_id__bindgen_ty_1),
                "::",
                stringify!(ip)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_bpf_stack_build_id() {
        assert_eq!(
            ::core::mem::size_of::<bpf_stack_build_id>(),
            32usize,
            concat!("Size of: ", stringify!(bpf_stack_build_id))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_stack_build_id>(),
            8usize,
            concat!("Alignment of ", stringify!(bpf_stack_build_id))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_stack_build_id>())).status as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_stack_build_id),
                "::",
                stringify!(status)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_stack_build_id>())).build_id as *const _ as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_stack_build_id),
                "::",
                stringify!(build_id)
            )
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union bpf_attr {
        pub __bindgen_anon_1: bpf_attr__bindgen_ty_1,
        pub __bindgen_anon_2: bpf_attr__bindgen_ty_2,
        pub batch: bpf_attr__bindgen_ty_3,
        pub __bindgen_anon_3: bpf_attr__bindgen_ty_4,
        pub __bindgen_anon_4: bpf_attr__bindgen_ty_5,
        pub __bindgen_anon_5: bpf_attr__bindgen_ty_6,
        pub test: bpf_attr__bindgen_ty_7,
        pub __bindgen_anon_6: bpf_attr__bindgen_ty_8,
        pub info: bpf_attr__bindgen_ty_9,
        pub query: bpf_attr__bindgen_ty_10,
        pub raw_tracepoint: bpf_attr__bindgen_ty_11,
        pub __bindgen_anon_7: bpf_attr__bindgen_ty_12,
        pub task_fd_query: bpf_attr__bindgen_ty_13,
        pub link_create: bpf_attr__bindgen_ty_14,
        pub link_update: bpf_attr__bindgen_ty_15,
        pub link_detach: bpf_attr__bindgen_ty_16,
        pub enable_stats: bpf_attr__bindgen_ty_17,
        pub iter_create: bpf_attr__bindgen_ty_18,
        pub prog_bind_map: bpf_attr__bindgen_ty_19,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_attr__bindgen_ty_1 {
        pub map_type: __u32,
        pub key_size: __u32,
        pub value_size: __u32,
        pub max_entries: __u32,
        pub map_flags: __u32,
        pub inner_map_fd: __u32,
        pub numa_node: __u32,
        pub map_name: [::cty::c_char; 16usize],
        pub map_ifindex: __u32,
        pub btf_fd: __u32,
        pub btf_key_type_id: __u32,
        pub btf_value_type_id: __u32,
        pub btf_vmlinux_value_type_id: __u32,
        pub map_extra: __u64,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_1() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_1>(),
            72usize,
            concat!("Size of: ", stringify!(bpf_attr__bindgen_ty_1))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_1>(),
            8usize,
            concat!("Alignment of ", stringify!(bpf_attr__bindgen_ty_1))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_1>())).map_type as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_1),
                "::",
                stringify!(map_type)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_1>())).key_size as *const _ as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_1),
                "::",
                stringify!(key_size)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_1>())).value_size as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_1),
                "::",
                stringify!(value_size)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_1>())).max_entries as *const _ as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_1),
                "::",
                stringify!(max_entries)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_1>())).map_flags as *const _ as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_1),
                "::",
                stringify!(map_flags)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_1>())).inner_map_fd as *const _
                    as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_1),
                "::",
                stringify!(inner_map_fd)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_1>())).numa_node as *const _ as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_1),
                "::",
                stringify!(numa_node)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_1>())).map_name as *const _ as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_1),
                "::",
                stringify!(map_name)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_1>())).map_ifindex as *const _ as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_1),
                "::",
                stringify!(map_ifindex)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_1>())).btf_fd as *const _ as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_1),
                "::",
                stringify!(btf_fd)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_1>())).btf_key_type_id as *const _
                    as usize
            },
            52usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_1),
                "::",
                stringify!(btf_key_type_id)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_1>())).btf_value_type_id as *const _
                    as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_1),
                "::",
                stringify!(btf_value_type_id)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_1>())).btf_vmlinux_value_type_id
                    as *const _ as usize
            },
            60usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_1),
                "::",
                stringify!(btf_vmlinux_value_type_id)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_1>())).map_extra as *const _ as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_1),
                "::",
                stringify!(map_extra)
            )
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct bpf_attr__bindgen_ty_2 {
        pub map_fd: __u32,
        pub key: __u64,
        pub __bindgen_anon_1: bpf_attr__bindgen_ty_2__bindgen_ty_1,
        pub flags: __u64,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union bpf_attr__bindgen_ty_2__bindgen_ty_1 {
        pub value: __u64,
        pub next_key: __u64,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_2__bindgen_ty_1() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_2__bindgen_ty_1>(),
            8usize,
            concat!(
                "Size of: ",
                stringify!(bpf_attr__bindgen_ty_2__bindgen_ty_1)
            )
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_2__bindgen_ty_1>(),
            8usize,
            concat!(
                "Alignment of ",
                stringify!(bpf_attr__bindgen_ty_2__bindgen_ty_1)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_2__bindgen_ty_1>())).value as *const _
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_2__bindgen_ty_1),
                "::",
                stringify!(value)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_2__bindgen_ty_1>())).next_key
                    as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_2__bindgen_ty_1),
                "::",
                stringify!(next_key)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_2() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_2>(),
            32usize,
            concat!("Size of: ", stringify!(bpf_attr__bindgen_ty_2))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_2>(),
            8usize,
            concat!("Alignment of ", stringify!(bpf_attr__bindgen_ty_2))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_2>())).map_fd as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_2),
                "::",
                stringify!(map_fd)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_attr__bindgen_ty_2>())).key as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_2),
                "::",
                stringify!(key)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_2>())).flags as *const _ as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_2),
                "::",
                stringify!(flags)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_attr__bindgen_ty_3 {
        pub in_batch: __u64,
        pub out_batch: __u64,
        pub keys: __u64,
        pub values: __u64,
        pub count: __u32,
        pub map_fd: __u32,
        pub elem_flags: __u64,
        pub flags: __u64,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_3() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_3>(),
            56usize,
            concat!("Size of: ", stringify!(bpf_attr__bindgen_ty_3))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_3>(),
            8usize,
            concat!("Alignment of ", stringify!(bpf_attr__bindgen_ty_3))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_3>())).in_batch as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_3),
                "::",
                stringify!(in_batch)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_3>())).out_batch as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_3),
                "::",
                stringify!(out_batch)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_3>())).keys as *const _ as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_3),
                "::",
                stringify!(keys)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_3>())).values as *const _ as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_3),
                "::",
                stringify!(values)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_3>())).count as *const _ as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_3),
                "::",
                stringify!(count)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_3>())).map_fd as *const _ as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_3),
                "::",
                stringify!(map_fd)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_3>())).elem_flags as *const _ as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_3),
                "::",
                stringify!(elem_flags)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_3>())).flags as *const _ as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_3),
                "::",
                stringify!(flags)
            )
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct bpf_attr__bindgen_ty_4 {
        pub prog_type: __u32,
        pub insn_cnt: __u32,
        pub insns: __u64,
        pub license: __u64,
        pub log_level: __u32,
        pub log_size: __u32,
        pub log_buf: __u64,
        pub kern_version: __u32,
        pub prog_flags: __u32,
        pub prog_name: [::cty::c_char; 16usize],
        pub prog_ifindex: __u32,
        pub expected_attach_type: __u32,
        pub prog_btf_fd: __u32,
        pub func_info_rec_size: __u32,
        pub func_info: __u64,
        pub func_info_cnt: __u32,
        pub line_info_rec_size: __u32,
        pub line_info: __u64,
        pub line_info_cnt: __u32,
        pub attach_btf_id: __u32,
        pub __bindgen_anon_1: bpf_attr__bindgen_ty_4__bindgen_ty_1,
        pub core_relo_cnt: __u32,
        pub fd_array: __u64,
        pub core_relos: __u64,
        pub core_relo_rec_size: __u32,
        pub log_true_size: __u32,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union bpf_attr__bindgen_ty_4__bindgen_ty_1 {
        pub attach_prog_fd: __u32,
        pub attach_btf_obj_fd: __u32,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_4__bindgen_ty_1() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_4__bindgen_ty_1>(),
            4usize,
            concat!(
                "Size of: ",
                stringify!(bpf_attr__bindgen_ty_4__bindgen_ty_1)
            )
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_4__bindgen_ty_1>(),
            4usize,
            concat!(
                "Alignment of ",
                stringify!(bpf_attr__bindgen_ty_4__bindgen_ty_1)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4__bindgen_ty_1>())).attach_prog_fd
                    as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4__bindgen_ty_1),
                "::",
                stringify!(attach_prog_fd)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4__bindgen_ty_1>())).attach_btf_obj_fd
                    as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4__bindgen_ty_1),
                "::",
                stringify!(attach_btf_obj_fd)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_4() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_4>(),
            144usize,
            concat!("Size of: ", stringify!(bpf_attr__bindgen_ty_4))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_4>(),
            8usize,
            concat!("Alignment of ", stringify!(bpf_attr__bindgen_ty_4))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).prog_type as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(prog_type)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).insn_cnt as *const _ as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(insn_cnt)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).insns as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(insns)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).license as *const _ as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(license)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).log_level as *const _ as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(log_level)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).log_size as *const _ as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(log_size)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).log_buf as *const _ as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(log_buf)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).kern_version as *const _
                    as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(kern_version)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).prog_flags as *const _ as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(prog_flags)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).prog_name as *const _ as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(prog_name)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).prog_ifindex as *const _
                    as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(prog_ifindex)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).expected_attach_type as *const _
                    as usize
            },
            68usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(expected_attach_type)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).prog_btf_fd as *const _ as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(prog_btf_fd)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).func_info_rec_size as *const _
                    as usize
            },
            76usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(func_info_rec_size)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).func_info as *const _ as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(func_info)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).func_info_cnt as *const _
                    as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(func_info_cnt)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).line_info_rec_size as *const _
                    as usize
            },
            92usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(line_info_rec_size)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).line_info as *const _ as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(line_info)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).line_info_cnt as *const _
                    as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(line_info_cnt)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).attach_btf_id as *const _
                    as usize
            },
            108usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(attach_btf_id)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).core_relo_cnt as *const _
                    as usize
            },
            116usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(core_relo_cnt)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).fd_array as *const _ as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(fd_array)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).core_relos as *const _ as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(core_relos)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).core_relo_rec_size as *const _
                    as usize
            },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(core_relo_rec_size)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_4>())).log_true_size as *const _
                    as usize
            },
            140usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_4),
                "::",
                stringify!(log_true_size)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_attr__bindgen_ty_5 {
        pub pathname: __u64,
        pub bpf_fd: __u32,
        pub file_flags: __u32,
        pub path_fd: __s32,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_5() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_5>(),
            24usize,
            concat!("Size of: ", stringify!(bpf_attr__bindgen_ty_5))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_5>(),
            8usize,
            concat!("Alignment of ", stringify!(bpf_attr__bindgen_ty_5))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_5>())).pathname as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_5),
                "::",
                stringify!(pathname)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_5>())).bpf_fd as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_5),
                "::",
                stringify!(bpf_fd)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_5>())).file_flags as *const _ as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_5),
                "::",
                stringify!(file_flags)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_5>())).path_fd as *const _ as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_5),
                "::",
                stringify!(path_fd)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_attr__bindgen_ty_6 {
        pub target_fd: __u32,
        pub attach_bpf_fd: __u32,
        pub attach_type: __u32,
        pub attach_flags: __u32,
        pub replace_bpf_fd: __u32,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_6() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_6>(),
            20usize,
            concat!("Size of: ", stringify!(bpf_attr__bindgen_ty_6))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_6>(),
            4usize,
            concat!("Alignment of ", stringify!(bpf_attr__bindgen_ty_6))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_6>())).target_fd as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_6),
                "::",
                stringify!(target_fd)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_6>())).attach_bpf_fd as *const _
                    as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_6),
                "::",
                stringify!(attach_bpf_fd)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_6>())).attach_type as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_6),
                "::",
                stringify!(attach_type)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_6>())).attach_flags as *const _
                    as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_6),
                "::",
                stringify!(attach_flags)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_6>())).replace_bpf_fd as *const _
                    as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_6),
                "::",
                stringify!(replace_bpf_fd)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_attr__bindgen_ty_7 {
        pub prog_fd: __u32,
        pub retval: __u32,
        pub data_size_in: __u32,
        pub data_size_out: __u32,
        pub data_in: __u64,
        pub data_out: __u64,
        pub repeat: __u32,
        pub duration: __u32,
        pub ctx_size_in: __u32,
        pub ctx_size_out: __u32,
        pub ctx_in: __u64,
        pub ctx_out: __u64,
        pub flags: __u32,
        pub cpu: __u32,
        pub batch_size: __u32,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_7() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_7>(),
            80usize,
            concat!("Size of: ", stringify!(bpf_attr__bindgen_ty_7))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_7>(),
            8usize,
            concat!("Alignment of ", stringify!(bpf_attr__bindgen_ty_7))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_7>())).prog_fd as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_7),
                "::",
                stringify!(prog_fd)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_7>())).retval as *const _ as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_7),
                "::",
                stringify!(retval)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_7>())).data_size_in as *const _
                    as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_7),
                "::",
                stringify!(data_size_in)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_7>())).data_size_out as *const _
                    as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_7),
                "::",
                stringify!(data_size_out)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_7>())).data_in as *const _ as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_7),
                "::",
                stringify!(data_in)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_7>())).data_out as *const _ as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_7),
                "::",
                stringify!(data_out)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_7>())).repeat as *const _ as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_7),
                "::",
                stringify!(repeat)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_7>())).duration as *const _ as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_7),
                "::",
                stringify!(duration)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_7>())).ctx_size_in as *const _ as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_7),
                "::",
                stringify!(ctx_size_in)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_7>())).ctx_size_out as *const _
                    as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_7),
                "::",
                stringify!(ctx_size_out)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_7>())).ctx_in as *const _ as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_7),
                "::",
                stringify!(ctx_in)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_7>())).ctx_out as *const _ as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_7),
                "::",
                stringify!(ctx_out)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_7>())).flags as *const _ as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_7),
                "::",
                stringify!(flags)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_attr__bindgen_ty_7>())).cpu as *const _ as usize },
            68usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_7),
                "::",
                stringify!(cpu)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_7>())).batch_size as *const _ as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_7),
                "::",
                stringify!(batch_size)
            )
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct bpf_attr__bindgen_ty_8 {
        pub __bindgen_anon_1: bpf_attr__bindgen_ty_8__bindgen_ty_1,
        pub next_id: __u32,
        pub open_flags: __u32,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union bpf_attr__bindgen_ty_8__bindgen_ty_1 {
        pub start_id: __u32,
        pub prog_id: __u32,
        pub map_id: __u32,
        pub btf_id: __u32,
        pub link_id: __u32,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_8__bindgen_ty_1() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_8__bindgen_ty_1>(),
            4usize,
            concat!(
                "Size of: ",
                stringify!(bpf_attr__bindgen_ty_8__bindgen_ty_1)
            )
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_8__bindgen_ty_1>(),
            4usize,
            concat!(
                "Alignment of ",
                stringify!(bpf_attr__bindgen_ty_8__bindgen_ty_1)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_8__bindgen_ty_1>())).start_id
                    as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_8__bindgen_ty_1),
                "::",
                stringify!(start_id)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_8__bindgen_ty_1>())).prog_id
                    as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_8__bindgen_ty_1),
                "::",
                stringify!(prog_id)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_8__bindgen_ty_1>())).map_id as *const _
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_8__bindgen_ty_1),
                "::",
                stringify!(map_id)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_8__bindgen_ty_1>())).btf_id as *const _
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_8__bindgen_ty_1),
                "::",
                stringify!(btf_id)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_8__bindgen_ty_1>())).link_id
                    as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_8__bindgen_ty_1),
                "::",
                stringify!(link_id)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_8() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_8>(),
            12usize,
            concat!("Size of: ", stringify!(bpf_attr__bindgen_ty_8))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_8>(),
            4usize,
            concat!("Alignment of ", stringify!(bpf_attr__bindgen_ty_8))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_8>())).next_id as *const _ as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_8),
                "::",
                stringify!(next_id)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_8>())).open_flags as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_8),
                "::",
                stringify!(open_flags)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_attr__bindgen_ty_9 {
        pub bpf_fd: __u32,
        pub info_len: __u32,
        pub info: __u64,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_9() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_9>(),
            16usize,
            concat!("Size of: ", stringify!(bpf_attr__bindgen_ty_9))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_9>(),
            8usize,
            concat!("Alignment of ", stringify!(bpf_attr__bindgen_ty_9))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_9>())).bpf_fd as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_9),
                "::",
                stringify!(bpf_fd)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_9>())).info_len as *const _ as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_9),
                "::",
                stringify!(info_len)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_9>())).info as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_9),
                "::",
                stringify!(info)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_attr__bindgen_ty_10 {
        pub target_fd: __u32,
        pub attach_type: __u32,
        pub query_flags: __u32,
        pub attach_flags: __u32,
        pub prog_ids: __u64,
        pub prog_cnt: __u32,
        pub prog_attach_flags: __u64,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_10() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_10>(),
            40usize,
            concat!("Size of: ", stringify!(bpf_attr__bindgen_ty_10))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_10>(),
            8usize,
            concat!("Alignment of ", stringify!(bpf_attr__bindgen_ty_10))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_10>())).target_fd as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_10),
                "::",
                stringify!(target_fd)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_10>())).attach_type as *const _
                    as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_10),
                "::",
                stringify!(attach_type)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_10>())).query_flags as *const _
                    as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_10),
                "::",
                stringify!(query_flags)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_10>())).attach_flags as *const _
                    as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_10),
                "::",
                stringify!(attach_flags)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_10>())).prog_ids as *const _ as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_10),
                "::",
                stringify!(prog_ids)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_10>())).prog_cnt as *const _ as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_10),
                "::",
                stringify!(prog_cnt)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_10>())).prog_attach_flags as *const _
                    as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_10),
                "::",
                stringify!(prog_attach_flags)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_attr__bindgen_ty_11 {
        pub name: __u64,
        pub prog_fd: __u32,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_11() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_11>(),
            16usize,
            concat!("Size of: ", stringify!(bpf_attr__bindgen_ty_11))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_11>(),
            8usize,
            concat!("Alignment of ", stringify!(bpf_attr__bindgen_ty_11))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_11>())).name as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_11),
                "::",
                stringify!(name)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_11>())).prog_fd as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_11),
                "::",
                stringify!(prog_fd)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_attr__bindgen_ty_12 {
        pub btf: __u64,
        pub btf_log_buf: __u64,
        pub btf_size: __u32,
        pub btf_log_size: __u32,
        pub btf_log_level: __u32,
        pub btf_log_true_size: __u32,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_12() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_12>(),
            32usize,
            concat!("Size of: ", stringify!(bpf_attr__bindgen_ty_12))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_12>(),
            8usize,
            concat!("Alignment of ", stringify!(bpf_attr__bindgen_ty_12))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_12>())).btf as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_12),
                "::",
                stringify!(btf)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_12>())).btf_log_buf as *const _
                    as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_12),
                "::",
                stringify!(btf_log_buf)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_12>())).btf_size as *const _ as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_12),
                "::",
                stringify!(btf_size)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_12>())).btf_log_size as *const _
                    as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_12),
                "::",
                stringify!(btf_log_size)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_12>())).btf_log_level as *const _
                    as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_12),
                "::",
                stringify!(btf_log_level)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_12>())).btf_log_true_size as *const _
                    as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_12),
                "::",
                stringify!(btf_log_true_size)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_attr__bindgen_ty_13 {
        pub pid: __u32,
        pub fd: __u32,
        pub flags: __u32,
        pub buf_len: __u32,
        pub buf: __u64,
        pub prog_id: __u32,
        pub fd_type: __u32,
        pub probe_offset: __u64,
        pub probe_addr: __u64,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_13() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_13>(),
            48usize,
            concat!("Size of: ", stringify!(bpf_attr__bindgen_ty_13))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_13>(),
            8usize,
            concat!("Alignment of ", stringify!(bpf_attr__bindgen_ty_13))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_13>())).pid as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_13),
                "::",
                stringify!(pid)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_attr__bindgen_ty_13>())).fd as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_13),
                "::",
                stringify!(fd)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_13>())).flags as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_13),
                "::",
                stringify!(flags)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_13>())).buf_len as *const _ as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_13),
                "::",
                stringify!(buf_len)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_13>())).buf as *const _ as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_13),
                "::",
                stringify!(buf)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_13>())).prog_id as *const _ as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_13),
                "::",
                stringify!(prog_id)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_13>())).fd_type as *const _ as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_13),
                "::",
                stringify!(fd_type)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_13>())).probe_offset as *const _
                    as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_13),
                "::",
                stringify!(probe_offset)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_13>())).probe_addr as *const _ as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_13),
                "::",
                stringify!(probe_addr)
            )
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct bpf_attr__bindgen_ty_14 {
        pub __bindgen_anon_1: bpf_attr__bindgen_ty_14__bindgen_ty_1,
        pub __bindgen_anon_2: bpf_attr__bindgen_ty_14__bindgen_ty_2,
        pub attach_type: __u32,
        pub flags: __u32,
        pub __bindgen_anon_3: bpf_attr__bindgen_ty_14__bindgen_ty_3,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union bpf_attr__bindgen_ty_14__bindgen_ty_1 {
        pub prog_fd: __u32,
        pub map_fd: __u32,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_14__bindgen_ty_1() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_14__bindgen_ty_1>(),
            4usize,
            concat!(
                "Size of: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_1)
            )
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_14__bindgen_ty_1>(),
            4usize,
            concat!(
                "Alignment of ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_1)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14__bindgen_ty_1>())).prog_fd
                    as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_1),
                "::",
                stringify!(prog_fd)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14__bindgen_ty_1>())).map_fd
                    as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_1),
                "::",
                stringify!(map_fd)
            )
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union bpf_attr__bindgen_ty_14__bindgen_ty_2 {
        pub target_fd: __u32,
        pub target_ifindex: __u32,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_14__bindgen_ty_2() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_14__bindgen_ty_2>(),
            4usize,
            concat!(
                "Size of: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_2)
            )
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_14__bindgen_ty_2>(),
            4usize,
            concat!(
                "Alignment of ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_2)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14__bindgen_ty_2>())).target_fd
                    as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_2),
                "::",
                stringify!(target_fd)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14__bindgen_ty_2>())).target_ifindex
                    as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_2),
                "::",
                stringify!(target_ifindex)
            )
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union bpf_attr__bindgen_ty_14__bindgen_ty_3 {
        pub target_btf_id: __u32,
        pub __bindgen_anon_1: bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_1,
        pub perf_event: bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_2,
        pub kprobe_multi: bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_3,
        pub tracing: bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_4,
        pub netfilter: bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_5,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_1 {
        pub iter_info: __u64,
        pub iter_info_len: __u32,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_1() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_1>(),
            16usize,
            concat!(
                "Size of: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_1)
            )
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_1>(),
            8usize,
            concat!(
                "Alignment of ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_1)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_1>()))
                    .iter_info as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_1),
                "::",
                stringify!(iter_info)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_1>()))
                    .iter_info_len as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_1),
                "::",
                stringify!(iter_info_len)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_2 {
        pub bpf_cookie: __u64,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_2() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_2>(),
            8usize,
            concat!(
                "Size of: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_2)
            )
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_2>(),
            8usize,
            concat!(
                "Alignment of ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_2)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_2>()))
                    .bpf_cookie as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_2),
                "::",
                stringify!(bpf_cookie)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_3 {
        pub flags: __u32,
        pub cnt: __u32,
        pub syms: __u64,
        pub addrs: __u64,
        pub cookies: __u64,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_3() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_3>(),
            32usize,
            concat!(
                "Size of: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_3)
            )
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_3>(),
            8usize,
            concat!(
                "Alignment of ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_3)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_3>()))
                    .flags as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_3),
                "::",
                stringify!(flags)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_3>())).cnt
                    as *const _ as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_3),
                "::",
                stringify!(cnt)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_3>()))
                    .syms as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_3),
                "::",
                stringify!(syms)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_3>()))
                    .addrs as *const _ as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_3),
                "::",
                stringify!(addrs)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_3>()))
                    .cookies as *const _ as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_3),
                "::",
                stringify!(cookies)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_4 {
        pub target_btf_id: __u32,
        pub cookie: __u64,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_4() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_4>(),
            16usize,
            concat!(
                "Size of: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_4)
            )
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_4>(),
            8usize,
            concat!(
                "Alignment of ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_4)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_4>()))
                    .target_btf_id as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_4),
                "::",
                stringify!(target_btf_id)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_4>()))
                    .cookie as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_4),
                "::",
                stringify!(cookie)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_5 {
        pub pf: __u32,
        pub hooknum: __u32,
        pub priority: __s32,
        pub flags: __u32,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_5() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_5>(),
            16usize,
            concat!(
                "Size of: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_5)
            )
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_5>(),
            4usize,
            concat!(
                "Alignment of ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_5)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_5>())).pf
                    as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_5),
                "::",
                stringify!(pf)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_5>()))
                    .hooknum as *const _ as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_5),
                "::",
                stringify!(hooknum)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_5>()))
                    .priority as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_5),
                "::",
                stringify!(priority)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_5>()))
                    .flags as *const _ as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3__bindgen_ty_5),
                "::",
                stringify!(flags)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_14__bindgen_ty_3() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_14__bindgen_ty_3>(),
            32usize,
            concat!(
                "Size of: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3)
            )
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_14__bindgen_ty_3>(),
            8usize,
            concat!(
                "Alignment of ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14__bindgen_ty_3>())).target_btf_id
                    as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3),
                "::",
                stringify!(target_btf_id)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14__bindgen_ty_3>())).perf_event
                    as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3),
                "::",
                stringify!(perf_event)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14__bindgen_ty_3>())).kprobe_multi
                    as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3),
                "::",
                stringify!(kprobe_multi)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14__bindgen_ty_3>())).tracing
                    as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3),
                "::",
                stringify!(tracing)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14__bindgen_ty_3>())).netfilter
                    as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14__bindgen_ty_3),
                "::",
                stringify!(netfilter)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_14() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_14>(),
            48usize,
            concat!("Size of: ", stringify!(bpf_attr__bindgen_ty_14))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_14>(),
            8usize,
            concat!("Alignment of ", stringify!(bpf_attr__bindgen_ty_14))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14>())).attach_type as *const _
                    as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14),
                "::",
                stringify!(attach_type)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_14>())).flags as *const _ as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_14),
                "::",
                stringify!(flags)
            )
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct bpf_attr__bindgen_ty_15 {
        pub link_fd: __u32,
        pub __bindgen_anon_1: bpf_attr__bindgen_ty_15__bindgen_ty_1,
        pub flags: __u32,
        pub __bindgen_anon_2: bpf_attr__bindgen_ty_15__bindgen_ty_2,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union bpf_attr__bindgen_ty_15__bindgen_ty_1 {
        pub new_prog_fd: __u32,
        pub new_map_fd: __u32,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_15__bindgen_ty_1() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_15__bindgen_ty_1>(),
            4usize,
            concat!(
                "Size of: ",
                stringify!(bpf_attr__bindgen_ty_15__bindgen_ty_1)
            )
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_15__bindgen_ty_1>(),
            4usize,
            concat!(
                "Alignment of ",
                stringify!(bpf_attr__bindgen_ty_15__bindgen_ty_1)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_15__bindgen_ty_1>())).new_prog_fd
                    as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_15__bindgen_ty_1),
                "::",
                stringify!(new_prog_fd)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_15__bindgen_ty_1>())).new_map_fd
                    as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_15__bindgen_ty_1),
                "::",
                stringify!(new_map_fd)
            )
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union bpf_attr__bindgen_ty_15__bindgen_ty_2 {
        pub old_prog_fd: __u32,
        pub old_map_fd: __u32,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_15__bindgen_ty_2() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_15__bindgen_ty_2>(),
            4usize,
            concat!(
                "Size of: ",
                stringify!(bpf_attr__bindgen_ty_15__bindgen_ty_2)
            )
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_15__bindgen_ty_2>(),
            4usize,
            concat!(
                "Alignment of ",
                stringify!(bpf_attr__bindgen_ty_15__bindgen_ty_2)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_15__bindgen_ty_2>())).old_prog_fd
                    as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_15__bindgen_ty_2),
                "::",
                stringify!(old_prog_fd)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_15__bindgen_ty_2>())).old_map_fd
                    as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_15__bindgen_ty_2),
                "::",
                stringify!(old_map_fd)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_15() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_15>(),
            16usize,
            concat!("Size of: ", stringify!(bpf_attr__bindgen_ty_15))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_15>(),
            4usize,
            concat!("Alignment of ", stringify!(bpf_attr__bindgen_ty_15))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_15>())).link_fd as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_15),
                "::",
                stringify!(link_fd)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_15>())).flags as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_15),
                "::",
                stringify!(flags)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_attr__bindgen_ty_16 {
        pub link_fd: __u32,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_16() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_16>(),
            4usize,
            concat!("Size of: ", stringify!(bpf_attr__bindgen_ty_16))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_16>(),
            4usize,
            concat!("Alignment of ", stringify!(bpf_attr__bindgen_ty_16))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_16>())).link_fd as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_16),
                "::",
                stringify!(link_fd)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_attr__bindgen_ty_17 {
        pub type_: __u32,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_17() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_17>(),
            4usize,
            concat!("Size of: ", stringify!(bpf_attr__bindgen_ty_17))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_17>(),
            4usize,
            concat!("Alignment of ", stringify!(bpf_attr__bindgen_ty_17))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_17>())).type_ as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_17),
                "::",
                stringify!(type_)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_attr__bindgen_ty_18 {
        pub link_fd: __u32,
        pub flags: __u32,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_18() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_18>(),
            8usize,
            concat!("Size of: ", stringify!(bpf_attr__bindgen_ty_18))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_18>(),
            4usize,
            concat!("Alignment of ", stringify!(bpf_attr__bindgen_ty_18))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_18>())).link_fd as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_18),
                "::",
                stringify!(link_fd)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_18>())).flags as *const _ as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_18),
                "::",
                stringify!(flags)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_attr__bindgen_ty_19 {
        pub prog_fd: __u32,
        pub map_fd: __u32,
        pub flags: __u32,
    }
    #[test]
    fn bindgen_test_layout_bpf_attr__bindgen_ty_19() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr__bindgen_ty_19>(),
            12usize,
            concat!("Size of: ", stringify!(bpf_attr__bindgen_ty_19))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr__bindgen_ty_19>(),
            4usize,
            concat!("Alignment of ", stringify!(bpf_attr__bindgen_ty_19))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_19>())).prog_fd as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_19),
                "::",
                stringify!(prog_fd)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_19>())).map_fd as *const _ as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_19),
                "::",
                stringify!(map_fd)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_attr__bindgen_ty_19>())).flags as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr__bindgen_ty_19),
                "::",
                stringify!(flags)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_bpf_attr() {
        assert_eq!(
            ::core::mem::size_of::<bpf_attr>(),
            144usize,
            concat!("Size of: ", stringify!(bpf_attr))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_attr>(),
            8usize,
            concat!("Alignment of ", stringify!(bpf_attr))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_attr>())).batch as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr),
                "::",
                stringify!(batch)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_attr>())).test as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr),
                "::",
                stringify!(test)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_attr>())).info as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr),
                "::",
                stringify!(info)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_attr>())).query as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr),
                "::",
                stringify!(query)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_attr>())).raw_tracepoint as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr),
                "::",
                stringify!(raw_tracepoint)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_attr>())).task_fd_query as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr),
                "::",
                stringify!(task_fd_query)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_attr>())).link_create as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr),
                "::",
                stringify!(link_create)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_attr>())).link_update as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr),
                "::",
                stringify!(link_update)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_attr>())).link_detach as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr),
                "::",
                stringify!(link_detach)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_attr>())).enable_stats as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr),
                "::",
                stringify!(enable_stats)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_attr>())).iter_create as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr),
                "::",
                stringify!(iter_create)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_attr>())).prog_bind_map as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_attr),
                "::",
                stringify!(prog_bind_map)
            )
        );
    }
    pub const bpf_func_id_BPF_FUNC_unspec: bpf_func_id = 0;
    pub const bpf_func_id_BPF_FUNC_map_lookup_elem: bpf_func_id = 1;
    pub const bpf_func_id_BPF_FUNC_map_update_elem: bpf_func_id = 2;
    pub const bpf_func_id_BPF_FUNC_map_delete_elem: bpf_func_id = 3;
    pub const bpf_func_id_BPF_FUNC_probe_read: bpf_func_id = 4;
    pub const bpf_func_id_BPF_FUNC_ktime_get_ns: bpf_func_id = 5;
    pub const bpf_func_id_BPF_FUNC_trace_printk: bpf_func_id = 6;
    pub const bpf_func_id_BPF_FUNC_get_prandom_u32: bpf_func_id = 7;
    pub const bpf_func_id_BPF_FUNC_get_smp_processor_id: bpf_func_id = 8;
    pub const bpf_func_id_BPF_FUNC_skb_store_bytes: bpf_func_id = 9;
    pub const bpf_func_id_BPF_FUNC_l3_csum_replace: bpf_func_id = 10;
    pub const bpf_func_id_BPF_FUNC_l4_csum_replace: bpf_func_id = 11;
    pub const bpf_func_id_BPF_FUNC_tail_call: bpf_func_id = 12;
    pub const bpf_func_id_BPF_FUNC_clone_redirect: bpf_func_id = 13;
    pub const bpf_func_id_BPF_FUNC_get_current_pid_tgid: bpf_func_id = 14;
    pub const bpf_func_id_BPF_FUNC_get_current_uid_gid: bpf_func_id = 15;
    pub const bpf_func_id_BPF_FUNC_get_current_comm: bpf_func_id = 16;
    pub const bpf_func_id_BPF_FUNC_get_cgroup_classid: bpf_func_id = 17;
    pub const bpf_func_id_BPF_FUNC_skb_vlan_push: bpf_func_id = 18;
    pub const bpf_func_id_BPF_FUNC_skb_vlan_pop: bpf_func_id = 19;
    pub const bpf_func_id_BPF_FUNC_skb_get_tunnel_key: bpf_func_id = 20;
    pub const bpf_func_id_BPF_FUNC_skb_set_tunnel_key: bpf_func_id = 21;
    pub const bpf_func_id_BPF_FUNC_perf_event_read: bpf_func_id = 22;
    pub const bpf_func_id_BPF_FUNC_redirect: bpf_func_id = 23;
    pub const bpf_func_id_BPF_FUNC_get_route_realm: bpf_func_id = 24;
    pub const bpf_func_id_BPF_FUNC_perf_event_output: bpf_func_id = 25;
    pub const bpf_func_id_BPF_FUNC_skb_load_bytes: bpf_func_id = 26;
    pub const bpf_func_id_BPF_FUNC_get_stackid: bpf_func_id = 27;
    pub const bpf_func_id_BPF_FUNC_csum_diff: bpf_func_id = 28;
    pub const bpf_func_id_BPF_FUNC_skb_get_tunnel_opt: bpf_func_id = 29;
    pub const bpf_func_id_BPF_FUNC_skb_set_tunnel_opt: bpf_func_id = 30;
    pub const bpf_func_id_BPF_FUNC_skb_change_proto: bpf_func_id = 31;
    pub const bpf_func_id_BPF_FUNC_skb_change_type: bpf_func_id = 32;
    pub const bpf_func_id_BPF_FUNC_skb_under_cgroup: bpf_func_id = 33;
    pub const bpf_func_id_BPF_FUNC_get_hash_recalc: bpf_func_id = 34;
    pub const bpf_func_id_BPF_FUNC_get_current_task: bpf_func_id = 35;
    pub const bpf_func_id_BPF_FUNC_probe_write_user: bpf_func_id = 36;
    pub const bpf_func_id_BPF_FUNC_current_task_under_cgroup: bpf_func_id = 37;
    pub const bpf_func_id_BPF_FUNC_skb_change_tail: bpf_func_id = 38;
    pub const bpf_func_id_BPF_FUNC_skb_pull_data: bpf_func_id = 39;
    pub const bpf_func_id_BPF_FUNC_csum_update: bpf_func_id = 40;
    pub const bpf_func_id_BPF_FUNC_set_hash_invalid: bpf_func_id = 41;
    pub const bpf_func_id_BPF_FUNC_get_numa_node_id: bpf_func_id = 42;
    pub const bpf_func_id_BPF_FUNC_skb_change_head: bpf_func_id = 43;
    pub const bpf_func_id_BPF_FUNC_xdp_adjust_head: bpf_func_id = 44;
    pub const bpf_func_id_BPF_FUNC_probe_read_str: bpf_func_id = 45;
    pub const bpf_func_id_BPF_FUNC_get_socket_cookie: bpf_func_id = 46;
    pub const bpf_func_id_BPF_FUNC_get_socket_uid: bpf_func_id = 47;
    pub const bpf_func_id_BPF_FUNC_set_hash: bpf_func_id = 48;
    pub const bpf_func_id_BPF_FUNC_setsockopt: bpf_func_id = 49;
    pub const bpf_func_id_BPF_FUNC_skb_adjust_room: bpf_func_id = 50;
    pub const bpf_func_id_BPF_FUNC_redirect_map: bpf_func_id = 51;
    pub const bpf_func_id_BPF_FUNC_sk_redirect_map: bpf_func_id = 52;
    pub const bpf_func_id_BPF_FUNC_sock_map_update: bpf_func_id = 53;
    pub const bpf_func_id_BPF_FUNC_xdp_adjust_meta: bpf_func_id = 54;
    pub const bpf_func_id_BPF_FUNC_perf_event_read_value: bpf_func_id = 55;
    pub const bpf_func_id_BPF_FUNC_perf_prog_read_value: bpf_func_id = 56;
    pub const bpf_func_id_BPF_FUNC_getsockopt: bpf_func_id = 57;
    pub const bpf_func_id_BPF_FUNC_override_return: bpf_func_id = 58;
    pub const bpf_func_id_BPF_FUNC_sock_ops_cb_flags_set: bpf_func_id = 59;
    pub const bpf_func_id_BPF_FUNC_msg_redirect_map: bpf_func_id = 60;
    pub const bpf_func_id_BPF_FUNC_msg_apply_bytes: bpf_func_id = 61;
    pub const bpf_func_id_BPF_FUNC_msg_cork_bytes: bpf_func_id = 62;
    pub const bpf_func_id_BPF_FUNC_msg_pull_data: bpf_func_id = 63;
    pub const bpf_func_id_BPF_FUNC_bind: bpf_func_id = 64;
    pub const bpf_func_id_BPF_FUNC_xdp_adjust_tail: bpf_func_id = 65;
    pub const bpf_func_id_BPF_FUNC_skb_get_xfrm_state: bpf_func_id = 66;
    pub const bpf_func_id_BPF_FUNC_get_stack: bpf_func_id = 67;
    pub const bpf_func_id_BPF_FUNC_skb_load_bytes_relative: bpf_func_id = 68;
    pub const bpf_func_id_BPF_FUNC_fib_lookup: bpf_func_id = 69;
    pub const bpf_func_id_BPF_FUNC_sock_hash_update: bpf_func_id = 70;
    pub const bpf_func_id_BPF_FUNC_msg_redirect_hash: bpf_func_id = 71;
    pub const bpf_func_id_BPF_FUNC_sk_redirect_hash: bpf_func_id = 72;
    pub const bpf_func_id_BPF_FUNC_lwt_push_encap: bpf_func_id = 73;
    pub const bpf_func_id_BPF_FUNC_lwt_seg6_store_bytes: bpf_func_id = 74;
    pub const bpf_func_id_BPF_FUNC_lwt_seg6_adjust_srh: bpf_func_id = 75;
    pub const bpf_func_id_BPF_FUNC_lwt_seg6_action: bpf_func_id = 76;
    pub const bpf_func_id_BPF_FUNC_rc_repeat: bpf_func_id = 77;
    pub const bpf_func_id_BPF_FUNC_rc_keydown: bpf_func_id = 78;
    pub const bpf_func_id_BPF_FUNC_skb_cgroup_id: bpf_func_id = 79;
    pub const bpf_func_id_BPF_FUNC_get_current_cgroup_id: bpf_func_id = 80;
    pub const bpf_func_id_BPF_FUNC_get_local_storage: bpf_func_id = 81;
    pub const bpf_func_id_BPF_FUNC_sk_select_reuseport: bpf_func_id = 82;
    pub const bpf_func_id_BPF_FUNC_skb_ancestor_cgroup_id: bpf_func_id = 83;
    pub const bpf_func_id_BPF_FUNC_sk_lookup_tcp: bpf_func_id = 84;
    pub const bpf_func_id_BPF_FUNC_sk_lookup_udp: bpf_func_id = 85;
    pub const bpf_func_id_BPF_FUNC_sk_release: bpf_func_id = 86;
    pub const bpf_func_id_BPF_FUNC_map_push_elem: bpf_func_id = 87;
    pub const bpf_func_id_BPF_FUNC_map_pop_elem: bpf_func_id = 88;
    pub const bpf_func_id_BPF_FUNC_map_peek_elem: bpf_func_id = 89;
    pub const bpf_func_id_BPF_FUNC_msg_push_data: bpf_func_id = 90;
    pub const bpf_func_id_BPF_FUNC_msg_pop_data: bpf_func_id = 91;
    pub const bpf_func_id_BPF_FUNC_rc_pointer_rel: bpf_func_id = 92;
    pub const bpf_func_id_BPF_FUNC_spin_lock: bpf_func_id = 93;
    pub const bpf_func_id_BPF_FUNC_spin_unlock: bpf_func_id = 94;
    pub const bpf_func_id_BPF_FUNC_sk_fullsock: bpf_func_id = 95;
    pub const bpf_func_id_BPF_FUNC_tcp_sock: bpf_func_id = 96;
    pub const bpf_func_id_BPF_FUNC_skb_ecn_set_ce: bpf_func_id = 97;
    pub const bpf_func_id_BPF_FUNC_get_listener_sock: bpf_func_id = 98;
    pub const bpf_func_id_BPF_FUNC_skc_lookup_tcp: bpf_func_id = 99;
    pub const bpf_func_id_BPF_FUNC_tcp_check_syncookie: bpf_func_id = 100;
    pub const bpf_func_id_BPF_FUNC_sysctl_get_name: bpf_func_id = 101;
    pub const bpf_func_id_BPF_FUNC_sysctl_get_current_value: bpf_func_id = 102;
    pub const bpf_func_id_BPF_FUNC_sysctl_get_new_value: bpf_func_id = 103;
    pub const bpf_func_id_BPF_FUNC_sysctl_set_new_value: bpf_func_id = 104;
    pub const bpf_func_id_BPF_FUNC_strtol: bpf_func_id = 105;
    pub const bpf_func_id_BPF_FUNC_strtoul: bpf_func_id = 106;
    pub const bpf_func_id_BPF_FUNC_sk_storage_get: bpf_func_id = 107;
    pub const bpf_func_id_BPF_FUNC_sk_storage_delete: bpf_func_id = 108;
    pub const bpf_func_id_BPF_FUNC_send_signal: bpf_func_id = 109;
    pub const bpf_func_id_BPF_FUNC_tcp_gen_syncookie: bpf_func_id = 110;
    pub const bpf_func_id_BPF_FUNC_skb_output: bpf_func_id = 111;
    pub const bpf_func_id_BPF_FUNC_probe_read_user: bpf_func_id = 112;
    pub const bpf_func_id_BPF_FUNC_probe_read_kernel: bpf_func_id = 113;
    pub const bpf_func_id_BPF_FUNC_probe_read_user_str: bpf_func_id = 114;
    pub const bpf_func_id_BPF_FUNC_probe_read_kernel_str: bpf_func_id = 115;
    pub const bpf_func_id_BPF_FUNC_tcp_send_ack: bpf_func_id = 116;
    pub const bpf_func_id_BPF_FUNC_send_signal_thread: bpf_func_id = 117;
    pub const bpf_func_id_BPF_FUNC_jiffies64: bpf_func_id = 118;
    pub const bpf_func_id_BPF_FUNC_read_branch_records: bpf_func_id = 119;
    pub const bpf_func_id_BPF_FUNC_get_ns_current_pid_tgid: bpf_func_id = 120;
    pub const bpf_func_id_BPF_FUNC_xdp_output: bpf_func_id = 121;
    pub const bpf_func_id_BPF_FUNC_get_netns_cookie: bpf_func_id = 122;
    pub const bpf_func_id_BPF_FUNC_get_current_ancestor_cgroup_id: bpf_func_id = 123;
    pub const bpf_func_id_BPF_FUNC_sk_assign: bpf_func_id = 124;
    pub const bpf_func_id_BPF_FUNC_ktime_get_boot_ns: bpf_func_id = 125;
    pub const bpf_func_id_BPF_FUNC_seq_printf: bpf_func_id = 126;
    pub const bpf_func_id_BPF_FUNC_seq_write: bpf_func_id = 127;
    pub const bpf_func_id_BPF_FUNC_sk_cgroup_id: bpf_func_id = 128;
    pub const bpf_func_id_BPF_FUNC_sk_ancestor_cgroup_id: bpf_func_id = 129;
    pub const bpf_func_id_BPF_FUNC_ringbuf_output: bpf_func_id = 130;
    pub const bpf_func_id_BPF_FUNC_ringbuf_reserve: bpf_func_id = 131;
    pub const bpf_func_id_BPF_FUNC_ringbuf_submit: bpf_func_id = 132;
    pub const bpf_func_id_BPF_FUNC_ringbuf_discard: bpf_func_id = 133;
    pub const bpf_func_id_BPF_FUNC_ringbuf_query: bpf_func_id = 134;
    pub const bpf_func_id_BPF_FUNC_csum_level: bpf_func_id = 135;
    pub const bpf_func_id_BPF_FUNC_skc_to_tcp6_sock: bpf_func_id = 136;
    pub const bpf_func_id_BPF_FUNC_skc_to_tcp_sock: bpf_func_id = 137;
    pub const bpf_func_id_BPF_FUNC_skc_to_tcp_timewait_sock: bpf_func_id = 138;
    pub const bpf_func_id_BPF_FUNC_skc_to_tcp_request_sock: bpf_func_id = 139;
    pub const bpf_func_id_BPF_FUNC_skc_to_udp6_sock: bpf_func_id = 140;
    pub const bpf_func_id_BPF_FUNC_get_task_stack: bpf_func_id = 141;
    pub const bpf_func_id_BPF_FUNC_load_hdr_opt: bpf_func_id = 142;
    pub const bpf_func_id_BPF_FUNC_store_hdr_opt: bpf_func_id = 143;
    pub const bpf_func_id_BPF_FUNC_reserve_hdr_opt: bpf_func_id = 144;
    pub const bpf_func_id_BPF_FUNC_inode_storage_get: bpf_func_id = 145;
    pub const bpf_func_id_BPF_FUNC_inode_storage_delete: bpf_func_id = 146;
    pub const bpf_func_id_BPF_FUNC_d_path: bpf_func_id = 147;
    pub const bpf_func_id_BPF_FUNC_copy_from_user: bpf_func_id = 148;
    pub const bpf_func_id_BPF_FUNC_snprintf_btf: bpf_func_id = 149;
    pub const bpf_func_id_BPF_FUNC_seq_printf_btf: bpf_func_id = 150;
    pub const bpf_func_id_BPF_FUNC_skb_cgroup_classid: bpf_func_id = 151;
    pub const bpf_func_id_BPF_FUNC_redirect_neigh: bpf_func_id = 152;
    pub const bpf_func_id_BPF_FUNC_per_cpu_ptr: bpf_func_id = 153;
    pub const bpf_func_id_BPF_FUNC_this_cpu_ptr: bpf_func_id = 154;
    pub const bpf_func_id_BPF_FUNC_redirect_peer: bpf_func_id = 155;
    pub const bpf_func_id_BPF_FUNC_task_storage_get: bpf_func_id = 156;
    pub const bpf_func_id_BPF_FUNC_task_storage_delete: bpf_func_id = 157;
    pub const bpf_func_id_BPF_FUNC_get_current_task_btf: bpf_func_id = 158;
    pub const bpf_func_id_BPF_FUNC_bprm_opts_set: bpf_func_id = 159;
    pub const bpf_func_id_BPF_FUNC_ktime_get_coarse_ns: bpf_func_id = 160;
    pub const bpf_func_id_BPF_FUNC_ima_inode_hash: bpf_func_id = 161;
    pub const bpf_func_id_BPF_FUNC_sock_from_file: bpf_func_id = 162;
    pub const bpf_func_id_BPF_FUNC_check_mtu: bpf_func_id = 163;
    pub const bpf_func_id_BPF_FUNC_for_each_map_elem: bpf_func_id = 164;
    pub const bpf_func_id_BPF_FUNC_snprintf: bpf_func_id = 165;
    pub const bpf_func_id_BPF_FUNC_sys_bpf: bpf_func_id = 166;
    pub const bpf_func_id_BPF_FUNC_btf_find_by_name_kind: bpf_func_id = 167;
    pub const bpf_func_id_BPF_FUNC_sys_close: bpf_func_id = 168;
    pub const bpf_func_id_BPF_FUNC_timer_init: bpf_func_id = 169;
    pub const bpf_func_id_BPF_FUNC_timer_set_callback: bpf_func_id = 170;
    pub const bpf_func_id_BPF_FUNC_timer_start: bpf_func_id = 171;
    pub const bpf_func_id_BPF_FUNC_timer_cancel: bpf_func_id = 172;
    pub const bpf_func_id_BPF_FUNC_get_func_ip: bpf_func_id = 173;
    pub const bpf_func_id_BPF_FUNC_get_attach_cookie: bpf_func_id = 174;
    pub const bpf_func_id_BPF_FUNC_task_pt_regs: bpf_func_id = 175;
    pub const bpf_func_id_BPF_FUNC_get_branch_snapshot: bpf_func_id = 176;
    pub const bpf_func_id_BPF_FUNC_trace_vprintk: bpf_func_id = 177;
    pub const bpf_func_id_BPF_FUNC_skc_to_unix_sock: bpf_func_id = 178;
    pub const bpf_func_id_BPF_FUNC_kallsyms_lookup_name: bpf_func_id = 179;
    pub const bpf_func_id_BPF_FUNC_find_vma: bpf_func_id = 180;
    pub const bpf_func_id_BPF_FUNC_loop: bpf_func_id = 181;
    pub const bpf_func_id_BPF_FUNC_strncmp: bpf_func_id = 182;
    pub const bpf_func_id_BPF_FUNC_get_func_arg: bpf_func_id = 183;
    pub const bpf_func_id_BPF_FUNC_get_func_ret: bpf_func_id = 184;
    pub const bpf_func_id_BPF_FUNC_get_func_arg_cnt: bpf_func_id = 185;
    pub const bpf_func_id_BPF_FUNC_get_retval: bpf_func_id = 186;
    pub const bpf_func_id_BPF_FUNC_set_retval: bpf_func_id = 187;
    pub const bpf_func_id_BPF_FUNC_xdp_get_buff_len: bpf_func_id = 188;
    pub const bpf_func_id_BPF_FUNC_xdp_load_bytes: bpf_func_id = 189;
    pub const bpf_func_id_BPF_FUNC_xdp_store_bytes: bpf_func_id = 190;
    pub const bpf_func_id_BPF_FUNC_copy_from_user_task: bpf_func_id = 191;
    pub const bpf_func_id_BPF_FUNC_skb_set_tstamp: bpf_func_id = 192;
    pub const bpf_func_id_BPF_FUNC_ima_file_hash: bpf_func_id = 193;
    pub const bpf_func_id_BPF_FUNC_kptr_xchg: bpf_func_id = 194;
    pub const bpf_func_id_BPF_FUNC_map_lookup_percpu_elem: bpf_func_id = 195;
    pub const bpf_func_id_BPF_FUNC_skc_to_mptcp_sock: bpf_func_id = 196;
    pub const bpf_func_id_BPF_FUNC_dynptr_from_mem: bpf_func_id = 197;
    pub const bpf_func_id_BPF_FUNC_ringbuf_reserve_dynptr: bpf_func_id = 198;
    pub const bpf_func_id_BPF_FUNC_ringbuf_submit_dynptr: bpf_func_id = 199;
    pub const bpf_func_id_BPF_FUNC_ringbuf_discard_dynptr: bpf_func_id = 200;
    pub const bpf_func_id_BPF_FUNC_dynptr_read: bpf_func_id = 201;
    pub const bpf_func_id_BPF_FUNC_dynptr_write: bpf_func_id = 202;
    pub const bpf_func_id_BPF_FUNC_dynptr_data: bpf_func_id = 203;
    pub const bpf_func_id_BPF_FUNC_tcp_raw_gen_syncookie_ipv4: bpf_func_id = 204;
    pub const bpf_func_id_BPF_FUNC_tcp_raw_gen_syncookie_ipv6: bpf_func_id = 205;
    pub const bpf_func_id_BPF_FUNC_tcp_raw_check_syncookie_ipv4: bpf_func_id = 206;
    pub const bpf_func_id_BPF_FUNC_tcp_raw_check_syncookie_ipv6: bpf_func_id = 207;
    pub const bpf_func_id_BPF_FUNC_ktime_get_tai_ns: bpf_func_id = 208;
    pub const bpf_func_id_BPF_FUNC_user_ringbuf_drain: bpf_func_id = 209;
    pub const bpf_func_id_BPF_FUNC_cgrp_storage_get: bpf_func_id = 210;
    pub const bpf_func_id_BPF_FUNC_cgrp_storage_delete: bpf_func_id = 211;
    pub const bpf_func_id___BPF_FUNC_MAX_ID: bpf_func_id = 212;
    pub type bpf_func_id = ::cty::c_uint;
    pub const BPF_F_RECOMPUTE_CSUM: ::cty::c_uint = 1;
    pub const BPF_F_INVALIDATE_HASH: ::cty::c_uint = 2;
    pub type _bindgen_ty_8 = ::cty::c_uint;
    pub const BPF_F_HDR_FIELD_MASK: ::cty::c_uint = 15;
    pub type _bindgen_ty_9 = ::cty::c_uint;
    pub const BPF_F_PSEUDO_HDR: ::cty::c_uint = 16;
    pub const BPF_F_MARK_MANGLED_0: ::cty::c_uint = 32;
    pub const BPF_F_MARK_ENFORCE: ::cty::c_uint = 64;
    pub type _bindgen_ty_10 = ::cty::c_uint;
    pub const BPF_F_INGRESS: ::cty::c_uint = 1;
    pub type _bindgen_ty_11 = ::cty::c_uint;
    pub const BPF_F_TUNINFO_IPV6: ::cty::c_uint = 1;
    pub type _bindgen_ty_12 = ::cty::c_uint;
    pub const BPF_F_SKIP_FIELD_MASK: ::cty::c_uint = 255;
    pub const BPF_F_USER_STACK: ::cty::c_uint = 256;
    pub const BPF_F_FAST_STACK_CMP: ::cty::c_uint = 512;
    pub const BPF_F_REUSE_STACKID: ::cty::c_uint = 1024;
    pub const BPF_F_USER_BUILD_ID: ::cty::c_uint = 2048;
    pub type _bindgen_ty_13 = ::cty::c_uint;
    pub const BPF_F_ZERO_CSUM_TX: ::cty::c_uint = 2;
    pub const BPF_F_DONT_FRAGMENT: ::cty::c_uint = 4;
    pub const BPF_F_SEQ_NUMBER: ::cty::c_uint = 8;
    pub const BPF_F_NO_TUNNEL_KEY: ::cty::c_uint = 16;
    pub type _bindgen_ty_14 = ::cty::c_uint;
    pub const BPF_F_TUNINFO_FLAGS: ::cty::c_uint = 16;
    pub type _bindgen_ty_15 = ::cty::c_uint;
    pub const BPF_F_INDEX_MASK: ::cty::c_ulong = 4294967295;
    pub const BPF_F_CURRENT_CPU: ::cty::c_ulong = 4294967295;
    pub const BPF_F_CTXLEN_MASK: ::cty::c_ulong = 4503595332403200;
    pub type _bindgen_ty_16 = ::cty::c_ulong;
    pub const BPF_F_CURRENT_NETNS: ::cty::c_int = -1;
    pub type _bindgen_ty_17 = ::cty::c_int;
    pub const BPF_CSUM_LEVEL_QUERY: ::cty::c_uint = 0;
    pub const BPF_CSUM_LEVEL_INC: ::cty::c_uint = 1;
    pub const BPF_CSUM_LEVEL_DEC: ::cty::c_uint = 2;
    pub const BPF_CSUM_LEVEL_RESET: ::cty::c_uint = 3;
    pub type _bindgen_ty_18 = ::cty::c_uint;
    pub const BPF_F_ADJ_ROOM_FIXED_GSO: ::cty::c_uint = 1;
    pub const BPF_F_ADJ_ROOM_ENCAP_L3_IPV4: ::cty::c_uint = 2;
    pub const BPF_F_ADJ_ROOM_ENCAP_L3_IPV6: ::cty::c_uint = 4;
    pub const BPF_F_ADJ_ROOM_ENCAP_L4_GRE: ::cty::c_uint = 8;
    pub const BPF_F_ADJ_ROOM_ENCAP_L4_UDP: ::cty::c_uint = 16;
    pub const BPF_F_ADJ_ROOM_NO_CSUM_RESET: ::cty::c_uint = 32;
    pub const BPF_F_ADJ_ROOM_ENCAP_L2_ETH: ::cty::c_uint = 64;
    pub const BPF_F_ADJ_ROOM_DECAP_L3_IPV4: ::cty::c_uint = 128;
    pub const BPF_F_ADJ_ROOM_DECAP_L3_IPV6: ::cty::c_uint = 256;
    pub type _bindgen_ty_19 = ::cty::c_uint;
    pub const BPF_ADJ_ROOM_ENCAP_L2_MASK: ::cty::c_uint = 255;
    pub const BPF_ADJ_ROOM_ENCAP_L2_SHIFT: ::cty::c_uint = 56;
    pub type _bindgen_ty_20 = ::cty::c_uint;
    pub const BPF_F_SYSCTL_BASE_NAME: ::cty::c_uint = 1;
    pub type _bindgen_ty_21 = ::cty::c_uint;
    pub const BPF_LOCAL_STORAGE_GET_F_CREATE: ::cty::c_uint = 1;
    pub const BPF_SK_STORAGE_GET_F_CREATE: ::cty::c_uint = 1;
    pub type _bindgen_ty_22 = ::cty::c_uint;
    pub const BPF_F_GET_BRANCH_RECORDS_SIZE: ::cty::c_uint = 1;
    pub type _bindgen_ty_23 = ::cty::c_uint;
    pub const BPF_RB_NO_WAKEUP: ::cty::c_uint = 1;
    pub const BPF_RB_FORCE_WAKEUP: ::cty::c_uint = 2;
    pub type _bindgen_ty_24 = ::cty::c_uint;
    pub const BPF_RB_AVAIL_DATA: ::cty::c_uint = 0;
    pub const BPF_RB_RING_SIZE: ::cty::c_uint = 1;
    pub const BPF_RB_CONS_POS: ::cty::c_uint = 2;
    pub const BPF_RB_PROD_POS: ::cty::c_uint = 3;
    pub type _bindgen_ty_25 = ::cty::c_uint;
    pub const BPF_RINGBUF_BUSY_BIT: ::cty::c_uint = 2147483648;
    pub const BPF_RINGBUF_DISCARD_BIT: ::cty::c_uint = 1073741824;
    pub const BPF_RINGBUF_HDR_SZ: ::cty::c_uint = 8;
    pub type _bindgen_ty_26 = ::cty::c_uint;
    pub const BPF_SK_LOOKUP_F_REPLACE: ::cty::c_uint = 1;
    pub const BPF_SK_LOOKUP_F_NO_REUSEPORT: ::cty::c_uint = 2;
    pub type _bindgen_ty_27 = ::cty::c_uint;
    pub const bpf_adj_room_mode_BPF_ADJ_ROOM_NET: bpf_adj_room_mode = 0;
    pub const bpf_adj_room_mode_BPF_ADJ_ROOM_MAC: bpf_adj_room_mode = 1;
    pub type bpf_adj_room_mode = ::cty::c_uint;
    pub const bpf_hdr_start_off_BPF_HDR_START_MAC: bpf_hdr_start_off = 0;
    pub const bpf_hdr_start_off_BPF_HDR_START_NET: bpf_hdr_start_off = 1;
    pub type bpf_hdr_start_off = ::cty::c_uint;
    pub const bpf_lwt_encap_mode_BPF_LWT_ENCAP_SEG6: bpf_lwt_encap_mode = 0;
    pub const bpf_lwt_encap_mode_BPF_LWT_ENCAP_SEG6_INLINE: bpf_lwt_encap_mode = 1;
    pub const bpf_lwt_encap_mode_BPF_LWT_ENCAP_IP: bpf_lwt_encap_mode = 2;
    pub type bpf_lwt_encap_mode = ::cty::c_uint;
    pub const BPF_F_BPRM_SECUREEXEC: ::cty::c_uint = 1;
    pub type _bindgen_ty_28 = ::cty::c_uint;
    pub const BPF_F_BROADCAST: ::cty::c_uint = 8;
    pub const BPF_F_EXCLUDE_INGRESS: ::cty::c_uint = 16;
    pub type _bindgen_ty_29 = ::cty::c_uint;
    pub const BPF_SKB_TSTAMP_UNSPEC: ::cty::c_uint = 0;
    pub const BPF_SKB_TSTAMP_DELIVERY_MONO: ::cty::c_uint = 1;
    pub type _bindgen_ty_30 = ::cty::c_uint;
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct __sk_buff {
        pub len: __u32,
        pub pkt_type: __u32,
        pub mark: __u32,
        pub queue_mapping: __u32,
        pub protocol: __u32,
        pub vlan_present: __u32,
        pub vlan_tci: __u32,
        pub vlan_proto: __u32,
        pub priority: __u32,
        pub ingress_ifindex: __u32,
        pub ifindex: __u32,
        pub tc_index: __u32,
        pub cb: [__u32; 5usize],
        pub hash: __u32,
        pub tc_classid: __u32,
        pub data: __u32,
        pub data_end: __u32,
        pub napi_id: __u32,
        pub family: __u32,
        pub remote_ip4: __u32,
        pub local_ip4: __u32,
        pub remote_ip6: [__u32; 4usize],
        pub local_ip6: [__u32; 4usize],
        pub remote_port: __u32,
        pub local_port: __u32,
        pub data_meta: __u32,
        pub __bindgen_anon_1: __sk_buff__bindgen_ty_1,
        pub tstamp: __u64,
        pub wire_len: __u32,
        pub gso_segs: __u32,
        pub __bindgen_anon_2: __sk_buff__bindgen_ty_2,
        pub gso_size: __u32,
        pub tstamp_type: __u8,
        pub _bitfield_align_1: [u8; 0],
        pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
        pub hwtstamp: __u64,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union __sk_buff__bindgen_ty_1 {
        pub flow_keys: *mut bpf_flow_keys,
        pub _bitfield_align_1: [u8; 0],
        pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
    }
    #[test]
    fn bindgen_test_layout___sk_buff__bindgen_ty_1() {
        assert_eq!(
            ::core::mem::size_of::<__sk_buff__bindgen_ty_1>(),
            8usize,
            concat!("Size of: ", stringify!(__sk_buff__bindgen_ty_1))
        );
        assert_eq!(
            ::core::mem::align_of::<__sk_buff__bindgen_ty_1>(),
            8usize,
            concat!("Alignment of ", stringify!(__sk_buff__bindgen_ty_1))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<__sk_buff__bindgen_ty_1>())).flow_keys as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff__bindgen_ty_1),
                "::",
                stringify!(flow_keys)
            )
        );
    }
    impl __sk_buff__bindgen_ty_1 {
        #[inline]
        pub fn new_bitfield_1() -> __BindgenBitfieldUnit<[u8; 8usize]> {
            let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> =
                Default::default();
            __bindgen_bitfield_unit
        }
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union __sk_buff__bindgen_ty_2 {
        pub sk: *mut bpf_sock,
        pub _bitfield_align_1: [u8; 0],
        pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
    }
    #[test]
    fn bindgen_test_layout___sk_buff__bindgen_ty_2() {
        assert_eq!(
            ::core::mem::size_of::<__sk_buff__bindgen_ty_2>(),
            8usize,
            concat!("Size of: ", stringify!(__sk_buff__bindgen_ty_2))
        );
        assert_eq!(
            ::core::mem::align_of::<__sk_buff__bindgen_ty_2>(),
            8usize,
            concat!("Alignment of ", stringify!(__sk_buff__bindgen_ty_2))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff__bindgen_ty_2>())).sk as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff__bindgen_ty_2),
                "::",
                stringify!(sk)
            )
        );
    }
    impl __sk_buff__bindgen_ty_2 {
        #[inline]
        pub fn new_bitfield_1() -> __BindgenBitfieldUnit<[u8; 8usize]> {
            let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> =
                Default::default();
            __bindgen_bitfield_unit
        }
    }
    #[test]
    fn bindgen_test_layout___sk_buff() {
        assert_eq!(
            ::core::mem::size_of::<__sk_buff>(),
            192usize,
            concat!("Size of: ", stringify!(__sk_buff))
        );
        assert_eq!(
            ::core::mem::align_of::<__sk_buff>(),
            8usize,
            concat!("Alignment of ", stringify!(__sk_buff))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).len as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(len)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).pkt_type as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(pkt_type)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).mark as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(mark)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).queue_mapping as *const _ as usize },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(queue_mapping)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).protocol as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(protocol)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).vlan_present as *const _ as usize },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(vlan_present)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).vlan_tci as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(vlan_tci)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).vlan_proto as *const _ as usize },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(vlan_proto)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).priority as *const _ as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(priority)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).ingress_ifindex as *const _ as usize },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(ingress_ifindex)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).ifindex as *const _ as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(ifindex)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).tc_index as *const _ as usize },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(tc_index)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).cb as *const _ as usize },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(cb)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).hash as *const _ as usize },
            68usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(hash)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).tc_classid as *const _ as usize },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(tc_classid)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).data as *const _ as usize },
            76usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(data)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).data_end as *const _ as usize },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(data_end)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).napi_id as *const _ as usize },
            84usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(napi_id)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).family as *const _ as usize },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(family)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).remote_ip4 as *const _ as usize },
            92usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(remote_ip4)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).local_ip4 as *const _ as usize },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(local_ip4)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).remote_ip6 as *const _ as usize },
            100usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(remote_ip6)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).local_ip6 as *const _ as usize },
            116usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(local_ip6)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).remote_port as *const _ as usize },
            132usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(remote_port)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).local_port as *const _ as usize },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(local_port)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).data_meta as *const _ as usize },
            140usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(data_meta)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).tstamp as *const _ as usize },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(tstamp)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).wire_len as *const _ as usize },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(wire_len)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).gso_segs as *const _ as usize },
            164usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(gso_segs)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).gso_size as *const _ as usize },
            176usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(gso_size)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).tstamp_type as *const _ as usize },
            180usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(tstamp_type)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<__sk_buff>())).hwtstamp as *const _ as usize },
            184usize,
            concat!(
                "Offset of field: ",
                stringify!(__sk_buff),
                "::",
                stringify!(hwtstamp)
            )
        );
    }
    impl __sk_buff {
        #[inline]
        pub fn new_bitfield_1() -> __BindgenBitfieldUnit<[u8; 3usize]> {
            let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> =
                Default::default();
            __bindgen_bitfield_unit
        }
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct bpf_tunnel_key {
        pub tunnel_id: __u32,
        pub __bindgen_anon_1: bpf_tunnel_key__bindgen_ty_1,
        pub tunnel_tos: __u8,
        pub tunnel_ttl: __u8,
        pub __bindgen_anon_2: bpf_tunnel_key__bindgen_ty_2,
        pub tunnel_label: __u32,
        pub __bindgen_anon_3: bpf_tunnel_key__bindgen_ty_3,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union bpf_tunnel_key__bindgen_ty_1 {
        pub remote_ipv4: __u32,
        pub remote_ipv6: [__u32; 4usize],
    }
    #[test]
    fn bindgen_test_layout_bpf_tunnel_key__bindgen_ty_1() {
        assert_eq!(
            ::core::mem::size_of::<bpf_tunnel_key__bindgen_ty_1>(),
            16usize,
            concat!("Size of: ", stringify!(bpf_tunnel_key__bindgen_ty_1))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_tunnel_key__bindgen_ty_1>(),
            4usize,
            concat!("Alignment of ", stringify!(bpf_tunnel_key__bindgen_ty_1))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_tunnel_key__bindgen_ty_1>())).remote_ipv4 as *const _
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_tunnel_key__bindgen_ty_1),
                "::",
                stringify!(remote_ipv4)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_tunnel_key__bindgen_ty_1>())).remote_ipv6 as *const _
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_tunnel_key__bindgen_ty_1),
                "::",
                stringify!(remote_ipv6)
            )
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union bpf_tunnel_key__bindgen_ty_2 {
        pub tunnel_ext: __u16,
        pub tunnel_flags: __be16,
    }
    #[test]
    fn bindgen_test_layout_bpf_tunnel_key__bindgen_ty_2() {
        assert_eq!(
            ::core::mem::size_of::<bpf_tunnel_key__bindgen_ty_2>(),
            2usize,
            concat!("Size of: ", stringify!(bpf_tunnel_key__bindgen_ty_2))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_tunnel_key__bindgen_ty_2>(),
            2usize,
            concat!("Alignment of ", stringify!(bpf_tunnel_key__bindgen_ty_2))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_tunnel_key__bindgen_ty_2>())).tunnel_ext as *const _
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_tunnel_key__bindgen_ty_2),
                "::",
                stringify!(tunnel_ext)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_tunnel_key__bindgen_ty_2>())).tunnel_flags as *const _
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_tunnel_key__bindgen_ty_2),
                "::",
                stringify!(tunnel_flags)
            )
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union bpf_tunnel_key__bindgen_ty_3 {
        pub local_ipv4: __u32,
        pub local_ipv6: [__u32; 4usize],
    }
    #[test]
    fn bindgen_test_layout_bpf_tunnel_key__bindgen_ty_3() {
        assert_eq!(
            ::core::mem::size_of::<bpf_tunnel_key__bindgen_ty_3>(),
            16usize,
            concat!("Size of: ", stringify!(bpf_tunnel_key__bindgen_ty_3))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_tunnel_key__bindgen_ty_3>(),
            4usize,
            concat!("Alignment of ", stringify!(bpf_tunnel_key__bindgen_ty_3))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_tunnel_key__bindgen_ty_3>())).local_ipv4 as *const _
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_tunnel_key__bindgen_ty_3),
                "::",
                stringify!(local_ipv4)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_tunnel_key__bindgen_ty_3>())).local_ipv6 as *const _
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_tunnel_key__bindgen_ty_3),
                "::",
                stringify!(local_ipv6)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_bpf_tunnel_key() {
        assert_eq!(
            ::core::mem::size_of::<bpf_tunnel_key>(),
            44usize,
            concat!("Size of: ", stringify!(bpf_tunnel_key))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_tunnel_key>(),
            4usize,
            concat!("Alignment of ", stringify!(bpf_tunnel_key))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_tunnel_key>())).tunnel_id as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_tunnel_key),
                "::",
                stringify!(tunnel_id)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_tunnel_key>())).tunnel_tos as *const _ as usize },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_tunnel_key),
                "::",
                stringify!(tunnel_tos)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_tunnel_key>())).tunnel_ttl as *const _ as usize },
            21usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_tunnel_key),
                "::",
                stringify!(tunnel_ttl)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_tunnel_key>())).tunnel_label as *const _ as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_tunnel_key),
                "::",
                stringify!(tunnel_label)
            )
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct bpf_xfrm_state {
        pub reqid: __u32,
        pub spi: __u32,
        pub family: __u16,
        pub ext: __u16,
        pub __bindgen_anon_1: bpf_xfrm_state__bindgen_ty_1,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union bpf_xfrm_state__bindgen_ty_1 {
        pub remote_ipv4: __u32,
        pub remote_ipv6: [__u32; 4usize],
    }
    #[test]
    fn bindgen_test_layout_bpf_xfrm_state__bindgen_ty_1() {
        assert_eq!(
            ::core::mem::size_of::<bpf_xfrm_state__bindgen_ty_1>(),
            16usize,
            concat!("Size of: ", stringify!(bpf_xfrm_state__bindgen_ty_1))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_xfrm_state__bindgen_ty_1>(),
            4usize,
            concat!("Alignment of ", stringify!(bpf_xfrm_state__bindgen_ty_1))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_xfrm_state__bindgen_ty_1>())).remote_ipv4 as *const _
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_xfrm_state__bindgen_ty_1),
                "::",
                stringify!(remote_ipv4)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<bpf_xfrm_state__bindgen_ty_1>())).remote_ipv6 as *const _
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_xfrm_state__bindgen_ty_1),
                "::",
                stringify!(remote_ipv6)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_bpf_xfrm_state() {
        assert_eq!(
            ::core::mem::size_of::<bpf_xfrm_state>(),
            28usize,
            concat!("Size of: ", stringify!(bpf_xfrm_state))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_xfrm_state>(),
            4usize,
            concat!("Alignment of ", stringify!(bpf_xfrm_state))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_xfrm_state>())).reqid as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_xfrm_state),
                "::",
                stringify!(reqid)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_xfrm_state>())).spi as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_xfrm_state),
                "::",
                stringify!(spi)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_xfrm_state>())).family as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_xfrm_state),
                "::",
                stringify!(family)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_xfrm_state>())).ext as *const _ as usize },
            10usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_xfrm_state),
                "::",
                stringify!(ext)
            )
        );
    }
    pub const bpf_ret_code_BPF_OK: bpf_ret_code = 0;
    pub const bpf_ret_code_BPF_DROP: bpf_ret_code = 2;
    pub const bpf_ret_code_BPF_REDIRECT: bpf_ret_code = 7;
    pub const bpf_ret_code_BPF_LWT_REROUTE: bpf_ret_code = 128;
    pub const bpf_ret_code_BPF_FLOW_DISSECTOR_CONTINUE: bpf_ret_code = 129;
    pub type bpf_ret_code = ::cty::c_uint;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct bpf_sock {
        pub bound_dev_if: __u32,
        pub family: __u32,
        pub type_: __u32,
        pub protocol: __u32,
        pub mark: __u32,
        pub priority: __u32,
        pub src_ip4: __u32,
        pub src_ip6: [__u32; 4usize],
        pub src_port: __u32,
        pub dst_port: __be16,
        pub _bitfield_align_1: [u8; 0],
        pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
        pub dst_ip4: __u32,
        pub dst_ip6: [__u32; 4usize],
        pub state: __u32,
        pub rx_queue_mapping: __s32,
    }
    #[test]
    fn bindgen_test_layout_bpf_sock() {
        assert_eq!(
            ::core::mem::size_of::<bpf_sock>(),
            80usize,
            concat!("Size of: ", stringify!(bpf_sock))
        );
        assert_eq!(
            ::core::mem::align_of::<bpf_sock>(),
            4usize,
            concat!("Alignment of ", stringify!(bpf_sock))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_sock>())).bound_dev_if as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_sock),
                "::",
                stringify!(bound_dev_if)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_sock>())).family as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_sock),
                "::",
                stringify!(family)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_sock>())).type_ as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_sock),
                "::",
                stringify!(type_)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_sock>())).protocol as *const _ as usize },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_sock),
                "::",
                stringify!(protocol)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_sock>())).mark as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_sock),
                "::",
                stringify!(mark)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_sock>())).priority as *const _ as usize },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_sock),
                "::",
                stringify!(priority)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_sock>())).src_ip4 as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_sock),
                "::",
                stringify!(src_ip4)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_sock>())).src_ip6 as *const _ as usize },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_sock),
                "::",
                stringify!(src_ip6)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_sock>())).src_port as *const _ as usize },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_sock),
                "::",
                stringify!(src_port)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_sock>())).dst_port as *const _ as usize },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_sock),
                "::",
                stringify!(dst_port)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_sock>())).dst_ip4 as *const _ as usize },
            52usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_sock),
                "::",
                stringify!(dst_ip4)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_sock>())).dst_ip6 as *const _ as usize },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_sock),
                "::",
                stringify!(dst_ip6)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_sock>())).state as *const _ as usize },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_sock),
                "::",
                stringify!(state)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<bpf_sock>())).rx_queue_mapping as *const _ as usize },
            76usize,
            concat!(
                "Offset of field: ",
                stringify!(bpf_sock),
                "::",
